{
  "title": "148861891.on Parenting Behavioral Change And Elephants",
  "slug": "148861891on-parenting-behavioral-change-and-elephants",
  "publishedAt": "2025-11-30T19:29:39.401Z",
  "excerpt": "It occurred to me the other day that, if I where a parent, I could direct and lead and choose the actions I wanted my kid to do. If I wanted him to keep healthy and stay fit, for example, I could easi",
  "image": "",
  "readTime": "5 min",
  "content": [
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "It occurred to me the other day that, if I where a parent, I could direct and lead and choose the actions I wanted my kid to do. If I wanted him to keep healthy and stay fit, for example, I could easily only purchase organic fruits, vegetables, nuts, seeds, legumes and meat products and never let him once indulge on sweets and processed food. And if I wanted him to learn how to be a leader in his community, I could easily persuade him to speak up in class, and teach him how to speak in public, command attention, express his ideas and how to interact with others. And it would be an incredibly easy thing to do compared to the feat of motivating my own self to those things. Because with our kids, we can push them and past fear and discomfort without experiencing it ourselves, and we can selectively choose their options: you can eat",
          "marks": []
        },
        {
          "_type": "span",
          "text": "this",
          "marks": []
        },
        {
          "_type": "span",
          "text": ", you can drink",
          "marks": []
        },
        {
          "_type": "span",
          "text": "this",
          "marks": []
        },
        {
          "_type": "span",
          "text": ", you can go to bed and wake up at",
          "marks": []
        },
        {
          "_type": "span",
          "text": "this",
          "marks": []
        },
        {
          "_type": "span",
          "text": "time, you can initiate",
          "marks": []
        },
        {
          "_type": "span",
          "text": "this",
          "marks": []
        },
        {
          "_type": "span",
          "text": "project or read",
          "marks": []
        },
        {
          "_type": "span",
          "text": "this",
          "marks": []
        },
        {
          "_type": "span",
          "text": "book. What’s ironic (and funny even) is that we so often desire so much for ourselves, and (if we’re parents) demand so much from our kids, yet it’s incredibly easy to tell your kid, “no cookies,” or “bedtime’s at 8 pm” and get him to follow your rules, and so much harder for ourselves to follow those those same rules, even when we know deep down they’re good for us.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "This is partly because, when you’re simply choosing options, what to eat (or not eat), what time to go bed, what content to consume, how to spend one’s time, etc. you have no other options. You can simply say “this is the way things are, these are the rules” and as a kid, he has no choice by to follow them. As an adult, however, you’ve got a choice…sure, you can say “I won’t eat the candy bar in the back of the pantry,” but because there’s the actual choice still exists, and there’s no one telling you can’t eat it, you’re constantly faced with the choice “Should I eat it? Should I not eat it? How about just a bite?” And I think it’s that constant stress of having to choose to not choose that makes behavioral change of any kind so difficult. That’s what creates decision fatigue and a lack of willpower. It’s not that you don’t have self-control or good intentions, part of you knows you don’t want to eat the metaphorical (or literal) candy bar, but because you’re constantly faced with the choice, you gradually deplete your very limited store of energy required to just say “no”. On the flip side, if you’re a kid, are you don’t have access to the candy bar, you’re not fighting yourself about whether or not you should eat, because you can’t eat, you can’t find it, and therefore the choice doesn’t even exist.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "What’s going on here? Take a moment and consider the fact that you don’t simply have one mind, you have two: the self in self-control and someone else entirely, competing interests, all duking it out. Part of you, the “Elephant” as Dan and Chip Health call it in their book",
          "marks": []
        },
        {
          "_type": "span",
          "text": "Switch: How To Change Things When Change Is Hard",
          "marks": [
            "link-0"
          ]
        },
        {
          "_type": "span",
          "text": ", is like a child version of yourself. He wants what’s now and in the moment. He’s emotional, often looking for the quick short-term payoff (candy-bar) over the long-term benefit (being healthy). On the flip side there’s the “Rider,” the rational analytical side of our brain. He’s the parent of sorts, thinking long term about where he wants you to go, and who he wants you to be. He’s got the reins, sitting a top the Elephant, initially making the choices, until the 6-ton behemoth below disagrees about what to do next. One strategy to change is, yes, to rely on willpower entirely, but that’s the psychological equivalent of allowing the Rider to choose what to choose, then agonizing for 20 minutes to an hour about what to eat for dinner on a Friday night, waiting and waiting, pondering “should I make a salad vs. should I order a pizza,” while the emotional Elephant starves, until of course he just finally decides to give in. The Rider has a limited amount of control, and if the Elephant gives up and gives in, so to speak, he (the Elephant) is going to get his way. The rider is completely overmatched.",
          "marks": []
        }
      ],
      "markDefs": [
        {
          "_key": "link-0",
          "_type": "link",
          "href": "https://www.amazon.com/Switch-Change-Things-When-Hard/dp/0385528752"
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "A more useful strategy? Don’t give the Rider a choice. Plan ahead and don’t allow him time to deliberate over what to do next. Be a parent for yourself and don’t give yourself an option. Remove all candy-bars from your house, go to the closest salad-bar after work (invite a friend), sign-up",
          "marks": []
        },
        {
          "_type": "span",
          "text": "now",
          "marks": []
        },
        {
          "_type": "span",
          "text": "to give a talk at a conference, not later when you’re presented with the choice of saying no. And if you’re like me and want to start a habit of say, writing a daily blog, don’t sit around and wait and think about if it’s worth your time. Get up, make coffee, set a timer for a half hour and start typing. Repeat.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Don’t think about it. Don’t wait. Don’t give yourself the benefit of a choice. That’s one way to bypass the analytical Rider’s indecision and the emotional elephant’s lack of control.",
          "marks": []
        }
      ]
    }
  ]
}