{
  "title": "148863100.are Strikes Necessary",
  "slug": "148863100are-strikes-necessary",
  "publishedAt": "2025-11-30T19:29:56.145Z",
  "excerpt": "A strike sure seems like a good idea. You and others like you gather around to generally create a ruckus, and to bring attention to you and a cause you care about.",
  "image": "",
  "readTime": "2 min",
  "content": [
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "A strike sure seems like a good idea. You and others like you gather around to generally create a ruckus, and to bring attention to you and a cause you care about.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "It seems like a good idea. Except when you realize that the overwhelming majority of people who walk or drive past you or honk their horns for you or take the time to read your signs, honestly just don't care.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "They don't care about you or your cause or the commotion you're causing. Or how it affects them as much as it does you. And their likely not the least angry that people somehow allow this injustice to happen.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "It's not because people are don't care. Or because their inherently ignorant or selfish. It's just not the right context...people aren't open to changing their minds or being all ears when their walking or driving to and go.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Can you blame them? You likely didn't get swooped up in this cause by listening to the mob on your local streetcorner, either. No, you got where you are by talking to people you respect. By reading an article about it in bed. Or even patiently listening to a well researched podcast in your car.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Point is, a strike is not the same as putting on a good show. And for the onlookers--the people you're trying to change--it's a far cry from learning about a cause or a problem in their pjs.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "On the other hand, the folks who attend strikes are changed, for sure. Because it allows attendees to affirm their beliefs with others just like them, the same way that joining a club allows you to play an active role in groupthink.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "And so, from the inside looking out, it's a boon. From the outside, not so much.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Alas. If your goal is actually to change the hearts and minds of the people you're trying to market to, it might help to at least consider rethinking your approach.",
          "marks": []
        }
      ]
    }
  ]
}