{
  "title": "148861960.self Honesty Bravery",
  "slug": "148861960self-honesty-bravery",
  "publishedAt": "2025-11-30T19:29:40.665Z",
  "excerpt": "Someone told me recently that true bravery is being as honest with yourself as you can.",
  "image": "",
  "readTime": "3 min",
  "content": [
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Someone told me recently that true bravery is being as honest with yourself as you can.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "I didn’t quite understand that statement at first. But just yesterday I was going through a file bin I had back in college, and I came upon something tucked in the back of a plastic extending file folder.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Some time ago, in my junior year of college, I think, I wrote myself a 3 page manifesto of sorts explaining what I wanted for myself and my life in the years to come. It wasn’t exactly a list of goals or material things I wanted but more like a list character traits and attitudes I wanted to adopt.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Needless to say, it was really well written, combining pretty much everything I had learned about life up until that point. It was like a code of honor, a written declaration of my values, like my own version of Marcus Aurelius’s Meditations.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Alas, reading all this stuff that I had previously declared I wanted for myself (even though I have no recollection of writing it) and comparing how I currently live to the standards to which I had set, I realized that for the most part, I don’t live by these standards. Not because I don’t want to (I do). But because many of them require me to push beyond the limits of my comfort zone and my preconceived ideas about who I am. It takes guts to live on the edge, to take that kind of risk. And what’s more, it takes courage to accept wholeheartedly that these are things you want for yourself despite the fear they create inside of you.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "It’s so easy to pretend that these standards and values don’t exist. Because if they exist and I’m not doing anything to actualize them out of fear, then how can I possibly be proud of myself and the life I’m creating? If they don’t exist, there’s no problem. If I can convince myself that I don’t care if I actualize my full potential and live my life by these standards, then there’s no internal conflict, and I don’t have to experience any fear, because I can just settle.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "The alternative, of course, is self-honesty; to courageously embrace all that you want for yourself, and to do everything in your power to actualize those dreams.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "To strive to live by a higher standard, we must be brave in the face of the necessary risks of making our lives bigger, resilient against the undesirable consequences of our actions, and",
          "marks": []
        },
        {
          "_type": "span",
          "text": "honest",
          "marks": []
        },
        {
          "_type": "span",
          "text": "enough with ourselves to accept that this way of living and being are values of the highest degree.",
          "marks": []
        }
      ]
    }
  ]
}