{
  "title": "148861896.on Portion Management A Restaurateurs Crossroads",
  "slug": "148861896on-portion-management-a-restaurateurs-crossroads",
  "publishedAt": "2025-11-30T19:29:39.503Z",
  "excerpt": "Say I visit your restaurant and you have an amazing appetizer selection, full of stuff I'd gladly pay up to $10 to try, and a very nice wine selection. Say I order an $8 glass of Pine Ridge Chenin Bla",
  "image": "",
  "readTime": "3 min",
  "content": [
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Say I visit your restaurant and you have an amazing appetizer selection, full of stuff I'd gladly pay up to $10 to try, and a very nice wine selection. Say I order an $8 glass of Pine Ridge Chenin Blanc. Now you come out with a third of a cup full of wine. We’re talking less than 3 oz for a $8 glass of wine. What am I thinking? These folks just ripped me off! Before, I was really considering ordering a plate of Shrimp Ceviche, now not so much. I expected more, you gave less.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Or consider the restauranteur who charges $13.00 for a salad at a nice upscale-ish restaurant in the suburbs. He charges $5.00 extra for a protein selection, (chicken in my case) and brings something that looks more like a side salad. $20 for a salad when the two other restaurants adjacent to yours sell bigger salads that taste just as good for half that price! Or, consider the fact that I could have drove a few miles more to Sweetgreen and paid $10 for the best all-natural salad you can get in all of Northern VA, at a size big enough for two people.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Point is, the respective owners of each of these restaurants deliberately chose to charge that much for the wine and the salad. And then they also decided on the portions, how much a chef should put on the plate, or how much wine to pour. In my view, at least (and that’s what counts) they made a compromise to save money. Instead of over delivering and exceeding my expectations, they decided to charge a little more and deliver a little less than what I assumed I was paying for.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "And if you compromise once, people are going to expect you do it again.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "So many restauranteur’s put such an amazing effort into their menu and the vibe of the venue and the quality of the linens and plates, but then forget about the transaction, the promise, the small opportunity they have to over deliver when it matters most. Tomorrow, you won’t remember the unique silverware or the eclectic lighting or the lavish sofas in the foyer. What you’ll generally remember was the food. Because that’s why we go. To eat. And if you compromise on either quality or quantity in that department, we’ll notice.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "If you fall short on your first impression, if the glass of expensive wine is, in fact, half full, literally and metaphorically, how can you expect anyone to give you the benefit of the doubt a second time?",
          "marks": []
        }
      ]
    }
  ]
}