{
  "title": "148861924.on The Benefits Of Long Term Contracts",
  "slug": "148861924on-the-benefits-of-long-term-contracts",
  "publishedAt": "2025-11-30T19:29:40.461Z",
  "excerpt": "Last month, I signed up for a 12 month gym membership .",
  "image": "",
  "readTime": "3 min",
  "content": [
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Last month, I signed up for a 12 month gym",
          "marks": []
        },
        {
          "_type": "span",
          "text": "membership",
          "marks": [
            "link-0"
          ]
        },
        {
          "_type": "span",
          "text": ".",
          "marks": []
        }
      ],
      "markDefs": [
        {
          "_key": "link-0",
          "_type": "link",
          "href": "/the-psychological-struggle-of-literal-and-metaphorical-strength-training/"
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "That said, I made a commitment to workout for the next 12 months, and I’m prepared to do so. In fact, I’m preparing right now. I just woke up an hour earlier than I normally would so I’d have the time to pack a nutritious plant-based meal for lunch, and pack my gym bag. Mind you, these aren’t things I’ve normally done in the past, they’re simply habits. Habits I’ve deliberately made in the last month to help me ease into this new lifestyle and thus keep my commitment.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Thing is, I don’t think I’d be this serious about weight loss and eating healthy and working out every other day if it wasn’t for that 12 month contract. The fact that I know I’m stuck doing this for the next 12 months forces me continue doing it. Because if I don’t do it, my life’s going to suck, and I’m going to be essentially wasting $2,400 on nothing but physical exhaustion.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "I think having a system in place (a contract) that forces you to make a commitment doing the actions required of you to accomplish a long-term goal (and that has some really bad consequences if you fail) really helps the process in ways that would be a lot harder if you didn’t have that system.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "And it doesn’t just apply to gym memberships. What if, as a salesman, you signed a contract with your employer allowing them to take out a small percentage of your income if you *didn’t* hit your sales goals? Would it make you any more or less likely to achieve them?",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Or what if you and your spouse made a law-abiding contract forcing the you to pay 40% of your income to the other in the event that one of you cheats on the other? It sounds like a crude way to keep your relationship in check, and it is, but I’m sure the divorce rates would go down.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "And how about if you made a contract with a friend or family member whereby you would give them 5-10% of your yearly savings if you didn’t hit a particular personal goal by a certain date? Would it increase you chances of accomplishing it? I think so.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Long term contracts work for three reasons:",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "First, because they hold you accountable to others (social accountability is a huge motivator).",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Second, because they force you sacrifice the freedom of the choice about whether or not to give in to temptation or quit. Because let’s face it, if the cost of losing is great enough, you’re not going to end your proverbial diet for a proverbial cheeseburger and shake, no matter how good it might feel in any particular moment.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "And finally, because if the contract is long enough, it’ll force you to think about the long term implications of your present decisions, usually in a way that fosters growth, not stifles it. To use my gym membership as an example, I’m really motivated to lose weight right now, because the more I lose now the easier it’ll be in the weeks and months to come.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "If you want to accomplish a long-range goal, make a long-term contract. My bet is you’ll thank yourself in the long-run.",
          "marks": []
        }
      ]
    }
  ]
}