{
  "title": "148863190.the Semiotics Of Invention",
  "slug": "148863190the-semiotics-of-invention",
  "publishedAt": "2025-11-30T19:29:58.744Z",
  "excerpt": "I recently had an email exchange with an ‘Aftermarket Domain Broker’ who notified me that his client would be willing to sell me a domain name I was interested in acquiring for a small fee of a little",
  "image": "",
  "readTime": "2 min",
  "content": [
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "I recently had an email exchange with an ‘Aftermarket Domain Broker’ who notified me that his client would be willing to sell me a domain name I was interested in acquiring for a small fee of a little more than $5,000.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Acknowledging that I’d never allow myself to get so invested in something that I’d pay so much for something so little, I declined. But I realized many people aren’t so disinclined, which is why this chap is able to make a living doing what he does.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Shortly after reflecting on this experience, I realized that Einstein was, arguably, partially right when he said ‘creativity is the mother of invention.’ Because in the vast majority of cases, the pursuit of thrift is what gives way to invention. Creativity is simply the mother of thrift.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Invention of any sort is a product a limitations—building a cheaper rocket, making a slimmer phone, designing anything that works simpler than the solution that came before it. Life pushes you into a corner, and creativity (in the pursuit of thrift) is what enables you to come up with something more efficient, more effective, or more dynamic, within the confines of what's possible or what one can afford.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Ideas themselves are relatively cheap. Names of things, even more so. Which means that anyone can come up with something that's just as good as what's been taken, for a far cheaper investment than what any proprietor will take for their's.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "All it takes is a little ingenuity, or rather creativity,",
          "marks": []
        },
        {
          "_type": "span",
          "text": "in the pursuit of thrift.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "...",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "By thrift, I mean frugality with one's resources, not necessarily cheapness. Toy Story, for example, the first animated feature film, cost Pixar a lot more than it would have taken them to simply make a 2D version with the same story. (30 million to be exact.) But by being frugal with their creative talent and resources—and not wasting it on reckless action sequences and high-priced voiceovers—they were able to make a movie that won on it’s story, while also accomplishing the mission they set out to do.",
          "marks": []
        }
      ]
    }
  ]
}