{
  "title": "148861968.act The Way Youd Like To Be And Soon Youll Be The Way You Act",
  "slug": "148861968act-the-way-youd-like-to-be-and-soon-youll-be-the-way-you-act",
  "publishedAt": "2025-11-30T19:29:40.806Z",
  "excerpt": "Leonard Cohen penned that statement a while ago, and although it sounds simple, there’s a lot more to it than “if I act smart, I’ll be smart.”",
  "image": "",
  "readTime": "2 min",
  "content": [
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Leonard Cohen penned that statement a while ago, and although it sounds simple, there’s a lot more to it than “if I act smart, I’ll be smart.”",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Underneath that very simple statement is a very big idea, that you have the ability — the obligation even — to choose how you act, and more importantly, to choose who you think you are and what you believe about yourself.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "If you can change who you are just by repeatedly changing your actions and embodying the qualities that you value (“acting the way you’d like to be”), you ultimately get to choose how you go about living, who you are, and what you think you’re capable of.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "So for example, if you want to do something that might change your life for the better, but fear taking the risk for a non-physically threatening reason (like almost everyone, side for sociopaths) you *choose* to be afraid. Not “be afraid” in the sense that you have control over your feelings (you don’t), but “be afraid” in the sense that you can control how you act in this situation and thus choose how you respond to it.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "In other words, you get to choose to be courageous, to lean into your fear, and do it anyway. And if you do it enough, you’ll change what you think about yourself in terms of your relationship to fear (“maybe I’m more courageous than I think I am”). And so, by changing how you live, you ultimately get to choose who you are, and what you believe you can accomplish.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "And that means you are individually responsible for not only your life and where you’re going, but also who you are externally — how you act — and the internal narrative you tell yourself about you who you are and what you can be (i.e. “I’m the type of person who does X” or “I’m (insert quality you’d like to have here)”).",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Certainly, it’s still hard to change your actions, and that’s where most of us get stuck, but the ability to know that by changing your actions you can reinvent yourself to be whoever you want to be, that’s huge! And it’s that faith in knowing you can change, not only your life but also who you think you are, that’s half the battle in becoming the person you’d like to be, and staying there.",
          "marks": []
        }
      ]
    }
  ]
}