{
  "title": "148862491.brands Arent Built On Fairy Dust",
  "slug": "148862491brands-arent-built-on-fairy-dust",
  "publishedAt": "2025-11-30T19:29:46.490Z",
  "excerpt": "A lot of would-be marketers would have you believe that their agencies’ can solve all your problems with very little effort on your part. That keyword research and a polished website and convincing co",
  "image": "",
  "readTime": "3 min",
  "content": [
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "A lot of would-be marketers would have you believe that their agencies’ can solve all your problems with very little effort on your part. That keyword research and a polished website and convincing copy and ads will triple your sales, maximize conversions, and make you an instant success overnight.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Thing is, while the facade of digital branding might make you appear credible, you can’t hide behind verified reviews and honest exposure. Even gaming the algorithm to come out higher in search results counts for very little if your bounce rate is off the charts.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "The alternative is to work extra hard at making the best product you can (and telling the best story you can),",
          "marks": []
        },
        {
          "_type": "span",
          "text": "before",
          "marks": []
        },
        {
          "_type": "span",
          "text": "you spend considerable effort marketing your products.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Consider",
          "marks": []
        },
        {
          "_type": "span",
          "text": "Allbirds",
          "marks": [
            "link-0"
          ]
        },
        {
          "_type": "span",
          "text": ". While they might be belaboring the megaphone now, they didn’t start out that way. Their modest Kickstarter campaign gave them a little more than $100K to work with. After which they soon hired droves of biotech engineers and materials experts. They worked on developing processes to minimize waste, to exclusively use natural materials, and deliver on their mission to make “better shoes in a better way.”",
          "marks": []
        }
      ],
      "markDefs": [
        {
          "_key": "link-0",
          "_type": "link",
          "href": "https://www.inc.com/cameron-albert-deitch/allbirds-2018-company-of-the-year-nominee.html"
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "The result? Allbirds is now valued at 1.4 billion. They sell the most eco-friendly and comfortable wool runners available. And they have celebrities and media exposure and word-of-mouth essentially doing their marketing for them (for free!). It’s only now, five years in, that you might hear about them in an ad on Spotify or your favorite podcast.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Search rankings and SEO and fluid UX and celebrity endorsements mean very little if don’t have a brand to back it up. Whether you’re a product or a service, you’ll never be sought out if all you market is ill-concieved junk, irregardless of how successful you appear online.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Allbirds certainly could have used their Kickstarter money to pay celebrities (or a digital agency) to spread the word. To beat out other shoe manufactures in the search results for “most comfortable shoes.” To compete with Nike and Adidas and Zappos and Clarks. Or bankrupt themselves airing a 30-second tv ad.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Instead, Allbirds recycled most of their money back into R&D. They invested in building the infrastructure to build a even better product, and by extension, a better brand. They took actions that helped them stand out from their competitors, and that resonated with the people they were trying to serve.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Before they spent a dime on marketing or advertising, they build a brand worth talking about to begin with.",
          "marks": []
        }
      ]
    }
  ]
}