{
  "title": "148861816.when Robots Make Latte Art",
  "slug": "148861816when-robots-make-latte-art",
  "publishedAt": "2025-11-30T19:29:38.177Z",
  "excerpt": "I’m not saying that Starbucks will actually replace human baristas with robots. But what if?",
  "image": "",
  "readTime": "4 min",
  "content": [
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "I’m not saying that Starbucks will actually replace human baristas with robots. But what if?",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "I have no doubt that at some point in our future robots (combined with AI) will be able to perform manufacturing tasks far better than any human can. And far cheaper too, considering their life-cycle, their inevitable annual decline in cost in favor of newer technology, and, compared to, the regular expense of hiring and training new employees.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "If someone were to then create an automated robotic barista assembly-line type",
          "marks": []
        },
        {
          "_type": "span",
          "text": "system",
          "marks": [
            "link-0"
          ]
        },
        {
          "_type": "span",
          "text": ", from order to pick-up, those robots would have it made.",
          "marks": []
        }
      ],
      "markDefs": [
        {
          "_key": "link-0",
          "_type": "link",
          "href": "https://www.youtube.com/watch?v=UYcTG7YLTQw"
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "They could easily crank out something like 100 beverages in ten minutes…all perfect: the precise temperature, exact proportions, the recipe down a T. All you’d have to do is order on your phone and pick it up at the bar in 30 seconds. No waiting in line. No arguing with a human about how they messed up your order, or that you’re still waiting for your heated multigrain bagel with cream cheese. And the concept of food safety will be a thing of the past; there’s no such thing as human error if the rules and regulations are embedded in the code.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Furthermore, Starbucks could teach their robots new routines (like how to make a new beverage) store-wide in real-time. Imagine the marketing implications: They could think up a fancy new drink in the morning, tweet about it midday, and have every Starbucks on the planet be able to make it perfectly in minutes.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Perfect drinks. Delivered on time. No compromises. Happy customers.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "What about the latte art?",
          "marks": []
        },
        {
          "_type": "span",
          "text": "Certainly, robots will be able to make really cool designs, far more symmetrical than any human barista (you might even be able to pay extra for something custom made). But what about the",
          "marks": []
        },
        {
          "_type": "span",
          "text": "art",
          "marks": []
        },
        {
          "_type": "span",
          "text": "of latte art? If the foam is just printed on your beverage by a machine, is it the same? Can there be",
          "marks": []
        },
        {
          "_type": "span",
          "text": "wabusabi",
          "marks": [
            "link-0"
          ]
        },
        {
          "_type": "span",
          "text": "if it’s perfect? Or do we lose something if it’s not handmade, if it’s not touched by a human?",
          "marks": []
        }
      ],
      "markDefs": [
        {
          "_key": "link-0",
          "_type": "link",
          "href": "https://en.wikipedia.org/wiki/Wabi-sabi"
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "I think so. In fact, I think that despite the fact that robots can and will make lattes far better and far more efficient than you and I can, Starbucks will still need to employ quite a lot of humans for a while. We might come for the perfectly-crafted coffee beverage and the convenience, but we stay for the human connection, whether that’s with your barista or with the people who occupy the space around you. And there's something magical about having a latte handcrafted by a human.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "The truth is we need people who we can talk to, whether about the weather or the news headlines, or what we’re reading or what we’re doing. And companies like Starbucks need passionate people who can enthusiastically communicate what they offer, whether it’s a coffee-beverage, organic produce or the latest smartphone. They also need artists…people who create experiences, who treat people as human beings, and who bring passion and connection to their work, everyday.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Certainly, sometimes that connection requires that you suffer through some human error; it’s next to impossible for a human to make just 50 orders perfect in 15 minutes. But that’s okay, at least for most people, because that’s not nearly as important as simply being around humans. Being greeted and spoken to and treated with respect, and experiencing the joy of simply interacting with a good intentioned and thoughtful human being.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Certainly robots will replace our boring mundane jobs in our very-near future. But that doesn’t mean we won’t need artists of all kinds. Whether your job is to make latte art or it’s metaphorical equivalent (in whatever job market you find yourself in), we need the artist in you.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Better start now.",
          "marks": []
        }
      ]
    }
  ]
}