{
  "title": "148861918.a Lot Of Writing A Lot Of Writers",
  "slug": "148861918a-lot-of-writing-a-lot-of-writers",
  "publishedAt": "2025-11-30T19:29:40.317Z",
  "excerpt": "If you’ve ever opened the internet or browsed your local bookstore you’ve probably noticed, as I have, that there’s a lot of writing going on.",
  "image": "",
  "readTime": "2 min",
  "content": [
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "If you’ve ever opened the internet or browsed your local bookstore you’ve probably noticed, as I have, that there’s a lot of writing going on.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Whether it’s in a book, a newspaper (offline or on) a magazine, or a blog, there’s a ton of writing out there. And a lot of writers, too. Writers who probably have a lot more experience and skill at writing than you do.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "One way to look at this is to say, “I don’t have anything to say that someone else can’t say better.”",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Another way to look at it is to think, “I can make a change happen if I write for a few people, the people who will most read it, whether those people my family or closest friends, or anonymous strangers interested in what I have to say. At very least, I can write for myself. I can write to cement what I see and what I’ve learned in my mind, and use this platform as a way to enrich my life.”",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Certainly, there are people out there probably saying what you have to say but differently. But don’t use that as an excuse to not share your insights and thoughts and ideas with the world.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "You have a gift. Surely someone, somewhere will read it and learn from it, even if that someone is your future self.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "And think of it this way: if you don’t write, you’ll never come up with anything original.",
          "marks": []
        }
      ]
    }
  ]
}