{
  "title": "148862436.first Things First",
  "slug": "148862436first-things-first",
  "publishedAt": "2025-11-30T19:29:46.024Z",
  "excerpt": "One useful way to stay focused on whatever it is that you want to learn, engage with, or accomplish is to put it at forefront.",
  "image": "",
  "readTime": "2 min",
  "content": [
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "One useful way to stay focused on whatever it is that you want to learn, engage with, or accomplish is to put it at forefront.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "To automate it, to schedule it in or to make it easily accessible.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "A few ways to do this:",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "listItem": "number",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Make it a new habit by tying in to a pre-existing habit. If you already wake every morning and make coffee, for example, you start watching instruction videos for the 10-60 minute window you have while you drink it.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "listItem": "number",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Make it a weekly recurring calendar event and use a recurring email reminder with a link to the page, course or event. If you’re as preoccupied with achieving #inboxzero as I am, it should be relatively easy to see it in your inbox and be motivated to complete it on time.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "listItem": "number",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Arrange the icons on your home screen of your phone and desktop so that they only show what you most want to interact with. Same concept applies to browser bookmarks. Remove all time wasters, protect your attention.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "listItem": "number",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Post-it notes. I don’t know about you, but I tend to keep my work space as clean and organized as any photo in an IKEA catalogue. I can’t stand clutter. That said, something I recently discovered is that if I write a post-it note and place it in some obscure location in my room, I’ll feel an itch to do something with it until I remove it. Pretty useful technique if you’re looking to remind yourself to do something, and/or write a regular blog. If you jot down your ideas when they come to you on the notes, and leave them lying around, you’ll regularly see them, which often helps keep the idea in mind long enough to write a coherent post about it. Furthermore, you’ll also be much more likely to actually sit down and write a post or complete those tasks, because if you’re like me, you simply can’t stand leaving those notes lying around the room.",
          "marks": []
        }
      ]
    }
  ]
}