{
  "title": "148862044.theres Nothing Healthy To Eat In The Fridge",
  "slug": "148862044theres-nothing-healthy-to-eat-in-the-fridge",
  "publishedAt": "2025-11-30T19:29:42.036Z",
  "excerpt": "Sometimes, that might be a true statement. In which case, a healthy meal is often a short drive to the nearest grocery store.",
  "image": "",
  "readTime": "2 min",
  "content": [
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Sometimes, that might be a true statement. In which case, a healthy meal is often a short drive to the nearest grocery store.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "A more accurate statement, of course, might be, “there’s nothing I",
          "marks": []
        },
        {
          "_type": "span",
          "text": "want",
          "marks": []
        },
        {
          "_type": "span",
          "text": "to eat in the fridge.\"",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "A big part of overcoming the obstacles that tend to suspend lifestyle change is recognizing the subtle ways you've trained yourself to compromise in the past, while learning to assert the certain obstinance necessary to fully commit to the habits and choices that make change sustainable.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "In the case of food, that can often mean noticing your habit of sabotaging your diet when a healthy meal isn't in close proximity. Of course, vegans don't decide to eat meat \"just this once\" because their coworkers brought in KFC for the staff lunch. And teetotalers don't toast champagne. They don't get to decide to decide. They just get to work around it.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "That's what commitment is, of course. Recognizing the seemingly urgent and prominent justifications we make and obeying our rules irregardless. Not giving ourselves the luxury of choice.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Not considering, or evaluating, or mullng it over. But simply",
          "marks": []
        },
        {
          "_type": "span",
          "text": "obeying",
          "marks": []
        },
        {
          "_type": "span",
          "text": "a rule you set for yourself before you found reasons (excuses) to give up.",
          "marks": []
        }
      ]
    }
  ]
}