{
  "title": "148863248.barriers To Entry",
  "slug": "148863248barriers-to-entry",
  "publishedAt": "2025-11-30T19:29:59.456Z",
  "excerpt": "Linkedin has a 300 character limit on messages to non-connections…making it near impossible to craft anything without sounding at least slightly abrasive. This not only makes it far less likely that p",
  "image": "",
  "readTime": "2 min",
  "content": [
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Linkedin has a 300 character limit on messages to non-connections…making it near impossible to craft anything without sounding at least slightly abrasive. This not only makes it far less likely that people outside your network will connect with you, but completely undermines Linkedin’s core vision, to “create economic opportunity for every member of the global workforce.”",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "That's because if all you do on Linkedin is connect with people who know you (or who craft something that piques your interest in under 300 characters), any ‘opportunities to connect,’ and by extension, land a job at your company, will obviously go to people already in your network. Talk about inequity.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "‘Barriers to entry’ only make this task harder…because not only do you have to compete with people who, for one way or another, already",
          "marks": []
        },
        {
          "_type": "span",
          "text": "know",
          "marks": []
        },
        {
          "_type": "span",
          "text": "the people who could give you a job, you have reach out (with limitations), hope they’ll respond to you,",
          "marks": []
        },
        {
          "_type": "span",
          "text": "and",
          "marks": []
        },
        {
          "_type": "span",
          "text": "make a good impression. (Worth noting that doing this all online—with no networking events or opportunities in sight—only makes this even harder.)",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Of course, all of this assumes that the people you’re connecting with will be even moderately inclined to connect and communicate with you. Many people seem to take the view that (as a recent connect explained to me), ‘feel that they can offer more value to their (respected) networks when they know the people in it’ and, as such, ‘generally don’t do open-networking like many others.’",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Apparently, just ‘connecting with anyone,’ is ineffectual at best, and shameful at worst. Because, even though there’s absolutely zero marginal cost to connect with someone you don’t know (with perhaps the slight annoyance of seeing their posts in your feed), including them in your network can somehow deprive your existing (closed) network. (Even when the willingness of strangers to give opportunities to strangers is the only way(!) anyone has ever landed a job.)",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "/rant",
          "marks": []
        }
      ]
    }
  ]
}