{
  "title": "148862908.thoughts On Brand",
  "slug": "148862908thoughts-on-brand",
  "publishedAt": "2025-11-30T19:29:53.177Z",
  "excerpt": "I recently overheard an CEO say that his firm offered a total of “91 services,” and that their unique core differentiator (after nearly three decades of experience) was their “professional strategic m",
  "image": "",
  "readTime": "2 min",
  "content": [
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "I recently overheard an CEO say that his firm offered a total of “91 services,” and that their unique core differentiator (after nearly three decades of experience) was their “professional strategic management and cost analysis process.”",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "A few thoughts:",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "listItem": "number",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Strategies, techniques and tactics are not services. Consulting is a service. Pizza-making is a service. How you go about it is not.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "listItem": "number",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "A generic differentiator is, by definition, a faulty differentiator. If your best perk is your ‘excellent customer service, better pricing, or more efficient, solutions-focused process,’ you’re going to find yourself in a pretty crowded marketplace (regardless of your actual industry). Why not bend over backwards to offer something that’s truly remarkable, instead?",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "listItem": "number",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "If you can’t manage to discriminate your brand between fun & formal, conservative & liberal, or modern & traditional (in other words, pass a brand questionnaire) you have a brand name. Not a brand.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "listItem": "number",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Likewise, if you try to appeal to everyone, you’re going to default to appealing to almost no one. Better to make and market your services for a minimum viable audience, instead.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "listItem": "number",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "By far, the most effective strategy way to communicate what you offer in a way that gets people to feel excited about it is to say it in the most uncomplicated and direct way possible. If your intention is impact, ditch the fancy buzzwords and specs, and go for simple, straightforward disclosure instead.",
          "marks": []
        }
      ]
    }
  ]
}