{
  "title": "148863651.reasonable Rational",
  "slug": "148863651reasonable-rational",
  "publishedAt": "2025-11-30T19:30:04.791Z",
  "excerpt": "In his new book, Morgan Housel makes a great case for taking reasonable actions that enable you to sustain an activity long-term, as opposed to taking fully rational actions that look amazing on paper",
  "image": "",
  "readTime": "2 min",
  "content": [
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "In his new book,",
          "marks": []
        },
        {
          "_type": "span",
          "text": "Morgan Housel",
          "marks": [
            "link-0"
          ]
        },
        {
          "_type": "span",
          "text": "makes a great case for taking reasonable actions that enable you to sustain an activity long-term, as opposed to taking fully rational actions that look amazing on paper, but are hard to commit to indefinitely.",
          "marks": []
        }
      ],
      "markDefs": [
        {
          "_key": "link-0",
          "_type": "link",
          "href": "https://www.amazon.com/Psychology-Money-Timeless-lessons-happiness/dp/0857197681"
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "I’ve since been seeing this idea pop up in all areas of life.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Consider: when I was in college, I used to try to will myself to run a mile along a woodland trail by my apartment. I hated every minute of it, which is why I’d so often gave up. On the other hand, I loved",
          "marks": []
        },
        {
          "_type": "span",
          "text": "walking",
          "marks": []
        },
        {
          "_type": "span",
          "text": "the trail.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Sure, running might burn more calories. But if the sheer difficulty of it causes you to give it up every other time, it’s not a sustainable (or effective) form of exercise. In my case, walking was, and is, more reasonable, because I enjoy it enough to keep doing it.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Or consider another health-related habit: diets. Many diets are far too strict for any reasonable person to stick to long-term (strict keto and strict vegan come to mind). On the other hand, there are many other diets that, while a little less effective, are more sustainable.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "One last example: saving and investing. Many people assume that a successful investment strategy involves either making the right bets, making a ton of money, or living like a monk. Strategies that are far too difficult for many people to commit to long term.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Might I suggest a better approach: Save what you can. Don't spend too much. Invest in a better investment strategy (i.e. index funds). By seeking out moderation (in your expenditures and bets) you can afford to",
          "marks": []
        },
        {
          "_type": "span",
          "text": "not",
          "marks": []
        },
        {
          "_type": "span",
          "text": "be a great investor, just an average one.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Less risk. Less reward. But certainly easier to stick to for the long-haul.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Reasonable. Not completely rational.",
          "marks": []
        }
      ]
    }
  ]
}