{
  "title": "148862067.no Littering",
  "slug": "148862067no-littering",
  "publishedAt": "2025-11-30T19:29:42.585Z",
  "excerpt": "A word of caution: this post isn’t for you.",
  "image": "",
  "readTime": "4 min",
  "content": [
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "A word of caution: this post isn’t for you.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "This post is for the folks who look just like you and me. People who (often grudgingly) pay their taxes, who have a job and who own a flat. Who exercise their freedom of speech just as much as they entertain their right to access the world wide web. They can go to the local superstore on any given Sunday with a credit card and buy anything they want. Or go teach themselves a new skill online for free at the public library. They look like any other person over the age of twenty.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "And yet.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "These folks don't act like adults. They swear in public. They treat people with disrespect. They cheat, they lie, they steal…in their own unique ways. They drive far faster than an appropriate speed on the freeway. They’re selfish at the expense of others. And they simply don’t understand that the rights handed to them by our society entitle them to the responsibilities of acting like an adult.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "This post is for them, not you. This is a rant for the troublemakers. Hence, from this point on, when I say “you,” I’m speaking directly to the former group. Not you, if you is the ever curious reader who simply can't stop. But you, the person who actually might learn something from this post. Here’s the memo you never got.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "If you pay taxes so our government can build the roads you drive on everyday to work, you have a right to use them, but with that you also have the responsibility of driving at speed that is safe and consistent with the other cars around you. Otherwise those drivers won’t be able to adjust where they are in the time it takes for you to switch lanes and speed through traffic, which causes accidents.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Likewise, if you believe that everyone (including yourself) has the right to a jury trial, you have a responsibility as a member of the community to go to jury duty if selected.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "If you received an education in the United States, you have a responsibility to pay your taxes to further extend that resource to current and future generations.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "And if you go to a public place to get food or tools or meds or office supplies, you have a responsibility to treat the people there with dignity and respect.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "The truth is rights come with responsibilities. You've been given a lot of leverage, vast degrees of freedom handed down for free by a collective community of strangers. And all we ask is that you treat us with respect. That, frankly, you obey the rules.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "A lot of people of this generation feel like they’re entitled to the world and to a good job and to a luxurious lifestyle. And that it’s society's fault if their expectations aren’t met. If they end up working for the man making less than an ideal salary because their degree didn’t land them their dream job. Or if technology (or politics) haven’t yet caught up to the standards of your favorite science-fiction novel. Or if our present economy optimizes itself by further widening the income inequality gap.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "But that’s no excuse for rule-breaking. Or contempt. Or cheating. Or theft.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "In fact, it’s an opportunity to set an example. To do your part in creating (and maintaining) a stable society. To demand",
          "marks": []
        },
        {
          "_type": "span",
          "text": "guardrails",
          "marks": [
            "link-0"
          ]
        },
        {
          "_type": "span",
          "text": ". And to pay your metaphorical taxes (with interest) for the incredible standards of living and freedoms our society has given us.",
          "marks": []
        }
      ],
      "markDefs": [
        {
          "_key": "link-0",
          "_type": "link",
          "href": "http://sethgodin.typepad.com/seths_blog/2016/08/demand-guardrails.html"
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Sure, you have a right to use the park. But you also have an obligation to pick up after yourself. And a responsibility (dare I say, a privilege) to your teachers and leaders, to your parents and friends, to your kids and their kids, to leave this place cleaner than you found it.",
          "marks": []
        }
      ]
    }
  ]
}