{
  "title": "148862121.on Taking Responsibility At The Convenience Store",
  "slug": "148862121on-taking-responsibility-at-the-convenience-store",
  "publishedAt": "2025-11-30T19:29:43.359Z",
  "excerpt": "Went to a Sheetz the other day.",
  "image": "",
  "readTime": "3 min",
  "content": [
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Went to a Sheetz the other day.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "The man who held the door for me said, “Come on in, they’ll take your money like they’ll take mine.”",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "I wasn’t exactly sure if he was joking or complaining. It sounded like both.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Here’s my thinking.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Well of course they’ll take your money! That’s what (most) businesses do. The purpose of a business is to sell you (a customer) a product or a service that you value more (at least in the immediate moment) than the amount of money you’re handing over for it.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "You also get to chose what store (if any) you enter. You get to decide how you spend your time and money and (usually) where you go in physical space. And it's also your responsibility (mostly) for whatever you experience within that space.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Which is to say, assuming you're not literally trapped somewhere or under your parent's jurisdiction, then most likely the situation you find yourself in is the result of a prior choice you made to go to a place or do a specific thing. And so, whatever befalls you as a result of your previous decision-making, is, in part, your responsibility.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Which brings about an important point: whenever your tempted to sue someone (or complain about a service) because you didn’t get what you expected, consider this: you chose to interact with that company or that person or buy that thing. Certainly you may not have received what you thought you paid for, but that doesn’t mean it wasn’t your choice. You made it. You should have assessed the risks before making it. It’s your mistake just as much as it is theirs.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "If the plane your on is delayed because of the weather, it's not the airline's fault. It's",
          "marks": []
        },
        {
          "_type": "span",
          "text": "yours",
          "marks": []
        },
        {
          "_type": "span",
          "text": "for stepping on the plane. And it's your responsibility to exercise choice over what to do next, whether it be to remain anxious in your seat, or to get off, rent a car and drive home yourself, or stay an extra night in Kalamazoo.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Likewise, if your boss fires you, or your phone blows up, or your latte was made poorly, don’t complain to the customer service rep, or act like a two year old, or sue the owners. It was your choice to interact with these people (and businesses) from the start. The responsibility is yours to decide where to go from here.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "If you buy an internal combustion engine and you can’t afford to pay for gas that’s your problem, not Exxon's. And if you enter a Sheetz and walk out with a Large Pepsi and Cheetos in exchange for $4.32 in cash, you don’t have any right to complain to anyone but yourself.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "A significant part of what it means to be a mature adult is accepting the responsibility that comes from the",
          "marks": []
        },
        {
          "_type": "span",
          "text": "freedom",
          "marks": [
            "link-0"
          ]
        },
        {
          "_type": "span",
          "text": "of choosing which train your on. Even if it sometimes gets derailed.",
          "marks": []
        }
      ],
      "markDefs": [
        {
          "_key": "link-0",
          "_type": "link",
          "href": "http://sethgodin.typepad.com/seths_blog/2017/07/the-cost-of-independence.html"
        }
      ]
    }
  ]
}