{
  "title": "148861824.on Putting A Name To Shenpa The Root Of Why We Suffer",
  "slug": "148861824on-putting-a-name-to-shenpa-the-root-of-why-we-suffer",
  "publishedAt": "2025-11-30T19:29:38.364Z",
  "excerpt": "When we tighten up (and lose our temper), when we shut down (and don’t listen to our parter), when we get attached to or tempted by things (addictions of all kinds), at first we begin with a feeling. ",
  "image": "",
  "readTime": "3 min",
  "content": [
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "When we tighten up (and lose our temper), when we shut down (and don’t listen to our parter), when we get attached to or tempted by things (addictions of all kinds), at first we begin with a feeling. Certainly, thoughts arise out of those feelings…but it’s the sensation that really hooks us. It’s the sensation that encourages us, often, to do the very thing we don’t want to do, to give in to the urge just to make it go away.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Without a word for this feeling, we’re out of luck. No way to describe it, no way to communicate it, no way to talk about what we should do when we experience it. So what do we do? We often tighten up, we often shut down. Far too often we give into our vices, only to make our addictions stronger. “We scratch the itch,” As Pema Chödrön says, even though, just as with chicken pocks, scratching just makes our condition worse, and the habit of scratching stronger.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Yesterday I learned that tibetan buddhists have a word this: they call it",
          "marks": []
        },
        {
          "_type": "span",
          "text": "Shenpa",
          "marks": [
            "link-0"
          ]
        },
        {
          "_type": "span",
          "text": ". Shenpa is the sticky feeling of being hooked, of tightening, of withdrawing, of being tempted, of unease, and moreover, of attachment. Attachment to things that help us escape from what we’re experiencing now, that help us to not feel a feeling we’re experiencing at a present moment in our lives.",
          "marks": []
        }
      ],
      "markDefs": [
        {
          "_key": "link-0",
          "_type": "link",
          "href": "https://www.lionsroar.com/how-we-get-hooked-shenpa-and-how-we-get-unhooked/"
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "What struck me about this idea is how powerful it is to put a name to thing that is ironically ineffable. Something we all experience on a daily basis, and yet don’t talk about. Because feelings are complex, and it can be hard to explain what you’re experiencing. But once we have a word for it, we can label it, we can talk about it like it’s a real thing, because it is. So that the next time we find ourselves closing down from what we’re experiencing, or giving into things to help us escape from our present experience, we can acknowledge what we’re feeling as “it’s just shenpa.”",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "And so, we can learn to acknowledge it (because it’s a real fundamental experience of the human condition). And we can do what buddhists do: we can learn to sit with it (meditation helps) and relax. And we learn (gradually) how to refrain from giving in to our habitual tendencies to avoid this feeling altogether. Feeling shenpa is a part of life. Giving in to the negative habits we’ve developed to help us avoid those feelings is not.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "As Pema Chödrön says, “The secret (to living with shenpa) is non-attachment…don’t bite that hook.” But even before can learn to become non-attached, to open to our feelings at present, the trick is to acknowledge that what we’re feeling and experiencing is real. To put a name to it, to label it. To be open the possibility of being open to it in the first place. Only from there can we proceed.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "For an eye-opening, dare-I-say life changing examination of shenpa, check out Pema Chödrön’s lecture series on the topic:",
          "marks": []
        },
        {
          "_type": "span",
          "text": "Getting Unstuck",
          "marks": [
            "link-0"
          ]
        },
        {
          "_type": "span",
          "text": ".",
          "marks": []
        }
      ],
      "markDefs": [
        {
          "_key": "link-0",
          "_type": "link",
          "href": "http://www.soundstrue.com/store/getting-unstuck-3900.html"
        }
      ]
    }
  ]
}