{
  "title": "148863251.market Space And Gravity",
  "slug": "148863251market-space-and-gravity",
  "publishedAt": "2025-11-30T19:29:59.532Z",
  "excerpt": "One of the biggest hurdles* of any entrepreneurial venture is assessing the degree to which a product is both needed collectively, and the degree to which that need is needed by those inclined to pay ",
  "image": "",
  "readTime": "2 min",
  "content": [
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "One of the biggest hurdles* of any entrepreneurial venture is assessing the degree to which a product is both needed collectively, and the degree to which that need is needed by those inclined to pay for it.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "In other words, you have to check if there's both a market for your product (to test if it's viable), and also if there's enough space in the market for your venture (to test if it’s scalable).",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "The first test is relatively easy...a survey, or some extensive keyword research will do. The second, on the other hand, is what throws many would-like-to-be entrepreneurs through loops.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "How can test you whether there are enough people in the market that are willing and eager to buy from you?",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "After all, it's one thing to have a need (you might want a better way to make your morning coffee, for example), but unless you can validate that an sufficient amount of other people also want or need your solution, it's never going to work as a profitable business.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Seth’s ‘",
          "marks": []
        },
        {
          "_type": "span",
          "text": "first, ten",
          "marks": [
            "link-0"
          ]
        },
        {
          "_type": "span",
          "text": "’ approach (now a ten-year old idea) is still the best litmus test I've come across that can help you overcome this hurdle. Because limiting your pool to just ten people (your ‘minimum viable audience,’ as it were) can help you gauge whether it’s marketable",
          "marks": []
        },
        {
          "_type": "span",
          "text": "before",
          "marks": []
        },
        {
          "_type": "span",
          "text": "you go out and invest any more in manufacturing or marketing it.",
          "marks": []
        }
      ],
      "markDefs": [
        {
          "_key": "link-0",
          "_type": "link",
          "href": "https://seths.blog/2009/04/first-ten/"
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "It’s cheaper and far more time-effective too...because instead of making a thing and depleting your savings by bringing it to market (before you even know it’s",
          "marks": []
        },
        {
          "_type": "span",
          "text": "marketable",
          "marks": []
        },
        {
          "_type": "span",
          "text": "), testing incrementally and exponentially can ensure that once you’ve actually ‘entered the market,' you’ll have made a thing that people are more than eager to buy.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "In other words, the best way to test whether your product will scale up is see how it performs when scaled down. If it doesn’t ‘work’ at least on the ground, there’s no chance it’ll work in the air, or above it.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "...",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "*Perhaps the biggest challenge of any business is bringing a product to market, all while staying profitable and sustainable for the long haul (but that's a subject of another book entirely).",
          "marks": []
        }
      ]
    }
  ]
}