{
  "title": "148861898.behavioral Patterns In The Customer Service Industry",
  "slug": "148861898behavioral-patterns-in-the-customer-service-industry",
  "publishedAt": "2025-11-30T19:29:39.541Z",
  "excerpt": "After having worked in the world of customer service for a while, you start to see patterns. Here a few that have caught my attention:",
  "image": "",
  "readTime": "4 min",
  "content": [
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "After having worked in the world of customer service for a while, you start to see patterns. Here a few that have caught my attention:",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "For one, people, whether they are aware of it or not, tend to enter a line or a queue in waves. People more than likely don’t know the person(s) standing next to them, but in general, they tend to walk in at about the same time. Barista’s and restaurant hostesses are very much aware of this, and tend to prep both themselves (and their work environments) just before peak times. This is why the best time to order a",
          "marks": []
        },
        {
          "_type": "span",
          "text": "Tall, Half-Caff, Soy Latte At 120 Degrees",
          "marks": [
            "link-0"
          ]
        },
        {
          "_type": "span",
          "text": "and get your order right is to go in ten minutes before a wave. The trick is knowing when those peak times are, which any barista or hostess won’t hesitate to tell you. Tip: The high school crowd gets out of school at 2:00 pm in northern Virgnia.",
          "marks": []
        }
      ],
      "markDefs": [
        {
          "_key": "link-0",
          "_type": "link",
          "href": "http://www.huffingtonpost.com/2013/07/30/starbucks-drink-orders_n_3671496.html"
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Also, people are generally very impatient. Not all people. Just most. They have horrible “waiting in line” etiquette where they cross their arms and expose their nervous ticks for the world (and the ever watchful barista) to see. Heat generally",
          "marks": []
        },
        {
          "_type": "span",
          "text": "exacerbates",
          "marks": [
            "link-0"
          ]
        },
        {
          "_type": "span",
          "text": "this process, making people that would under a slightly irritated person under normal weather conditions miraculously degrade into a person who starts yelling at you from 2 feet away. Key takeaway: AC helps a lot, so does being aware of it. It’s not you, it’s the heat.",
          "marks": []
        }
      ],
      "markDefs": [
        {
          "_key": "link-0",
          "_type": "link",
          "href": "http://www.today.com/health/heat-waves-lead-hot-tempers-heres-why-6C10436073"
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "One last thing, lots of people are selfish. This isn’t because people are downright in it for themselves, we’re not sociopaths. We’re just either under a lot of stress or under a time constraint or maybe our parents taught us that it’s a “dog eat dog” world, where the only way to get ahead is to put others down. There’s certainly a",
          "marks": []
        },
        {
          "_type": "span",
          "text": "genetic",
          "marks": [
            "link-0"
          ]
        },
        {
          "_type": "span",
          "text": "component for selfish behavior (and I’m sure some of us have it more than others), but I think it’s our environment and upbringing (nurture so to speak) that play a much larger role in shaping how we respond.",
          "marks": []
        }
      ],
      "markDefs": [
        {
          "_key": "link-0",
          "_type": "link",
          "href": "https://en.wikipedia.org/wiki/The_Selfish_Gene"
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Some thoughts: Anger, impatience and stress generally compound. Catharsis is a default habit for most people, and if someone is starting off from the mindset of “I have this project I have to finish before noon, and if she doesn’t get my drink finished I gonna hear it from my boss,” it’s really easy to begin to think only in terms of “me.” This is what leads people from thinking “I have so much to get done, here I am waiting in line,” to thinking “what the hell is taking so long? I’m surrounded by idiots,” and then doing or saying something they later regret. Another thing: if you find that you’ve been taught to look at the world from a “me vs. them” mindset, where competition for scarce resources or opportunities is what the real world is all about, you’re much more likely to have a bias for selfish behavior. This, I think, is the basis for outrageously selfish behaviors such as interrupting transactions with other customers mid-sentence, just to get a refund on something they don’t like, pulling one’s car out in front of four lanes of traffic so you don’t have to wait at the light, and probably most forms of larceny. I’m not advocating we simply forgive these people because they had bad parents or teachers, but that we acknowledge that maybe these people are simply",
          "marks": []
        },
        {
          "_type": "span",
          "text": "doing the best they can",
          "marks": [
            "link-0"
          ]
        },
        {
          "_type": "span",
          "text": "with the narrative they have repeating in their heads, as well as the self-fulfilling world’s they’ve created as a result. No, this might not make you any less disgusted by the behavior, but it might lead you to a better (less self-righteous, more compassionate) outlook on the world.",
          "marks": []
        }
      ],
      "markDefs": [
        {
          "_key": "link-0",
          "_type": "link",
          "href": "https://theblueroomblog.org/read-this-now-brene-browns-rising-strong/"
        }
      ]
    }
  ]
}