{
  "title": "148862203.they Lost Me At The Fidget Spinners",
  "slug": "148862203they-lost-me-at-the-fidget-spinners",
  "publishedAt": "2025-11-30T19:29:43.782Z",
  "excerpt": "Brookstone, what once was my favorite retailer, went bankrupt last August, and only after closing almost all of it’s retail stores, was later bought out last month. Weeks ago, before my local store cl",
  "image": "",
  "readTime": "3 min",
  "content": [
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Brookstone, what once was my favorite retailer, went bankrupt last August, and only after closing almost all of it’s retail stores, was later bought out last month. Weeks ago, before my local store closed, I stopped by for one last visit.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Here’s what I saw: piles and piles of useless junk on clearance. 98 cent",
          "marks": []
        },
        {
          "_type": "span",
          "text": "fidget spinners",
          "marks": [
            "link-0"
          ]
        },
        {
          "_type": "span",
          "text": ", clunky massagers, exhorbitantly expensive pillows, and a stockpile of other cheaply-made consumer goods.",
          "marks": []
        }
      ],
      "markDefs": [
        {
          "_key": "link-0",
          "_type": "link",
          "href": "https://www.brookstone.com/pd/Spinlets-Fidget-Spinner-Add-Ons/324952.html?bkeid=compare%7Cmercent%7Cgooglebaseads%7Csearch&bkeid=compare%7Cmercent%7Cgooglebaseads%7Csearch&gclid=EAIaIQobChMI1NiyoLnt3gIV3ouzCh2IIwjrEAQYBCABEgI4SPD_BwE&gclsrc=aw.ds"
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "How is it that what used to be the epicenter of the long-tail consumer product industry can’t even sell the rest of it’s heavily discounted inventory of oddities?",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "My best guess: somewhere along the way, Brookstone lost sight of it’s true fans.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Rather than stocking high quality, unique and curated products, and selling them to the small commited group of people eager to pay for them, Brookstone decided it was a better strategy to make money by by selling mass-produced (and poorly made) stuff for everyone and anyone who would buy it.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "At some point, the Brookstone executive team forgot that it’s primarly customers were people willing to go the extra mile for the newest and coolest of consumer goods. Instead, it opted to pay for and stock the latest fad, the gimmicky toy, and the out of place plush contrivance.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Of course, if Brookstone was nothing more than mashup on Best Buy and Bed Bath & Beyond, there’s no way it could differentiate itself, let alone identify with a core group. And so, over time, by trying to appeal to everyone, it ultimately appealed to no one, and eventually sold itself out.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "I don’t mean to exclusively condemn Brookstone. I’m merely using it as a case-study to prove a point: Aligning your business objectives with your core fans is the business equavalent of putting your money where you mouth is.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "More often than not, that takes nerve, because it means you can’t make a product (or a store) for everyone. Just the few who care. Which means you have to take the risk of betting your business on those people from the start. Anything less than that, particularly in retail, and you risk becoming a commodity store. And how do you compete like that?",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Contrast Brookstone’s strategy with",
          "marks": []
        },
        {
          "_type": "span",
          "text": "B8ta",
          "marks": [
            "link-0"
          ]
        },
        {
          "_type": "span",
          "text": ", an up and coming retail store that showcases high-tech and high-end consumer products, many of which are made by small companies that normally wouldn’t have access to physical retail.",
          "marks": []
        }
      ],
      "markDefs": [
        {
          "_key": "link-0",
          "_type": "link",
          "href": "https://b8ta.com"
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "From",
          "marks": []
        },
        {
          "_type": "span",
          "text": "AR glasses",
          "marks": [
            "link-0"
          ]
        },
        {
          "_type": "span",
          "text": "to",
          "marks": []
        },
        {
          "_type": "span",
          "text": "AI-enhanced skateboards",
          "marks": [
            "link-1"
          ]
        },
        {
          "_type": "span",
          "text": ", to",
          "marks": []
        },
        {
          "_type": "span",
          "text": "sleep-aid BMIs",
          "marks": [
            "link-2"
          ]
        },
        {
          "_type": "span",
          "text": ", B8ta is audacious enough to call out the technophiles and essentially fire everyone else. With most of it’s inventory being highly specialized and often crowdfunded tech, B8ta is made by and for the early adopter, the person obsessed with tech novelty. Indeed, the only way they’re profitable is by appealing to the few people who are willing and eager to pay up thousands if not hundreds of dollars to have the latest toy before everyone else.",
          "marks": []
        }
      ],
      "markDefs": [
        {
          "_key": "link-0",
          "_type": "link",
          "href": "https://b8ta.com/b/x1-smart-glasses"
        },
        {
          "_key": "link-1",
          "_type": "link",
          "href": "https://b8ta.com/b/onewheel-plus-xr"
        },
        {
          "_key": "link-2",
          "_type": "link",
          "href": "https://b8ta.com/b/dreem"
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "My point? It wouldn’t have taken Brookstone that much more money to stock and sell those kinds of products. To partner with crowdfunded tech companies and reorient it’s business model to sell ever more niche (and therefore lucrative) consumer products to people willing to pay for them. To design a store (and build a brand) labourously curated for the early adopter, and in so doing, engender a customer base of obsessive fans dedicated to the discovery of the latest and greatest in tech.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "If they only had the guts.",
          "marks": []
        }
      ]
    }
  ]
}