{
  "title": "148861965.im Not Good Enough Vs I Am Capable",
  "slug": "148861965im-not-good-enough-vs-i-am-capable",
  "publishedAt": "2025-11-30T19:29:40.745Z",
  "excerpt": "I just finished reading Martin E. P. Seligman’s brilliant book, “Learned Optimism” last week.",
  "image": "",
  "readTime": "3 min",
  "content": [
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "I just finished reading Martin E. P. Seligman’s brilliant book, “Learned Optimism” last week.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "It’s a great book and I highly recommend it.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Alas, the biggest takeaway I got from reading it wasn’t about how to be optimistic in times of adversity (although it’s worth reading the book to find out), it’s that there is almost always an inverse way of viewing our world and our lives; that is to say, why we fail, why we succeed, why the world is the way it is, and most important, what we are truly capable of.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "For almost every thing that you think you cannot do, because you’re not good enough, or not brilliant enough, not good looking or confident or brave enough, there’s always another potential reason that you are, in fact, capable.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Far too often we tell ourselves we can’t do something we’ve never done before because we fear the thought of doing it and failing (",
          "marks": []
        },
        {
          "_type": "span",
          "text": "fearing the fear",
          "marks": [
            "link-0"
          ]
        },
        {
          "_type": "span",
          "text": "so to speak), when the only reason we feel the way we do is because we’re approaching it from the perspective of “I can’t do this because of X.” And X, as you might have guessed, is always some variation of “Im not good enough.”",
          "marks": []
        }
      ],
      "markDefs": [
        {
          "_key": "link-0",
          "_type": "link",
          "href": "http://sethgodin.typepad.com/seths_blog/2013/11/fear-the-fear-feel-the-fear.html"
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "The thing is, you wouldn’t fear the fear of failure if you believed you could do it and succeed. If you can ride a bike, you don’t fear the thought of doing it. That’s confidence, you know from past experience you’re capable of riding a bike. What I’m talking about is doing something you’ve never done before and approaching it from the perspective of “I can do this.”",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "I think the fear of failure in doing something we’ve never done is universal. We all fear failure, and because there’s this sense of uncertainty, this tension in doing something we don’t know we can do, this fear is amplified, and so then we hide, we naturally tell ourselves (most of us) we can’t do this because of some self-limiting, misguided although logically-appealing reason.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "But confidence is just a logically solid argument. You don’t need to feel confidence to be confident. You don’t need to know 100% you’re going to succeed to believe you can do this. Not everything has to be okay. You can approach this (any problem, setback or obstacle) from the point of view of “I can do this, I can handle this, I can perform this with every bit of gravitas as anything else you do confidently,” and you can.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Certainly, you might fail. But believing you can succeed, going in the posture of “I’m awesome, I’m confident in myself and my abilities, and even if I try and fail I can handle this,” is a completely different approach than rehearsing failure in advance. And in the long run, I think, it might even guarentee your success.",
          "marks": []
        }
      ]
    }
  ]
}