{
  "title": "148862340.charlie Has A Better Pair Of Glasses",
  "slug": "148862340charlie-has-a-better-pair-of-glasses",
  "publishedAt": "2025-11-30T19:29:45.003Z",
  "excerpt": "There’s a myth that Charlie Munger, the famed partner of Warren Buffet, has a systematic method of looking at a business from the ground up. That somehow, between looking at the finance reports and me",
  "image": "",
  "readTime": "2 min",
  "content": [
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "There’s a myth that Charlie Munger, the famed partner of Warren Buffet, has a systematic method of looking at a business from the ground up. That somehow, between looking at the finance reports and meeting the CEO for lunch, he can tell if a company is worth investing his money in.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Judging Berkshire Hathway’s success, you’d think Charlie is superhuman.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "He’s not.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "That’s because what often goes unnoticed is the fact that Charlie Munger has read far more books (and is thus far more objective) than most people. Not merely money books, but media from a vast variety of fields. And so Charlie has an incredible",
          "marks": []
        },
        {
          "_type": "span",
          "text": "multi-disciplinary",
          "marks": [
            "link-0"
          ]
        },
        {
          "_type": "span",
          "text": "point of view. He has such an extensive breath of knowledge, that when",
          "marks": []
        },
        {
          "_type": "span",
          "text": "he",
          "marks": []
        },
        {
          "_type": "span",
          "text": "looks at a business, he sees it very differently than even the most capable investor.",
          "marks": []
        }
      ],
      "markDefs": [
        {
          "_key": "link-0",
          "_type": "link",
          "href": "https://www.safalniveshak.com/crash-course-in-building-latticework-of-mental-models/"
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Certainly he’s an expert of economic analysis, but so is everyone else on Wall Street. The difference is that when he’s sizing up a business, scrutinizing the very same data that every other person can see, he’s looking at it from a much wider frame of view.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "It’s not a gift that allows him outsmart the market, it’s simply his ability to see all the angles accurately, dispassionately, and predictably.",
          "marks": []
        }
      ]
    }
  ]
}