{
  "title": "148861899.on Overcoming Our Fear Of Free Range Parenting",
  "slug": "148861899on-overcoming-our-fear-of-free-range-parenting",
  "publishedAt": "2025-11-30T19:29:39.557Z",
  "excerpt": "Back when I was at my tea store job (a few months ago now) there was one experience I had where a teenager and his somewhat indisposed mother came in to the store looking for a gift for the young man’",
  "image": "",
  "readTime": "5 min",
  "content": [
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Back when I was at my tea store job (a few months ago now) there was one experience I had where a teenager and his somewhat indisposed mother came in to the store looking for a gift for the young man’s girlfriend’s birthday. He then promptly decided to go with a $75 Teavana starter gift set. It’s got tea and a tea maker and nice packaging. A good gift, in my opinion. He thought so too. His mother, on the other hand, apparently did not, because soon she was questioning his decision making with “well, are you sure she’ll like that? I just think she’d like something else.” It became very apparent that she was very reluctant about her son purchasing this gift.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Now, I’m not a professional people reader by any means, but I’m assuming she was disinclined about the purchase for one of two reasons. Either she didn’t want her son paying his entire paycheck on this girl that she thinks is only a temporary fling, or, maybe she really likes this girl and she simply doesn’t want her son to make the mistake of getting her something she doesn’t like, given other alternatives. Either way, she simply doesn't want her son to fail.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Or consider the parents who literally open and close the sale of girl scout cookies. Same thing happens. You go to the mall or grocery store and there’s all these little girls with signs and they introduce themselves and then mom or dad do all the selling. They don’t want little miss sunshine to fail and or stumble and so they do everything for them, even though the entire point of the exercise is to teach their kids how to sell and engage in a transaction with a stranger.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "And so in these instances (and there are many more like them) parents would rather let their kids \"succeed\" by not failing and therefore not learning, rather than let their kids succeed by doing and then learning from their mistakes on their own. If you don't start, you can' t possibly fail, after all. And so in effort to protect their kids from a bad experience, they withhold the gift of learning.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "This is an issue that most parents, as far as I can tell, see in a very dualistic manner. They’re either not protective enough, or their over-protective. And if you have parents like mine, it’s better to be overprotective than to not be protective enough. What I’m sure is a lot easier said than done, but infinitely more rewarding, however, is a third approach. One where you’re protective in the sense that you don’t want your kid in harm’s way, you obviously don’t want him hanging out with his friends in a shady part of town. But, at the same, you’re aware that most things aren’t going to physically harm your kid, and mindful of the overused, yet still true idiom, what doesn’t kill you makes you stronger.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "You can, for example, drop your 15 year son off at a local national airport with a debit card, hand him a smartphone and instruct to take a flight to LAX and then find his way back. You could also teach your teenage daughter how to sell by having her call 100 strangers on her smartphone and sell them a copy of a magazine you like. Or you might even simply teach your 12 year old things that we normally wouldn’t expect a 12 year old to have any interest in, like coding or machine learning or world policy or simply skills like public speaking or opining his ideas online.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Point is, none of these things are going to physically harm your kid. If you trust that he’s smart and capable, he can overcome these obstacles on his own. Your job as a parent is to be brave enough to allow him the opportunity to do that. Truth be told, the only way your kid is ever going to become a confident young adult is if you treat him like one. And the only way you’re ever going to be able to do that over the long term is to cultivate the courage necessary to let him explore the world on his own, to fail early and often, and to learn from his mistakes. That’s how you raise resilient kids who are willing to take risks, willing to fail, and willing to work hard until they succeed.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "The parents that try to get all their kids ducks in a row don't get the point of parenting. It's not about making the perfect life for their kids, it's about teaching them how to navigate the world on their own, and allowing them to create a life they’re proud of, not hiding from.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "More on this",
          "marks": []
        },
        {
          "_type": "span",
          "text": "here",
          "marks": [
            "link-0"
          ]
        },
        {
          "_type": "span",
          "text": "and",
          "marks": []
        },
        {
          "_type": "span",
          "text": "here",
          "marks": [
            "link-1"
          ]
        },
        {
          "_type": "span",
          "text": ".",
          "marks": []
        }
      ],
      "markDefs": [
        {
          "_key": "link-0",
          "_type": "link",
          "href": "http://www.amazon.com/Free-Range-Raise-Self-Reliant-Children-Without/dp/0470574755/ref=sr_1_1?ie=UTF8&tag=derivstratmag-20&qid=1342367313"
        },
        {
          "_key": "link-1",
          "_type": "link",
          "href": "http://www.freerangekids.com/faq/"
        }
      ]
    }
  ]
}