{
  "title": "148863708.eggs And Avocados",
  "slug": "148863708eggs-and-avocados",
  "publishedAt": "2025-11-30T19:30:07.313Z",
  "excerpt": "Everyone who reads this post has likely heard that ‘breakfast is the most important meal of the day.’ And, unless they’re a member of an indigenous hunter-gather tribe, have likely eaten cereal for br",
  "image": "",
  "readTime": "2 min",
  "content": [
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Everyone who reads this post has likely heard that ‘breakfast is the most important meal of the day.’ And, unless they’re a member of an indigenous hunter-gather tribe, have likely eaten cereal for breakfast more than once.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "The frequency and proximity of these two incidents have led many people to adopt the simple notion that cereal is indeed the most essential (and healthiest) thing they will eat today.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Which is ridiculous, for a few reasons:",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "listItem": "bullet",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "We know that mass-produced breakfast cereals (and pancakes, and waffles, and donuts) have only been around until very recently. So, what on Earth did we eat before then?",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "listItem": "bullet",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "The carbs in nearly all breakfast cereals convert to glucose which spikes insulin. (Not good whether you're diabetic or not.) Cheerios, for example, a comparitively ‘healthy’ cereal has a whopping 20 grams of carbs per cup—more than most people should consume in a day. Frosted Flakes has 37.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "listItem": "bullet",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Fun fact: John Harvey Kellogg, the inventor of corn-flakes and a strong-supporter of eugenics (if that’s at all an indicator of his lack of intellect) originally intended his breakfast concoction to be a potent anaphrodisiac (believing that it would make sexual absinence easier.)",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "It turns out that a morning of nothing but eggs and an avocado (or a hemp almond-milk smoothie, if you're into that) is likely a far better thing to eat every morning than a bowl of cereal, or anything like it.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Of course, few people know it. And even fewer will likely eat anything but cereal for the rest of their years.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Why?",
          "marks": []
        },
        {
          "_type": "span",
          "text": "Mass marketing, culture, habit, force of will. Whatever the case, cereal is bad for you. It's up to you to acknowledge it and concede it.",
          "marks": []
        }
      ]
    }
  ]
}