{
  "title": "148864438.quarter Baked Kernels",
  "slug": "148864438quarter-baked-kernels",
  "publishedAt": "2025-11-30T19:30:15.968Z",
  "excerpt": "For the past 6 months, I’ve been using audiopen.ai to create AI-assisted summaries of things that I’ve said.",
  "image": "",
  "readTime": "2 min",
  "content": [
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "For the past 6 months, I’ve been using audiopen.ai to create AI-assisted summaries of things that I’ve said.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "It’s a phenomenal tool for quickly capturing ideas (such as those for blog posts) and because I only have to speak—not type—it’s a great way to cut down on time.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "But it occurred to me recently how it’s not only helping me capture ideas—but develop them—as I speak aloud.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Too often, writers will start with a quarter-baked kernel of an idea that’s not fully developed and easy to discard. When that happens, it’s tempting to stop ourselves from exploring our own thoughts, for the simple reason that it’s hard to put words to paper and find the words to fully flesh it out.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "With tools like Audiopen, you can talk freely without worrying too much about how it sounds because the tool makes sense of it later. You don’t need to focus on both input (your thoughts) and output (writing it down) all at once.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "The result is an method that’s been a game-changer in my my own writing process. Freeing me to explore and further my ideas as I spill them out.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Generative AI has a long way to go before it can come up with insights like this one, but applications like this that empower us to flesh out our own ideas can give us an unprecedented ability to think and write and communicate.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "And, in the case of writing what we notice, suspect, believe, or feel, they can certainly help to realize the nugget of insight that’s worth sharing.",
          "marks": []
        }
      ]
    }
  ]
}