{
  "title": "148863110.thoughts On Charity",
  "slug": "148863110thoughts-on-charity",
  "publishedAt": "2025-11-30T19:29:56.408Z",
  "excerpt": "A lot of people don't know where their money goes when they give to charity. And, unless the one's they give to support a transparent model, it can be hard to tell if their money even goes toward the ",
  "image": "",
  "readTime": "3 min",
  "content": [
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "A lot of people don't know where their money goes when they give to charity. And, unless the one's they give to support a transparent model, it can be hard to tell if their money even goes toward the cause they think they're supporting.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Of course, charity—giving something away to support someone or something—can take many forms outside of the traditional “giving to charity” model.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Consider: is giving money to the new church in your town charity? Even if all of it goes to supporting an extra 10-square feet of space they likely won’t need.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Or consider tipping. If paying more than you can get away with somehow helps the struggling waitress pay her bills (or buy her kid a birthday cake), is that not giving to charity?",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "I find it interesting how some people are eager to give in some ways yet are reluctant to in others. And more so, how some people seem to think that because charity scams exist at all, giving away their money in any form just isn’t worth the risk.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Of course, giving away your money isn’t all about making someone’s life better. It’s also about you; a way of making",
          "marks": []
        },
        {
          "_type": "span",
          "text": "you",
          "marks": []
        },
        {
          "_type": "span",
          "text": "feel better for having had gived.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "That’s why many charities encourage you to donate publicly, and why Charity: Water’s birthday campaign lets you share your pledge online. Participating anonymously is only half as fun as showing and telling your friends to donate with you.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Charity, then, is reciprocal. You give something away in exchange for some element of status, whether it’s “I’m a good person” or “look at me,” or “I’m an insider,” or “I’m a success.” It’s just as much about the narrative you get to tell yourself as it is about the opportunity to help someone out.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "The key takeaway here—for me anyway—isn’t that people expect to get some intangible thing from giving away their money. It’s that because the act of giving makes them feel better about themselves (regardless of how or where their money goes) giving to charity in any way in whatever form,",
          "marks": []
        },
        {
          "_type": "span",
          "text": "is",
          "marks": []
        },
        {
          "_type": "span",
          "text": "a reward in itself.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "As long as it’s a story that you get tell yourself—a story about who you are and what you value—continuing to participate in the act of charity is worth it. Because it doesn’t really matter where you money goes. What matters is the story you get to tell yourself about why you donated it in the first place.",
          "marks": []
        }
      ]
    }
  ]
}