{
  "title": "148861844.the Outliers Among Us Reveal Some Of Our Most Innate Fears And Desires",
  "slug": "148861844the-outliers-among-us-reveal-some-of-our-most-innate-fears-and-desires",
  "publishedAt": "2025-11-30T19:29:38.955Z",
  "excerpt": "It’s so tempting to think the folks who’s behavior is (to us) very much out of line with our values as being somehow different people altogether. Somehow lesser than us, and somehow worthy of the crit",
  "image": "",
  "readTime": "4 min",
  "content": [
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "It’s so tempting to think the folks who’s behavior is (to us) very much out of line with our values as being somehow different people altogether. Somehow lesser than us, and somehow worthy of the criticism and gossip and shame that we would never tolerate if it was directed on someone we care about. That is to say, many people believe that the appropriate response to bigotry is cruelty. Whether in response to the person who gets upset and lashes out waiting on their order at Starbucks or the person saying those offensive things on public media, or the people who make racist remarks under their breath, it seems as though there is a mass of people out there who feel that their best (if only) response is a self-righteous, shame-fueled verbal assault.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Certainly, we have a right to be upset. These people are clearly acting out of line, they’ve probably said something or done something that is very much disrespectful, and it can be very hard to your bite your lip (or not stab them with a fork). That being said, maturity can be viewed as the process of exchanging our ego-based child stories for interdependent adult-minded narratives. So, as in the case of the angry customer who freaks out because you didn’t put enough whip on her frappuccino, you consider: What if? She’s simply having a bad day. What if? She has a story going on her head that the world is against her in some way (competition, scarcity of resources, etc). What if? She’s single and lonely and she has family problems (loneliness, fear of abandonment, resenting other people for being happy). What if? She feels like she paid $5.00 for a drink and she isn’t getting her money’s worth (nobody likes to feel like they’re being cheated on, no matter how much whip you think is the appropriate amount).",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "My point is, these folks, the outliers, the one’s who criticize you and use shame as a tactic. The one’s who seem to have no time or patience to do anything as simple as wait a few minutes in line, or the one’s who yell and scream and act like children when you fail to meet their expectations. Certainly these people’s behavior is outlandish and not to be tolerated. But their own reasoning for it is not. Bigotry of all kinds comes out of the same child-based fears we all share. Fear of loneliness, abandonment, and competition for happiness and security and resources. Fear of uncertainty, of what we don’t know, whether it be a religious practice or culture or race or gender or way of thinking. Fear of being a fraud, or fear of being lied to, or fear of simply not getting what we think we deserve.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "It can be difficult, but choosing to see these fear-based, scarcity-minded actions and reactions as what they are and responding in a manner that is compassion-based and non-personal can be incredibly rewarding for ourselves and our communities. It might even give our would-be antagonist a chance to responsibly change his internal narrative, and appropriately change his behavior.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Wouldn’t it be better to live in a world with less hate, less shame, and more love? Where the immature child-based reactions of others are met with responsible compassion and understanding and curiosity. An attitude and a posture that gives people space to breath, to see the world as it is, and possibly exchange their narrative for a new one?",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "We’re never going to change (the others) if all we do is simply react by recycling their hate and refueling their stories. But if we change our minds and our postures and our response, we’ll give them the opportunity to change theirs.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "blockquote",
      "children": [
        {
          "_type": "span",
          "text": "Darkness cannot drive out darkness; only light can do that. Hate cannot drive out hate; only love can do that. Hate multiplies hate, violence multiplies violence, and toughness multiplies toughness in a descending spiral of destruction ... The chain reaction of evil - hate begetting hate, wars producing more wars - must be broken, or we shall be plunged into the dark abyss of annihilation.    (Martin Luther King Jr., 1963)",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "More on this",
          "marks": []
        },
        {
          "_type": "span",
          "text": "here",
          "marks": [
            "link-0"
          ]
        },
        {
          "_type": "span",
          "text": ".",
          "marks": []
        }
      ],
      "markDefs": [
        {
          "_key": "link-0",
          "_type": "link",
          "href": "http://changethis.com/manifesto/143.01.PathwaysPossibility/pdf/143.01.PathwaysPossibility.pdf"
        }
      ]
    }
  ]
}