{
  "title": "148862356.intrinsic Investing Is Easier In The Long Run",
  "slug": "148862356intrinsic-investing-is-easier-in-the-long-run",
  "publishedAt": "2025-11-30T19:29:45.673Z",
  "excerpt": "Most people would probably agree that it’s unwise to base the success of a relationship on external circumstances—money in your bank account, kilos on the scale, what car you drive.",
  "image": "",
  "readTime": "3 min",
  "content": [
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Most people would probably agree that it’s unwise to base the success of a relationship on external circumstances—money in your bank account, kilos on the scale, what car you drive.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "And yet, when it comes to their health, wealth and overall happiness, it’s all to easy to rely on external metrics to determine if today is a good day, and thus a day worth continuing to invest in your future.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "For example, you’ve spent the last month budgeting your expenses and saving in excess. Then one day, some unforeseen event damages your car (broken window, nail in a tire, fender bender) and you spend all last months accrued savings on repairs. Many people, myself included, would be tempted to throw it up in the air and give up their goal of saving 20% of their income. They might even make a rash dash for their local supermarket (or e-commerce store), spending in earnest, just to “feel better” about their experience.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Of course, that just leaves you with a depleted bank account, no savings, and the pang of disillusionment about the possibility trying to save up again.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "A better choice might be to realize that the purpose of the saving is for jams like these, to consider what an alternative future might look like if you hadn’t saved all that money, and to embrace the idea that saving works precisely because it’s a recurring investment. That if you’ve convinced yourself that the success of your “saving” ought to be based on some external metric (digital digits on a screen), you’ve merely seduced yourself into believing that the purpose of all this is to see how much you can accumulate.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "It’s not.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "You save your money",
          "marks": []
        },
        {
          "_type": "span",
          "text": "because",
          "marks": []
        },
        {
          "_type": "span",
          "text": "days like this are going to happen. So instead of sacrificing your progress because you thought you could avoid life’s inevitable pitfalls and spend your excess on your car loan or a more diverse portfolio, consider: The purpose of saving isn’t to make more money.",
          "marks": []
        },
        {
          "_type": "span",
          "text": "That’s why you go to work",
          "marks": []
        },
        {
          "_type": "span",
          "text": ". The purpose of saving is to invest in a future that allows you to bypass an alternative one where you can’t afford the things you need to get on with life when you’re in a pinch.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "The same can be said for a whole host of things: from exercising to meditation to writing a blog to spending time with family or friends. These are investments that (I hope) you make not for status or money or reciprocity or better circumstances. They’re merely smart things that you do on a recurring basis that add up. They safeguard against negative emotions or experiences, and they save you time, money and attention in the long run.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "You shouldn’t workout 3 days a week and eat real food merely to hit a number on a scale. And you shouldn’t save up your money for the sake of holding onto it (or trying to make more of it). Probably not a good idea to spend time talking to your significant other only when she or he likes you either.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "This is not to say that your intrinsic motivations shouldn’t be tied to extrinsic incentives, or that external motives are unimportant. What I mean is that, generally speaking, investing, whether it be in a healthy relationship, bank account, or body, is a whole lot easier when you rely on more than external factors to justify and encourage the behavior that makes them possible.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "As long as you’re merely telling yourself a story, you might as well tell yourself a story that helps.",
          "marks": []
        }
      ]
    }
  ]
}