{
  "title": "148861982.one Way To A Better Way",
  "slug": "148861982one-way-to-a-better-way",
  "publishedAt": "2025-11-30T19:29:41.289Z",
  "excerpt": "In almost any given scenario, whether it be making an ad or throwing free throws or starting a new fast-food chain, there will always be people who have gone along that route before you.",
  "image": "",
  "readTime": "2 min",
  "content": [
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "In almost any given scenario, whether it be making an ad or throwing free throws or starting a new fast-food chain, there will always be people who have gone along that route before you.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "People who have experienced maybe the same problems you’re struggling with now. Who, through trial and error, have already figured out a better way.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "A more efficient system. Less prone to error. Easier.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "It can be tempting for the aspiring change maker, entrepreneur or up and coming whoever, to try to reinvent everything.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "But, if you think about it, that’s not how real innovation works. Steve Jobs didn’t reinvent the phone, he just added a touchscreen and internet and user-friendly software. And Elon isn’t reinventing the car, let alone a electric powered one. He’s just making an EV cool enough people want to buy, and making it affordable too.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "You don’t reinvent the wheel, metaphorically. You just figure how to make it faster, safer, cheaper, more reliable, better designed, etc.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Thus, when making anything, from widgets to organizations, it’s always best to start by examining the competition. To acknowledge what works: the systems, the strategies, the techniques.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "See the rules. Abandon one. Keep the rest.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "It’s easier to stumble upon a significant breakthrough when you give up trying to change everything, and instead focus on making one facet, remarkably better.",
          "marks": []
        }
      ]
    }
  ]
}