{
  "title": "148861962.shakshuka And The Practice Of Open Mindedness",
  "slug": "148861962shakshuka-and-the-practice-of-open-mindedness",
  "publishedAt": "2025-11-30T19:29:40.691Z",
  "excerpt": "Yesterday, I made shakshuka. Shakshuka is an Algerian dish of poached eggs in a sauce with tomatoes, chili peppers, tomatoes, and often spiced with cumin and paprika.",
  "image": "",
  "readTime": "2 min",
  "content": [
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Yesterday, I made shakshuka. Shakshuka is an Algerian dish of poached eggs in a sauce with tomatoes, chili peppers, tomatoes, and often spiced with cumin and paprika.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "It was delicious.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Thing is, most people wouldn’t even consider attempting to make a dish like this at home (I’m thinking like 80% of the American population). It’s not that it’s a difficult dish to make (it’s not), I think it has something to do with it simply being foreign, different, and not the usual fare.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "It’s so easy for someone to say, “let’s make burger’s and hot dogs tonight,” or “let’s order pizza.” And yet, the internet makes everything from Osso Bucco to Acai bowls to gluten-free banana coconut pancakes available to anyone. It’s so easily to explore the wide-ranging expanse of dishes from every continent and culture on earth. And yet, the majority of American’s go out for Pad Thai when they can easily learn how to make it at home.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "I think this narrowness of mind is something we should be ever-conscious of. Because it’s not really about food, it’s about who we are and the story we tell ourselves. It’s hard to imagine different worlds, or beliefs or world-views if you’re stuck living life the way you always have; eating the same foods, doing the same things, traveling to the same places. If the status quo of what you eat, or what you believe is what you consider normal, then it’s not such a stretch to make the case that everyone else, and the culture they bring with them, is a threat.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Maybe I’m taking this out of proportion. I don’t mean to say that every war in the past 2000 years was because one culture didn’t eat the same foods as another. But I think, because food is so interwoven into culture, it’s a very good practice in open-mindedness. If we can all eat each other’s foods with the same care and dignity as our own, we can learn to respect each other. And if we can be proactive about experiencing and preparing foreign dishes at home (as opposed to avoiding them because they are different), it might make it easier to accept that our world and our beliefs are just one potential outcome of infinite well of realities.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Just something to consider.",
          "marks": []
        }
      ]
    }
  ]
}