{
  "title": "148863995.networking Lessons And Tips",
  "slug": "148863995networking-lessons-and-tips",
  "publishedAt": "2025-11-30T19:30:11.139Z",
  "excerpt": "I’ve recently been networking a lot more. (Informally) meeting interesting people and talking about their roles and experiences.",
  "image": "",
  "readTime": "2 min",
  "content": [
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "I’ve recently been networking a lot more. (Informally) meeting interesting people and talking about their roles and experiences.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "A few things I’ve learned so far:",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Interviews (informal or otherwise) are a great way to both communicate domain knowledge",
          "marks": []
        },
        {
          "_type": "span",
          "text": "of",
          "marks": []
        },
        {
          "_type": "span",
          "text": ", and your passion",
          "marks": []
        },
        {
          "_type": "span",
          "text": "for",
          "marks": []
        },
        {
          "_type": "span",
          "text": "a role—far more than a one-page resume will ever do.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Often, that’s all it takes. One well-crafted sentence delivered at the right time, spoken to the right person, can land you a job.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Networking compounds. Meeting with one person can create an opportunity to meet even more people, and by extension, more opportunities.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Recording the audio (and playing it back after) can help you avoid the temptation to type while they’re talking, which can free you up to actually listen to what’s being said.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Similarly, listening intently (and asking questions as they come to you) is a far better strategy than reading from a list of questions you’ve prepared in advance. In fact, if you listen, you’ll be better prepared to ask an even better question (one that might get all or most of those questions answered, at the same time.)",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Talking to someone over Zoom is difficult and fairly recent. The least you could do is pay attention, smile, and make eye contact.",
          "marks": []
        },
        {
          "_type": "span",
          "text": "How so?",
          "marks": []
        },
        {
          "_type": "span",
          "text": "Again, listen, don’t type. Look at the camera, not the screen. Hide your self-view. And smile—more than it feels natural or comfortable (it helps).",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Meet first, then connect. Even though there’s absolutely no cost in connecting with a stranger on LinkedIn, many people are weary to connect with anyone they don’t know. Even if ‘knowing them’ constitutes talking with them for only a few minutes. That said, while messaging people",
          "marks": []
        },
        {
          "_type": "span",
          "text": "after",
          "marks": []
        },
        {
          "_type": "span",
          "text": "you’ve connected with them seems like a harmless bet, it’s better to message and meet them",
          "marks": []
        },
        {
          "_type": "span",
          "text": "before",
          "marks": []
        },
        {
          "_type": "span",
          "text": "you connect. A ten-minute interaction is all it takes for many people to see you as a friend and not a stranger, which is often all it takes to get them to respond to your message.",
          "marks": []
        }
      ]
    }
  ]
}