{
  "title": "148862748.if Your Client Makes A Mistake Should You Fix It",
  "slug": "148862748if-your-client-makes-a-mistake-should-you-fix-it",
  "publishedAt": "2025-11-30T19:29:49.519Z",
  "excerpt": "Say your client makes several grammatical mistakes in their web copy, should you bring it to their attention?",
  "image": "",
  "readTime": "2 min",
  "content": [
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Say your client makes several grammatical mistakes in their web copy, should you bring it to their attention?",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "What about a line-edit? What if you can clearly see (and argue) how their copy could be better?",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "This comes up quite a lot when working with clients, and it goes far beyond mending prose on a page, but applies to nearly any service: UX, UI, visual design, audio or video editing, even PR work.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "The thing is, the answer has more to do with you and your business than what your client wants.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "If you're in the “you get what you pay for” industry, then of course, the customer is always right (even when their not). Which means it’s in your best interest",
          "marks": []
        },
        {
          "_type": "span",
          "text": "not",
          "marks": []
        },
        {
          "_type": "span",
          "text": "to bring their mistakes to their attention.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "On the other hand, if you believe in the idea that your business (or lack of it) is based on your clients, and that who you get to work with over time is actually based on the quality of your output, then you should work overtime to ensure that your clients get your best work possible.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Sure, that might mean a little ruffled feathers here or there, but it’s worth it in the long run. Because it’s the only way to ensure that you’ll get the opportunity to build a reputation that speaks for itself. And",
          "marks": []
        },
        {
          "_type": "span",
          "text": "that’s",
          "marks": []
        },
        {
          "_type": "span",
          "text": "what will enable you to pick your clients in the future.",
          "marks": []
        }
      ]
    }
  ]
}