{
  "title": "148862880.deliberately Brainwashed",
  "slug": "148862880deliberately-brainwashed",
  "publishedAt": "2025-11-30T19:29:51.599Z",
  "excerpt": "There are an abundance of great books available that can infuse you with motivation, change your posture, or challenge you to level up.",
  "image": "",
  "readTime": "2 min",
  "content": [
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "There are an abundance of great books available that can infuse you with motivation, change your posture, or challenge you to level up.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Thing is, the reason you find these ideas so insightful is because they are not habitually accessible in your own life. Clearly you would have picked them up by now, given your upbringing, culture and daily interactions with people.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Point is, you haven’t developed the habit to think that way—to readily and automatically see the world (and your problems) from that point of view.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "And just as with any habit, habituation (or lack of it) applies. Which means that if you’re not regularly rehearsing these concepts, it’s going to be as good as if you never discovered them.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "The alternative (and the cure) to any life-changing program is inculcation: supplanting old habits with new ones by repetition and regular practice.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Hence the obvious solution: if you want to change your default frame of mind, reading a self-help book once won’t help much. Reading it on repeat, however—implanting those ideas via frequent repetition—helps tremendously.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "It might seem odd at first to intentionally brainwash yourself. But if you think about how you’ve adopted your original dispositions, it’s not strange at all. The truth is, we’re all brainwashed.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "The secret to self-growth is realizing that you get to choose what you indoctrinate, how you see (and experience) your world and how you respond to it.",
          "marks": []
        }
      ]
    }
  ]
}