{
  "title": "148862120.wheres Your Florilegium On Starting A Commonplace Book",
  "slug": "148862120wheres-your-florilegium-on-starting-a-commonplace-book",
  "publishedAt": "2025-11-30T19:29:43.343Z",
  "excerpt": "It occurred to me the other day of the immense practicality of a Commonplace Book .",
  "image": "",
  "readTime": "4 min",
  "content": [
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "It occurred to me the other day of the immense practicality of a",
          "marks": []
        },
        {
          "_type": "span",
          "text": "Commonplace Book",
          "marks": [
            "link-0"
          ]
        },
        {
          "_type": "span",
          "text": ".",
          "marks": []
        }
      ],
      "markDefs": [
        {
          "_key": "link-0",
          "_type": "link",
          "href": "https://en.wikipedia.org/wiki/Commonplace_book"
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "In college, I had one in the form of a DayOne Journal, where I basically would copy down anything I read or heard that interested me, or that I might use for reference later, and then categorize it based on tags.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "In recent years however, I began thinking that writing about the ideas I came upon could replace my habit of writing down and taking notes while reading or listening. But something I didn’t realize then is that I consume far too much information for me to remember to write about and/or reflect on all of it. If I don’t immediately take note of the insight immediately in front of me, while I’m consuming it, I’m 95% likely to forget about it and simply move on to the next book or podcast or article.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "\n",
          "marks": []
        },
        {
          "_type": "span",
          "text": "I now know that a huge part of the reading/learning/writing process is simply consuming other information in whatever form it takes, jotting it down, taking notes, making connections and then reflecting on it. And, if you’re a writer, then combining those ideas with new insights into coherent posts (or paragraphs). A commonplace book is simply the best tool I know how to do all of this. In short, it’s research on whatever it is that you think is worthy of attention or referral. Ideas that can supplement your own personal growth, as well as your writing.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Certainly, this requires a new approach to consuming media. I’ll now have to begin to embrace the act of marking up books as I read them: writing in the margins, highlighting quotes, underlining, circling words I don’t know, etc. As well as writing down and linking to whatever it is I listen to audibly or watch on a screen. I’ll also have to then copy these notes to a archive of sorts, where they can be categorized, by writing down the appropriate source or link and tag. Alas, all of this takes effort, and so the rate at which I will be able to consumer more information will decline. But it’s completely worth it in the long run.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "In",
          "marks": []
        },
        {
          "_type": "span",
          "text": "Paul Jun’s",
          "marks": [
            "link-0"
          ]
        },
        {
          "_type": "span",
          "text": "take on the topic, he says:",
          "marks": []
        }
      ],
      "markDefs": [
        {
          "_key": "link-0",
          "_type": "link",
          "href": "http://motivatedmastery.com/keep-commonplace-book-evernote/"
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "“It’s invigorating to grow your commonplace book—it’s a tangible reflection of how you’re nurturing your mind, the subjects you’re passionate about, and also the subjects that you’re ignoring entirely. Knowledge is the accumulation of information; wisdom is knowing how to apply it. A commonplace book champions both.”",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Furthermore, upon reading that Tim Urban, writer of one of my most favorite blogs, Wait But Why, only reads 5 books a year (with no shortage of incredibly",
          "marks": []
        },
        {
          "_type": "span",
          "text": "provocative ideas",
          "marks": [
            "link-0"
          ]
        },
        {
          "_type": "span",
          "text": "), I’ve come to realize maybe consuming as many books in my lifetime isn’t the goal. Maybe I should reconsider my priorities. Focusing on the quality of the limited amount of books I read annually over the quantity of the books read.",
          "marks": []
        }
      ],
      "markDefs": [
        {
          "_key": "link-0",
          "_type": "link",
          "href": "https://waitbutwhy.com/2015/12/the-tail-end.html"
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Then I can stop my incessant compulsion to buy more books I won’t read and instead take time to absorb, digest and write about the very best resources I come upon throughout my lifetime. And to make real progress in my life by reflecting on, internalizing, and, most importantly, actualizing their contents.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "The Stoic philosopher Epictetus said it best:",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "“Don’t just say you have read books. Show that through them you have learned to think better, to be a more discriminating and reflective person. Books are the training weights of the mind. They are helpful, but it would be a bad mistake to suppose that one has made progress simply by having internalized their contents.”",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "If you’re ready to get started, both",
          "marks": []
        },
        {
          "_type": "span",
          "text": "Ryan Holiday",
          "marks": [
            "link-0"
          ]
        },
        {
          "_type": "span",
          "text": "and",
          "marks": []
        },
        {
          "_type": "span",
          "text": "Paul Jun",
          "marks": [
            "link-1"
          ]
        },
        {
          "_type": "span",
          "text": "have excellent how-to posts on the topic. HT to both of them.",
          "marks": []
        }
      ],
      "markDefs": [
        {
          "_key": "link-0",
          "_type": "link",
          "href": "https://ryanholiday.net/how-and-why-to-keep-a-commonplace-book/"
        },
        {
          "_key": "link-1",
          "_type": "link",
          "href": "http://motivatedmastery.com/keep-commonplace-book-evernote/"
        }
      ]
    }
  ]
}