{
  "title": "148861839.on Preemptively Avoiding The Downward Spiral",
  "slug": "148861839on-preemptively-avoiding-the-downward-spiral",
  "publishedAt": "2025-11-30T19:29:38.851Z",
  "excerpt": "When you’re discouraged, it’s very tempting to want to numb yourself out. To want to not feel and not think about what’s making us upset about our lives. So we engage in all sorts of unproductive and ",
  "image": "",
  "readTime": "5 min",
  "content": [
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "When you’re discouraged, it’s very tempting to want to numb yourself out. To want to not feel and not think about what’s making us upset about our lives. So we engage in all sorts of unproductive and unhealthy behaviors, from binge-watching to binge-eating to smoking to drinking to ranting.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Of course, none of these things make our lives any better, and they often do nothing more than create destructive patterns in our lives that only serve to make our problems worse. And so we find ourselves not making progress in our lives, but rather repeating the same cycles of optimistically working towards our goals followed by discouragement followed by destructive habits that undermine our progress, over and over again.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "I think we can all agree eating cookies, chocolate and cake to feel better about ourselves is not a helpful habit when you’re trying to lose weight. But because you’re angry, you’re tired, you’re somewhat depressed, you give in to temptation. And because you’ve done it today, you do it again tomorrow, because “hey, why not?” And then someday next week you go back to eating healthy, only to give in again the following week because something happened at work and you find yourself in front of your pantry at 12:51 am. You tell yourself “I hate my life,” or “I hate my job” or “I just don’t care anymore,” and soon enough you’re back to eating Nutella with a spoon.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "It’s a mistake to think that discipline and positive thinking are going to help you make healthy decisions amidst the inexorable collision course that is your bad circumstances, your upset mood and your hangry appetite. These things are going to inevitably occur, they’re a part of life. I think a better path then might be to take steps to avoid these self-destructive tendencies altogether, before they tempt you to take steps to undermine your progress. Far better to anchor yourself in positive goal-oriented habits that help you bypass your impending debauchery than to rely on sheer willpower alone.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "First off, consider: What’s working? You can’t be bad at everything, not if you’ve already made progress. Your life may not be where you want it ideally, but you must have already taken steps to make it better. Just look at how far you’ve come! Have you lost five pounds? Landed a slightly better or better-paying job? Adopted a regular habit that makes your life better? Begun to see your potential in a different light? Taken a risk or done something new lately? Maybe it didn’t work out the way you had hoped, but hey, you took a risk. Obviously, you care. You wouldn’t be having this discussion if you didn’t. Do you really want to eat this candy bar?",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "The second thing I’d do is create routines that encourage you to avoid creating a “downward spiral” in the first place. Maybe it’s something as simple as going to bed at a predetermined time. If you’re tempted to hang out in your kitchen or in front of your tv after work, maybe it would be best to adopt a nightly reading habit right before bed. Make some tea, then go read until you fall asleep. That’ll get you in bed, away from your fridge, or away from the tv. And speaking of sleep, get some. I’ve found that generally when I make unhealthy decisions, it’s generally because I’m discouraged",
          "marks": []
        },
        {
          "_type": "span",
          "text": "while",
          "marks": []
        },
        {
          "_type": "span",
          "text": "being utterly exhausted. Sometimes, I’m simply too",
          "marks": []
        },
        {
          "_type": "span",
          "text": "tired",
          "marks": [
            "link-0"
          ]
        },
        {
          "_type": "span",
          "text": "to make a conscious healthy decision and I use my own bad mood as an excuse to eat something unhealthy (generally ice cream or chocolate bars). But if I simply went to bed instead of scavenging through the fridge, I’d wake up feeling refreshed and in a far better mood, without having undermined my progress the previous night.",
          "marks": []
        }
      ],
      "markDefs": [
        {
          "_key": "link-0",
          "_type": "link",
          "href": "http://tim.blog/2012/08/12/understanding-the-dangers-of-ego-depletion/"
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Same concept holds true for just about any self-destructive tendency you might have during the day. Feeling stressed at work? Go for a walk or a workout instead of reaching for your drug of choice (sugar counts too). Or maybe it’s a mindfulness based practice that you need to overcome some anxiety or disillusionment or angst. Maybe you simply need to sit down and write. Write about your life, about where you’re headed, what you’ve been up to, what your thinking, what you’re feeling, etc. Whatever the alternate habit you choose, it's important that you recognize you have a choice for how you respond to life. Certainly you’re going to have bad moods and bad days and life is going to be overwhelming. That’s okay. What’s not okay is reacting in a manner that is inconsistent with your goals and your values.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "The appropriate response isn’t to amplify failure or numb yourself to oblivion. The appropriate response is to create an up-cycle. To do things that reaffirm your optimism, hope, energy and good-mood. And to continue to continue doing the things that will make your life better.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "If you don’t want to repeat the cycle your stuck in, change it before you engage in it. Change it before it changes you.",
          "marks": []
        }
      ]
    }
  ]
}