{
  "title": "148863347.polling The Experts",
  "slug": "148863347polling-the-experts",
  "publishedAt": "2025-11-30T19:30:01.154Z",
  "excerpt": "Whether we’re buying a new coffee maker or picking stocks, it’s virtually impossible to research and evaluate all of our options when making decisions. Moreover, most trivial decisions are rarely wort",
  "image": "",
  "readTime": "3 min",
  "content": [
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Whether we’re buying a new coffee maker or picking stocks, it’s virtually impossible to research and evaluate",
          "marks": []
        },
        {
          "_type": "span",
          "text": "all",
          "marks": []
        },
        {
          "_type": "span",
          "text": "of our options when making decisions. Moreover, most trivial decisions are rarely worth the deliberation, time, and effort entailed in comparing your options (and the opportunity costs) necessary to ensure you're making the absolute best choice possible.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "At the same time, it's foolish to think that we—as solo dilettantes—can make better decisions than that of any more experienced minority.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "So...if most decisions don't matter, and the time and energy it takes to make the most of those choices doesn't justify the value in making them yourself, why not let other people make them for you? Why not simply poll the experts?",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Consumer Reports",
          "marks": [
            "link-0"
          ]
        },
        {
          "_type": "span",
          "text": "is based on thousands of reviews, made by people just like you and me. So even if it’s a little biased, you’re bound to find something you’ll like.",
          "marks": []
        }
      ],
      "markDefs": [
        {
          "_key": "link-0",
          "_type": "link",
          "href": "https://www.consumerreports.org/cro/index.htm"
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "And Rotten Tomatoes routinely ranks the best shows and movies on your streaming player of choice...all made by people who likely have better taste than you do.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Or consider that—in the case of stock picking—you can easily find what the pro’s are investing in. David Gartner, for example, owns shares of Amazon, Booking Holdings, and Netflix. (It says so in his company emails.) And everyone knows where Warren Buffet puts his money.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "The risk of letting other people make our decisions for us, is that we--and by extension, our culture--will become ever more homogenized, which is likely.",
          "marks": []
        },
        {
          "_type": "span",
          "text": "But that's not what I'm advocating.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "I'm saying be selective about the people you choose to follow or listen to. Screen and qualify your critics. Embrace word of mouth. But let",
          "marks": []
        },
        {
          "_type": "span",
          "text": "them",
          "marks": []
        },
        {
          "_type": "span",
          "text": "make those trivial choices for you--whether it's what to eat or what to watch or what to invest in.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "You might find this gives you more energy and time to think and mull and weigh and compare your options, when it comes to making choices that really count. While providing you with",
          "marks": []
        },
        {
          "_type": "span",
          "text": "more",
          "marks": []
        },
        {
          "_type": "span",
          "text": "satisfaction (and less regret) in those trivial decisions with which you've relinquished your responsibility. (After all, you can't be upset about a choice you didn't make.)",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "It's easy to become ever more overwhelmed by indecision in a world of abundant choice, but by polling the opinions of those you respect, and letting them make some of those decisions for you, you can gain back the freedom to think decisively about the hard choices and options that matter to you.",
          "marks": []
        }
      ]
    }
  ]
}