{
  "title": "148863272.the Summer Reading Challenge",
  "slug": "148863272the-summer-reading-challenge",
  "publishedAt": "2025-11-30T19:29:59.926Z",
  "excerpt": "Sometime recently, I wrote this lengthy post about the benefits of reading widely, having a strong filter, and using your interests and goals as a guide to choosing what books to read, and what not to",
  "image": "",
  "readTime": "3 min",
  "content": [
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Sometime recently, I wrote",
          "marks": []
        },
        {
          "_type": "span",
          "text": "this lengthy post",
          "marks": [
            "link-0"
          ]
        },
        {
          "_type": "span",
          "text": "about the benefits of reading widely, having a strong filter, and using your interests and goals as a guide to choosing what books to read, and what not to.",
          "marks": []
        }
      ],
      "markDefs": [
        {
          "_key": "link-0",
          "_type": "link",
          "href": "https://blog.brendanbockes.com/how-to-decide-what-to-read-next/"
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Of course, all of this completely overlooks the fact that reading--any book, any time--is an absolute joy and a privilege. It's a marvelous way to spend an afternoon, and--considering you might learn something in the process—a far better investment of free time than most things you can afford to 'waste time' on.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "What's more,",
          "marks": []
        },
        {
          "_type": "span",
          "text": "if",
          "marks": []
        },
        {
          "_type": "span",
          "text": "you read widely and deeply (by actually finishing the books you start), that investment may begin to compound and pay off. Because the more you know, the more connections (between ideas) you'll be able to make, and the more you'll learn and retain.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Alas. Somewhere in between college and my late-twenties (perhaps in a naive attempt to learn everything I could in such a short time), I picked up the habit of reading sporadically, or rather, reading in short bursts, usually switching to a new book on a moments notice. The unfortunate side effect being that I rarely ever finish reading the books I’ve already started before I move on to the next book (meaning that I rarely ever finish reading",
          "marks": []
        },
        {
          "_type": "span",
          "text": "any",
          "marks": []
        },
        {
          "_type": "span",
          "text": "books at all).",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "This, plus the ample time I now have stuck at home, plus the",
          "marks": []
        },
        {
          "_type": "span",
          "text": "realization",
          "marks": [
            "link-0"
          ]
        },
        {
          "_type": "span",
          "text": "that if I just read a book a week for the next year, I could finish every book I’ve started plus two dozen more, somehow rekindled my long lost ambition to read more fully. (As in not merely reading widely, but re-committing to reading books deeply, by finishing the books I’ve started and sticking to reading one book at a time).",
          "marks": []
        }
      ],
      "markDefs": [
        {
          "_key": "link-0",
          "_type": "link",
          "href": "https://www.youtube.com/watch?v=r--wz576ke0"
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "(I’m now 4 books finished, and loving every minute of it. Best decision I’ve made in a while.)",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "So here we are. Right on the cusp of summer. With more time than we’ve ever had (one hopes). Nearly 90 days ahead to read more than (perhaps) we ever have, and to maybe, just maybe, rekindle a love of reading we’ve somehow lost or never knew we had.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "I challenge you. Read 10 books in 10 weeks. Try it.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "It’ll be hard a first, but once you’re halfway through, it’ll be cinch. Promise.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "We all know how to binge watch a tv-show. Maybe it’s time we picked up the practice of binge-reading, too. Reading widely, reading deeply, and enjoying ourselves—more than we ever thought we could, or would—wholly engrossed the process.",
          "marks": []
        }
      ]
    }
  ]
}