{
  "title": "148861893.on Little Bets And Choosing A Singular Path",
  "slug": "148861893on-little-bets-and-choosing-a-singular-path",
  "publishedAt": "2025-11-30T19:29:39.453Z",
  "excerpt": "I oftentimes get stuck on choosing the “perfect path” when making a decision. There are so many opportunities available, and to me, deciding is all about choosing the best available option. Of course,",
  "image": "",
  "readTime": "3 min",
  "content": [
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "I oftentimes get stuck on choosing the “perfect path” when making a decision. There are so many opportunities available, and to me, deciding is all about choosing the best available option. Of course, it’s really really hard to decide what that is. And the more choices there are, the harder is it to make just one.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "One thing you can do is read the reviews (I do). But the reviews just reflect what other people think is best. And it very well could be that because just a few others recommended it, even more people (people that would normally otherwise have chose a different option) chose this one. And so what we’re left with is a restaurant or a movie or a product that isn’t exactly the best, but simply more popular in a given medium.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "But what about decisions when popularity doesn’t matter, like when choosing what career path you want to choose? Given that type of decision, what really matters is what you think is best for you. What do you most want to do? If you’re someone like me, that can be really hard to articulate. Especially if you have any many interests I do: cooking, writing, design, psychology, business, marketing, teaching, health, neuroscience, computer science, engineering…the list goes on. How do I make a single decision about what to do next?",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "One option is to wait until I’ve read every book on every subject and I know for sure this is the right path for me. I could wait years until I’m 100% sure this thing (whether it be freelance writing or teaching english as a foreign language or learning to code) is the best viable path, and then decide to commit.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Or I could view each choice as a beta-test, whereby I place a small “bet” on one thing, and then another, and then another. Every time learning more about what I like and what I don’t like about each respected line of work. For example, I could first get my TESOL certificate, try it out for 6 months and",
          "marks": []
        },
        {
          "_type": "span",
          "text": "then",
          "marks": []
        },
        {
          "_type": "span",
          "text": "decide if it’s something I’m willing to pursue further. If it doesn’t work out, well that’s only 6 months to a year spent learning a useful skill and figuring out whether it resonates with me or not. A far better place to be in than waiting 3 years stuck in a dead-end job waiting to decide to pursue anything.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Here’s my retrospective advice: stop waiting, pursue something. Doing nothing gets you nowhere. Nowhere closer to you knowing what’s best for you or your future, and nowhere in the sense that you’ve waited all this time and literally done nothing with your life. On the flip side, if you take a small bet on a singular path, give it 6 months to a year and then decide, you’ll have two things: a useful skill that might come in handy, and the peace of mind in knowing that whether you continue to pursue this thing or not, you’re making the right decision for you.",
          "marks": []
        }
      ]
    }
  ]
}