{
  "title": "148863088.we Get What We Pay For",
  "slug": "148863088we-get-what-we-pay-for",
  "publishedAt": "2025-11-30T19:29:55.843Z",
  "excerpt": "It’s turns out that most kids in foster care wouldn’t be there if their parents had access to the resources, tools and community they needed to develop and maintain safe, stable and nurturing relation",
  "image": "",
  "readTime": "2 min",
  "content": [
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "It’s turns out that most kids in foster care wouldn’t be there if their parents had access to the resources, tools and",
          "marks": []
        },
        {
          "_type": "span",
          "text": "community",
          "marks": [
            "link-0"
          ]
        },
        {
          "_type": "span",
          "text": "they needed to develop and maintain safe, stable and nurturing relationships (both with themselves, and with each other).",
          "marks": []
        }
      ],
      "markDefs": [
        {
          "_key": "link-0",
          "_type": "link",
          "href": "https://www.youtube.com/watch?v=Y_xFlDjm_2I&list=PL3D3A55331163EF0E&index=32&t=0s"
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Of course, the more we pay for foster care, the less we have to pay for the assets and networks that make that kind of cultural shift possible.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Or consider homelessness. It turns out that giving a homeless person a place to stay (and access to social services) is",
          "marks": []
        },
        {
          "_type": "span",
          "text": "ineffective",
          "marks": [
            "link-0"
          ]
        },
        {
          "_type": "span",
          "text": "unless we can also give them the education and opportunities and resources they need overcome the challenges that made them homeless in the first place.",
          "marks": []
        }
      ],
      "markDefs": [
        {
          "_key": "link-0",
          "_type": "link",
          "href": "https://www.theatlantic.com/business/archive/2016/04/end-homelessness-us/479115/"
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "This means that we can spend our tax dollars on more homeless shelters and social workers and low-income apartments all we want…but that no amount of spending will ever offset the toxic stress and overwhelm and destructive forces that cause people to become penniless and hopeless from the outset.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "One last example: food. If you pay for rubbish—feeding the industrial engine of factory farming, GMOs and processed junk—don’t be surprised if you see it in your local supermarket (or in your kids mouth). Don’t be surprised if it continues...indefinitely.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "It’s going to take a real shift to change the culture…but as with all mass movements, everything starts on the local, minuscule, seemingly negligible level. If we want to change things, we have to start investing in the counteractive (grassroots) measures that make transformation possible (not simply the palliative mass-marketed elixirs of a world bent on short-sighted change).",
          "marks": []
        }
      ]
    }
  ]
}