{
  "title": "148862962.adequate Ism",
  "slug": "148862962adequate-ism",
  "publishedAt": "2025-11-30T19:29:53.764Z",
  "excerpt": "There's never been an easier time to compare yourself to others, or against arbitrary (status-seeking) metrics.",
  "image": "",
  "readTime": "2 min",
  "content": [
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "There's never been an easier time to compare yourself to others, or against",
          "marks": []
        },
        {
          "_type": "span",
          "text": "arbitrary",
          "marks": [
            "link-0"
          ]
        },
        {
          "_type": "span",
          "text": "(status-seeking) metrics.",
          "marks": []
        }
      ],
      "markDefs": [
        {
          "_key": "link-0",
          "_type": "link",
          "href": "/the-process-trumps-progress/"
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "From people who addicted to sharing (and comparing) photos of themselves online, to those who willingly suffer to hit a target, or people (and organizations) who easily spend hundreds (if not thousands) of dollars to track and improve their performance.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "In so doing, we've created a culture bent on comparison: who has what? Who's better off? Who's going up, or down, on the invisible latter of life.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "You can see it in our cultural lexicon too. Because you can't have \"winners,\" without \"losers,\" and you can't be the \"the best…\", \"the most…\", or \"the top…\" without having a long string of contenders and outliers to compare yourself to.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Or, even, consider something as simple as our material possessions. Where once it was considered a privilege to simply own an automobile, a home, or well-fitting clothes, we now find ourselves spending our savings on surplus and excess, not essentials. From",
          "marks": []
        },
        {
          "_type": "span",
          "text": "headware",
          "marks": [
            "link-0"
          ]
        },
        {
          "_type": "span",
          "text": "to home appliances, luxury automobiles to 2,000 plus square-foot homes, it seems like everyone is trying to out-status one another on the metric of the moment. Often spending their fortunes on the ever evolving perception of status and prestige, rather than on necessities and experiences alone.",
          "marks": []
        }
      ],
      "markDefs": [
        {
          "_key": "link-0",
          "_type": "link",
          "href": "https://www.streetwearofficial.com/collections/supreme-headwear"
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "I get the appeal of having nice things, I do. But it seems to me that better things can be done with our time and attention and well-earned money if we're willing to trade the pursuit of more (and better) for the widely available bliss of",
          "marks": []
        },
        {
          "_type": "span",
          "text": "moderation",
          "marks": [
            "link-0"
          ]
        },
        {
          "_type": "span",
          "text": ". Of acknowledging how good we have it, just as we are.",
          "marks": []
        }
      ],
      "markDefs": [
        {
          "_key": "link-0",
          "_type": "link",
          "href": "https://hbr.org/2018/06/in-praise-of-extreme-moderation"
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "What if you used your surplus of assets on something better than feeding your ego? What if you exchanged the desire to feel like you’re 'more better off' for the simple confirmation that you're 'good enough' instead?",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "What would you do differently?",
          "marks": []
        },
        {
          "_type": "span",
          "text": "How would you spend your time? Who could you be, and become?",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Chasing adequate has its benefits. It's hipper and cheaper too.",
          "marks": []
        }
      ]
    }
  ]
}