{
  "title": "148862960.keep It Simple Stupid",
  "slug": "148862960keep-it-simple-stupid",
  "publishedAt": "2025-11-30T19:29:53.721Z",
  "excerpt": "Last weekend, I experienced the disaster that so often occurs when organizations try to do too much.",
  "image": "",
  "readTime": "2 min",
  "content": [
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Last weekend, I experienced the disaster that so often occurs when organizations try to do too much.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Because while my latte was certainly good, the ambiance inviting, and the plush and expansive seating luxurious, waiting for an hour for a mediocre breakfast sandwich was not how I envisioned spending my morning.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Many organizations selfishly believe that they can and therefore should do everything possible to make a",
          "marks": []
        },
        {
          "_type": "span",
          "text": "profit",
          "marks": [
            "link-0"
          ]
        },
        {
          "_type": "span",
          "text": ", instead of uncompromising about what they do and do not offer, and offering one core product or service and overdelivering on it.",
          "marks": []
        }
      ],
      "markDefs": [
        {
          "_key": "link-0",
          "_type": "link",
          "href": "/easy-money/"
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "So instead of having an amazing corner coffee shop (with nice chairs) you get a sub-par coffee shop. And a mediocre kitchen. And a service staff who are so caught up in taking orders they can't bother to tell you that their kitchen staff is behind.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Moreover, because entrepreneurs are trying to cut corners (to save money to afford to sell all that stuff) they so often don't hire enough people to ensure that things like this don't happen often. So instead of having enough people to cook food and run food and take orders and respond to customer requests, they generally have less people than they should. Which means that instead of regularly delighting their customers, they routinely create the impression that they're too cheap to care to fix the problem. Over time, trust degrades, making it harder for their customers to give them the benefit of the doubt, and harder for their staff to even care about the seemingly endless queue of disgruntled customers.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Certainly, I'm extrapolating here, but it's to accentuate my point. Appealing to everyone by offering everything comes at a cost. More often, that cost is quality, service, and simplicity.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Starbucks is a great example of a business that does many things well. It's a fast food restaurant, and a specialty coffee shop, and a retail store, all at once. But Starbucks didn't start out that way (it didn't even sell beverages starting out). Instead, they started small and worked their way up...focusing exclusively on delighting their biggest fans and (slowly) scaling up operations from there.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "It doesn't take much to create a profitable business. Just something worth paying for, and the discipline and patience to not be so overconfident to think you can pull off everything all at once.",
          "marks": []
        }
      ]
    }
  ]
}