{
  "title": "148861886.what Do I Know",
  "slug": "148861886what-do-i-know",
  "publishedAt": "2025-11-30T19:29:39.320Z",
  "excerpt": "Reading helps you make better informed decisions about everything in your life. So does listening to podcasts and audiobooks and TED talks. And writing can help you get all those disorganized thoughts",
  "image": "",
  "readTime": "3 min",
  "content": [
    {
      "_type": "block",
      "listItem": "number",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Reading helps you make better informed decisions about everything in your life. So does listening to podcasts and audiobooks and TED talks. And writing can help you get all those disorganized thoughts and ideas clear and concise. So that you can later tell a friend, or someone who needs it.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "listItem": "number",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Exercise is great for your body (obviously) your mind (endorphins), and your wallet. I read yesterday that, considering how much we annually spend on health care costs from being inactive, you could save $2,500 a year just by exercising regularly.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "listItem": "number",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "A lot of people get up in the morning resenting the world or “the man” because they have to go do a job they’re not particularly passionate about. Thing is, most people develop passions for what they do after the fact, not before it. Most great chefs don’t say “I love to eat” and then become chefs (for the record, everyone loves to eat). Instead, they find themselves cooking in their parent’s kitchens and after a few years decide they like doing it so much they get a job as a line cook. Maybe they go to culinary school, or maybe they leap from one great restaurant to the next. Over time they develop a passion for what they’re doing. You don’t start with passion. You start with learning and doing. If you choose to care enough about what you’re doing, you can create the motivation you need to do great work. If what you’re doing isn’t important to you, make it important. Everyone can find ways to love what they do.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "*Today I woke up and decided to write a post, but I quickly decided I had nothing to write about. So I wrote the title above “What do I know?” and decided to write 3 things that I personally believe about the world. Obviously, I discovered I have a lot more writing material than I originally thought I did.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Much like some of the techniques described in Anne Lamott’s brilliant book “Bird by Bird,” write: “3 things that you know to be true” might be a helpful practice in teaching people there’s no such thing as writer block, it’s all in your head. If you let go of your ability to let yourself off the hook (by reinforcing the narrative that you have absolutely nothing to say) and make it simple (“you can literally write about anything you know”), I think you’ll be surprised as to what you can produce.",
          "marks": []
        }
      ]
    }
  ]
}