{
  "title": "148863263.modern Marketing",
  "slug": "148863263modern-marketing",
  "publishedAt": "2025-11-30T19:29:59.713Z",
  "excerpt": "A hiring manager at an undisclosed media company reached out to me, asking how I might be of service in building out ‘full digital marketing ecosystems’ for their clients (as opposed to a few well-per",
  "image": "",
  "readTime": "2 min",
  "content": [
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "A hiring manager at an undisclosed media company reached out to me, asking how I might be of service in building out ‘full digital marketing ecosystems’ for their clients (as opposed to a few well-performing marketing funnels).",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "It occurred to me sometime after that this is, of course, the problem with most modern marketers. Because building a ‘funnel’ to convert a well defined audience apparently isn’t enough anymore. Since people can be nurtured across every corner of the web and beyond—",
          "marks": []
        },
        {
          "_type": "span",
          "text": "I mean, just look at all these",
          "marks": []
        },
        {
          "_type": "span",
          "text": "metrics",
          "marks": [
            "link-0"
          ]
        },
        {
          "_type": "span",
          "text": "!",
          "marks": []
        },
        {
          "_type": "span",
          "text": "—it seems necessary to target them across every channel, every medium, every possible touchpoint.",
          "marks": []
        }
      ],
      "markDefs": [
        {
          "_key": "link-0",
          "_type": "link",
          "href": "https://prnt.sc/sry7sk"
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "The problem is that by focusing on so many things continuously, it’s more likely that you’ll create a pared down experience for your entire audience. And since you’ll actually never have enough time and resources to focus on optimizing any one metric in your ‘ecosystem,’ (because you’ve prioritized all of them) you’ll inevitably create a poor brand experience overall.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Moreover, just because having a ‘holistic strategy’ can improve your clients’ metrics across the board, doesn’t mean you should make it a priority to utilize every touchpoint. Sure, you need traffic to generate leads and leads to generate sales. But social media",
          "marks": []
        },
        {
          "_type": "span",
          "text": "and",
          "marks": []
        },
        {
          "_type": "span",
          "text": "SEO",
          "marks": []
        },
        {
          "_type": "span",
          "text": "and",
          "marks": []
        },
        {
          "_type": "span",
          "text": "blogging",
          "marks": []
        },
        {
          "_type": "span",
          "text": "and",
          "marks": []
        },
        {
          "_type": "span",
          "text": "CRO",
          "marks": []
        },
        {
          "_type": "span",
          "text": "and",
          "marks": []
        },
        {
          "_type": "span",
          "text": "outreach may not be the most effective way to do it.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "In my opinion, it’s better to focus on optimizing one metric in your funnel at a time, and to think really hard about where and how your audience is going to convert.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Also…the best business strategy in the world is to simply have a great product. And the highest return-on-investment marketing metric is, in fact, word-of-mouth. That said, if you’re unwilling to work with your clients to help",
          "marks": []
        },
        {
          "_type": "span",
          "text": "them",
          "marks": []
        },
        {
          "_type": "span",
          "text": "communicate and optimize the value of their offering (not simply by blogging about it, but by enhancing the user experience) you’re just wasting potential.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Modern marketing is about improving the holistic experience so that it catches on and spreads organically, not just spreading the word every way you know how.",
          "marks": []
        }
      ]
    }
  ]
}