{
  "title": "148862233.advice For Twenty Somethings",
  "slug": "148862233advice-for-twenty-somethings",
  "publishedAt": "2025-11-30T19:29:44.351Z",
  "excerpt": "It turns out following your passion is really bad advice.",
  "image": "",
  "readTime": "2 min",
  "content": [
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "It turns out following your passion is really bad advice.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "A few reasons why:",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "1) Waiting to “discover your passion” before you get work experience often leads to mere paralysis and headache. Time that could be better spent learning skills and discovering your strengths by way of experience and realizing what you’re not any good at.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "2) Steve Jobs said that the “only way to do great work is to love what you do.” Thing is, similar to a relationship, love is an emotion you develop over time. First, you learn to appreciate aspects of what you do by learning how to do it well. The better you get a doing it (and the more rewarding it makes you feel) the more passion you're going to cultivate for doing it. If loving something wholeheartedly was a prerequisite for mastery of a profession (or a person), most people would quit before than even started.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "3) As Mike Rowe",
          "marks": []
        },
        {
          "_type": "span",
          "text": "points",
          "marks": [
            "link-0"
          ]
        },
        {
          "_type": "span",
          "text": "out, most people can’t make a career out of their passion. As in the case of musicians and actors, there’s not a big enough market for everyone to fill that niche. Because competition is so fierce, many talented (and not so talented) people unexpectantly don’t make the cut. When they do, they’re forced to reckon with the reality that relative to market demand and compeition, they’re not as good as they thought they were. That their passion is, in fact, an unreliable indicator as to what they should do professionally.",
          "marks": []
        }
      ],
      "markDefs": [
        {
          "_key": "link-0",
          "_type": "link",
          "href": "https://www.youtube.com/watch?time_continue=308&v=CVEuPmVAb8o"
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "4) Following opportunity is a better strategy. It’s better to pursue something that’s in high demand than to chase a dream that might not pay out. Certainly there’s an alluring aspect to pursue a life as a struggling artist (or something similar) who at least makes a living doing what he loves. But a better strategy might be to make doing what you’re passionate about a hobby and do something else to pay the bills. That way, the demands and monotony of work won’t snuff out your enthusiasm, and you'll get to do something else that's interesting and that pays well to boot.",
          "marks": []
        }
      ]
    }
  ]
}