{
  "title": "148861913.on Anger Losing It And Not Biting The Hook",
  "slug": "148861913on-anger-losing-it-and-not-biting-the-hook",
  "publishedAt": "2025-11-30T19:29:40.221Z",
  "excerpt": "I did something stupid today. And almost immediately after, almost instinctively, I habitually stormed out of the room and reenacted a few scenes from James Woods’ most talked-about 1997 film role.",
  "image": "",
  "readTime": "5 min",
  "content": [
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "I did something stupid today. And almost immediately after, almost instinctively, I habitually stormed out of the room and reenacted a few",
          "marks": []
        },
        {
          "_type": "span",
          "text": "scenes",
          "marks": [
            "link-0"
          ]
        },
        {
          "_type": "span",
          "text": "from James Woods’ most talked-about 1997 film role.",
          "marks": []
        }
      ],
      "markDefs": [
        {
          "_key": "link-0",
          "_type": "link",
          "href": "https://www.youtube.com/watch?v=6IeTWYv5zus"
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Alas, it wasn’t pretty. I spent a good 30 minutes fuming until I ran out of steam, and then I spent the rest of the day regretting it. How could I have allowed something so ridiculous to make me so upset and as a consequence, ruin what would have otherwise been a productive and peaceful day?",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "I hate to say that although I don’t show it around most of my peers, I’ve always had a pretty bad temper. I could easily blame my upbringing or genetics or whatever, but I know that’s just an immature excuse. And abdicating responsibility have never helped a soul alive change his actions or or behavior, myself included.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "So tonight I’m writing this post for me, to summarize my thoughts on losing my temper, and what steps I can actively take now to change my response to the emotion of anger so that when I have a family of my own I’m still not engaging in what I consider to be disturbing and frankly childish behavior as a means of self-soothing. I say this now because I know that the only way I’m going to change is by deliberately making an effort to do so, and that starts by admitting that this is a problem that only I can change, as well as ultimately making it a goal to cultivate presence (as opposed to having a fit of rage) in those heated moments when anger arises.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Intellectually, I know that catharsis, that is, “the process of releasing strong emotions,” or in the case of anger “having a shit-fit” is a rarely justifiable behavior. It’s never helped me once get anywhere closer to accomplishing the things I’m working on, or mending a wrong, or fixing what’s broken, or making me feel better (and the",
          "marks": []
        },
        {
          "_type": "span",
          "text": "research",
          "marks": [
            "link-0"
          ]
        },
        {
          "_type": "span",
          "text": "proves it). On some evolutionary level I’m sure it helps encourage your peers, enemies and/or wild beasts to stay away when you’re most likely to attack them, but for the most part it holds you back from accomplishing your goals in the most efficient way possible. And it certainly can (and will) wreck havoc on your relationships.",
          "marks": []
        }
      ],
      "markDefs": [
        {
          "_key": "link-0",
          "_type": "link",
          "href": "https://scholar.google.com/scholar?q=catharsis+theory+of+aggression&hl=en&as_sdt=0&as_vis=1&oi=scholart&sa=X&ved=0CBwQgQMwAGoVChMIr5Dm3uKEyQIVB28UCh3bJAtn"
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "That much explains why exploding in anger and frustration is a bad thing. Now how to change it:",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "In her brilliant audio program,",
          "marks": []
        },
        {
          "_type": "span",
          "text": "Don’t Bite The Hook",
          "marks": [
            "link-0"
          ]
        },
        {
          "_type": "span",
          "text": ", buddhist teacher Pema Chodron talks about creating space for anger. Comparing it to meditation, the emotion of anger (and the thoughts and actions that generally follow it) can be likened to our natural tendency to get caught up in thought. As anyone who’s ever attempted meditation will tell you, we can’t change what we’re thinking, and we can’t stop our thoughts from occurring. What we can do is make a habit of cultivating mindfulness by consistently re-adjusting our focus back to our breath every time we get caught up in thinking. Likewise the experience of anger starts first as an emotion; a feeling generally described as a hot prickly sensation in our bodies that occurs when things don’t go our way. Just as thoughts occur naturally and uncontrollably, so too do feelings arise in our hearts and minds. And it’s only after the feelings arise do we have the ability to control where we direct our energy and attention. Most of the time what people do next is “bite the hook,” they scratch the itch—the feeling of anger—and fuel it more and more by getting lost in thinking about what made them angry and how ridiculous it is and how the world should pay. Usually this is where catharsis plays a role too, either in the form of yelling and screaming or breaking things or engaging in violence, and this too, only amplifies one’s feelings and adds fuel to the fire.",
          "marks": []
        }
      ],
      "markDefs": [
        {
          "_key": "link-0",
          "_type": "link",
          "href": "http://www.amazon.com/Dont-Bite-Hook-Resentment-Destructive/dp/1590304349"
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "The alternative, as you no doubt have guessed, it to cultivate presence as soon as the emotion of anger strikes. If you can stay mindful of your goal to not explode in anger when you feel those natural feelings arise, you might have a shot at creating just enough space to allow yourself the opportunity to do something other than blowing up. If you can learn to just sit with your feelings for example, or go engage in some alternative activity to take your mind off things, you may be able to overcome the situation with some degree of emotional stability instead of losing yourself in a fit of rage.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "As Pema notes, this is hard, strenuous work that takes patience and self-acceptance and grit (she struggles with it too, even). In fact, it might take years of blowing up and reflecting on it for you to even begin to change, as these habits are already hardwired and you may have been doing them automatically probably for as long as you remember. But finding a way to escape the temptation to bite the hook, to amplify our feelings of hate and thoughts of self-righteousness, as well as mend the suffering and havoc it causes on our psyche’s and our relationships is an infinitely rewarding skill.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Change might be astonishingly difficult, but it’s certainly worth it.",
          "marks": []
        }
      ]
    }
  ]
}