{
  "title": "148861894.pacing Vs Leaping Two Sides Of The Same Metaphorical Coin Of Making Your World Bigger",
  "slug": "148861894pacing-vs-leaping-two-sides-of-the-same-metaphorical-coin-of-making-your-world-bigger",
  "publishedAt": "2025-11-30T19:29:39.475Z",
  "excerpt": "It always seems so much more comfortable to gradually challenge ourselves to accomplish ever bigger and bolder projects. To dabble into discomfort and wade into our fear.",
  "image": "",
  "readTime": "4 min",
  "content": [
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "It always seems so much more comfortable to gradually challenge ourselves to accomplish ever bigger and bolder projects. To dabble into discomfort and wade into our fear.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Thing is, it takes just as much, if not more emotional energy, to spend years and years working up to the point where you feel comfortable to do what really scares you as it is to take a huge leap of faith in the present.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Everyday you have the opportunity to challenge yourself, to grow, to learn, and to create the world you want to live in. The extent to which is up to you. You can take a huge leap, or a little one. It’s all your choice. And I don’t necessarily think one choice is better than the other. They’re just options, and one option might be a better strategy depending on one’s circumstances.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "By way of metaphor, take the humble squirrel. He wants to get across the street. Thousands of years of evolution in the wilderness have taught him that the best way to get across foreign territory is to hop, stop, wait and repeat. Now this is probably a great idea when the squirrel is in his natural habitat (the forest). But it’s not so great a plan of attack when he’s trying to make his way across the street. He doesn’t know it’s a street, how could he? And so he doesn’t know that humans use the street to move their incredibly fast, gigantically big, one ton box of steel transportation vehicles across the street in the opposing direction. And so he can’t possibly know that his strategy might implode. Whereas if he paced himself, took a deep breath and ran across the street as fast as he could, statistically speaking, he’d have a better chance of survival.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Same thing applies to us when we dapple into our own foreign territory. In some instances, small wins over time might be the appropriate strategy. We might have just graduated college and landed a job at a great company in the city. We don’t want to take on too much responsibility (more than we can handle) so we gradually work our way up the corporate ladder, gradually taking on more and more responsibility as our competence improves. But what about all those folks who call themselves entrepreneurs and artists? What if they wait, stuck in their day jobs, believing they’ll eventually get a chance to do what they want with their lives, but waiting until they pay off their tuition or until their financially independent or whatever? They might miss out on the chance of a lifetime. If they gradually wade into the discomfort of doing the thing they want to do, they might never write that book or launch that Kickstarter or take the time to become the artist they have the potential and passion to become. What’s more, they might miss out on all the other opportunities that might be available to them if they’d just take a huge leap of faith right now, in the present.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "I don’t think one strategy is better than the other. One may be more appropriate given our circumstances or narratives. What matters, I think, is that we’re cognizant of how far we can really stretch ourselves if we want to, and that we recognize when we’re selling ourselves short. Knowing that we have a choice about the range at which we can leap, I think, is the first step in the deciding whether should dapple into discomfort and work our way up, or if we should take a huge risk and go all in.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Both options are emotionally taxing. Both require that you experience varying degrees of psychological discomfort over time. One is relatively short but feels much more intense. While the other is long and drawn out but no less intimidating.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "You’re choice. Every day. Worth considering.",
          "marks": []
        }
      ]
    }
  ]
}