{
  "title": "148862118.learning From Retrospect",
  "slug": "148862118learning-from-retrospect",
  "publishedAt": "2025-11-30T19:29:43.281Z",
  "excerpt": "Some of the best decisions you will ever make will be the result of your mode of thinking after having exposing yourself to an experience.",
  "image": "",
  "readTime": "2 min",
  "content": [
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Some of the best decisions you will ever make will be the result of your mode of thinking after having exposing yourself to an experience.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "You might decide, for example, only moments after you left, that you should in fact have brought along your eye-glass case on your trip, because you might wish to take a nap on the way, and without it have nothing to securely place your glasses.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "You might also decide that half the stuff you packed you don’t really need to take. And the fee you’ll have to pay to bring it on the plane with you, might not be as great an investment as you originally thought.",
          "marks": []
        },
        {
          "_type": "span",
          "text": "\n",
          "marks": []
        },
        {
          "_type": "span",
          "text": "\n",
          "marks": []
        },
        {
          "_type": "span",
          "text": "Or maybe you realize one day that the college you went to, or the degree you earned, or the job you picked, or what you’ve decided to do (with your life) for the past few years, wasn’t the very best choice, all things considered.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Of course, we only accrue the benefits of hindsight after the fact. But that doesn’t mean we can’t try better next time. Make a mental (or physical) note. Write it down. Do something different next time.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Learning from retrospect is the best way I know how to navigate the future.",
          "marks": []
        }
      ]
    }
  ]
}