{
  "title": "148863872.not Always Applicable",
  "slug": "148863872not-always-applicable",
  "publishedAt": "2025-11-30T19:30:09.358Z",
  "excerpt": "One of the biggest reasons people have issues with other people is because they assume that everyone thinks, acts, and feels precisely like them. That what's applicable to them is applicable to everyo",
  "image": "",
  "readTime": "2 min",
  "content": [
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "One of the biggest reasons people have issues with other people is because they assume that everyone thinks, acts, and feels precisely like them. That what's applicable to them is applicable to everyone.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "This would otherwise be fine, except that what appears to be common or unconscious knowledge for me, might not be the same for you.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Nowhere is this more common than in the words we use--our acronyms, our colloquialisms, our jokes.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "The PNW, for example, might be the Pacific Northwest for some but not for all. In the same way that the DMV (for me) is more than a place to get your driver's license.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Similarly, the sayings we use, our mannerisms, our lessons and our fables, they're all local. Dependent on who we are and where we're from.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "But so are many other things we don't often acknowledge: like customs, values, and norms. Who's job it is to do certain tasks, or to adopt certain roles in certain contexts.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "We can get in a lot of trouble (and find ourselves constantly frustrated) when we assume that other people will act precisely the way we expect them to, based on our worldview and not",
          "marks": []
        },
        {
          "_type": "span",
          "text": "theirs",
          "marks": []
        },
        {
          "_type": "span",
          "text": ".",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "On the other hand, extending our frame of reference to encompass their point of view--whatever it may be--might be the best way to bridge that gap with clarity and positive direction.",
          "marks": []
        }
      ]
    }
  ]
}