{
  "title": "148862315.less Is More If You Want It To Be",
  "slug": "148862315less-is-more-if-you-want-it-to-be",
  "publishedAt": "2025-11-30T19:29:44.564Z",
  "excerpt": "Part of what it means to embrace minimalism is giving up a lot of the luxuries society and marketing would have us believe we want.",
  "image": "",
  "readTime": "2 min",
  "content": [
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Part of what it means to embrace minimalism is giving up a lot of the luxuries society and marketing would have us believe we want.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "So we give up our pursuit of a mansion and a luxury car and fancy clothes.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Often neglected in our pursuit of less, however, are many of the things we think we think we need.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "So we buy new headphones instead of making use of the free ones that came with our phone.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "And we buy a tv and a soundbar and a Roku instead of opting to use our laptop as our go-to entertainment center.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "And we buy a car because \"how else are we going to get around?,” before we even consider looking into cheaper alternatives.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Of course, the benefit of embracing minimalism isn't asceticism. It's discovering that you can be happy, appreciative, joyful even--by embracing the notion that you can be happier by pursuing less of what you think you need to be content.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "You’re not giving up the headphones, you’re giving up the idea that you’ll be happier with new headphones than you would be without them.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Minimalism is an verb, not a noun. It's choosing to see that you live in a position of vast abundance. Leaning into the idea that you can have everything in life you want, by simply giving up many of the things you only think you want, and making use of the great many things already in your possession.",
          "marks": []
        }
      ]
    }
  ]
}