{
  "title": "148861973.fear As A Compass",
  "slug": "148861973fear-as-a-compass",
  "publishedAt": "2025-11-30T19:29:40.926Z",
  "excerpt": "Once you decide that leaning into fear is the only good option you have toward actualizing your dreams, the question of whether or not the fear subsides isn’t important.",
  "image": "",
  "readTime": "2 min",
  "content": [
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Once you decide that leaning into fear is the only good option you have toward actualizing your dreams, the question of whether or not the fear subsides isn’t important.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Because the fear itself—the feeling coming from your amygdala—isn’t going away, not as long as you continue to do things outside your perceived comfort zone—things that make you feel; that make you vulnerable; and that expand your reality and your place in it.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "“How do I get the fear to go away?” is the wrong question, because the feelings themselves (and the thoughts that accompany them) are an automatic biological response to risk. And risk (and the experience that precedes it) is exactly what you must do to change your world.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Alas, a better question to ask is, “What’s worth doing even if I fail?”",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Then ask yourself: is the risk of doing X worth the reward? Is the cost of not doing X greater the cost of doing it and failing? And, if I fail, if my worst fear comes to fruition, what will I have to do to get back to where I started — back to where I am now?",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Before you experience fear, decide for yourself if what you intend to do is worth it. If a life of not doing it is a life worth living — in the long run — and how you can side-step absolute disaster should your worst-case scenario come to actualization.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Then write it down. Sign and date.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "As Seth would say, “It’s significantly easier to cross a gap when you have direction and momentum.”",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "He’s right. When you know what you value most, when you’re conscious of the fact that a life of not doing this thing you fear is far worse than acknowledging your feelings and taking a risk anyway, it’s much easier to take a leap.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "“Decision-making is over. I’m going to do this—today—or fail trying.”",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Only when you can embrace that idea, when you can articulate your values with honesty and bravery, can you begin to look at fear as a compass — a guide to where you want to go and who you want to be.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "And to lean into doing the things you fear, not with the uncertainty of “is this the path for me?”, but rather the certainty of knowing, whole-heartedly, “This *is* the way. And I’ll thank myself later for taking it.”",
          "marks": []
        }
      ]
    }
  ]
}