{
  "title": "148861852.on The Case Of Original Breakthroughs Vs Regurgitated But Better Concepts",
  "slug": "148861852on-the-case-of-original-breakthroughs-vs-regurgitated-but-better-concepts",
  "publishedAt": "2025-11-30T19:29:39.143Z",
  "excerpt": "As I sit here to write out another post this morning, I find myself tempted to reach for one the hundreds of books scattered around my room, hoping to find an idea that will catalyze into another idea",
  "image": "",
  "readTime": "3 min",
  "content": [
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "As I sit here to write out another post this morning, I find myself tempted to reach for one the hundreds of books scattered around my room, hoping to find an idea that will catalyze into another idea in my mind. But on the flip side, I think that if I reach for something external, I won’t be creating something out of nothing, and therefore my writing won’t be original. This of course, is nonsensical. But it got me thinking, why do I feel pressured to write something original in the first place? I think, although it’s possible to do such a thing, it’s also somewhat of an unrealistic expectation. Because ideas aren’t created in a vacuum. Everything I could say or have written is a byproduct of the thinking and writing of those who have influenced me, whether I’m cognizant of it or not. There’s no such thing as a meritocracy.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "So rather than sit here and wait for a new idea to come along, maybe I ought to consider simply writing about something I didn’t know when I was ten, for someone who may or may not be aware of the insights I have to share. Or maybe I should write for the person I was 3 weeks ago. Something new (not necessarily original) but something I didn’t know that I learned or observed or now believe about the world. I think it’s a far more practical use of my allotted writing time to write about something that certainly other people have written about before, but for the people reading this, my tribe of sorts, or at least my immaterial past self, than it is to wait for something original to strike me like lightning.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Of course, the same",
          "marks": []
        },
        {
          "_type": "span",
          "text": "idea",
          "marks": [
            "link-0"
          ]
        },
        {
          "_type": "span",
          "text": "applies to just about any project, product or service. You don’t have to be necessarily original. Maybe you take an old product, and you make it better in every dimension. Certainly you can make an iPhone, but you can also make one of",
          "marks": []
        },
        {
          "_type": "span",
          "text": "these",
          "marks": [
            "link-1"
          ]
        },
        {
          "_type": "span",
          "text": ".",
          "marks": []
        }
      ],
      "markDefs": [
        {
          "_key": "link-0",
          "_type": "link",
          "href": "http://sethgodin.typepad.com/seths_blog/2014/11/of-course-its-been-done-before.html"
        },
        {
          "_key": "link-1",
          "_type": "link",
          "href": "http://www.staples.com/Crosley-CR64-Candlestick-Phone-Black/product_108623?cid=PS:GooglePLAs:108623&ci_src=17588969&ci_sku=108623&KPID=108623&cvosrc=PLA.google-SALES.Phones%2C%20Cameras%20%26%20Electronics&cvo_crid=39357182142&cvo_campaign=71700000015224338&gclid=COTg5a-xtdECFcpMDQodabMIQA"
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Point is, you don’t make art in a vacuum, no one does. Whether it’s original or not, you should do it because it’s important to create and to share and to give. Create your thing, the best way you know how. Whether it’s out of this world original or yesterday’s thing, only better.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Do it because we need you. Your insight, your contribution, your generosity. It matters.",
          "marks": []
        }
      ]
    }
  ]
}