{
  "title": "148862124.what Do You Want To Be When You Grow Up",
  "slug": "148862124what-do-you-want-to-be-when-you-grow-up",
  "publishedAt": "2025-11-30T19:29:43.424Z",
  "excerpt": "Or if you consider yourself already grown-up: “what job are you looking for?”",
  "image": "",
  "readTime": "2 min",
  "content": [
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Or if you consider yourself already grown-up: “what job are you looking for?”",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "For many indecisive people who have yet to discover their calling, like myself, this has always been an especially difficult question. How do you pick one job out of potentially thousands of alternatives? A job that will impact just about every aspect of your life for the foreseeable future.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "In retrospect, I realize now a far better question might be, “what job are you",
          "marks": []
        },
        {
          "_type": "span",
          "text": "not",
          "marks": []
        },
        {
          "_type": "span",
          "text": "looking for?”",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "I can think of hundreds of jobs I’m not particularly interested in: politician, policeman, accountant, food service manager, wait-staff (just about anything to do with food service), mathematician, lawyer, bank-teller, just to name a few.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Because I’ve now limited my options, it’s far easier for me to choose what I am interested in. Because I’m not choosing from a list of thousands of potential choices, I'm choosing from a list of what jobs remain after all the less interesting jobs are omitted.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "From there, you can pick the 3 most interesting (or the most challenging). Mull them over, sleep on it, and then decide on just one. If you’re really indecisive, you could even pick from a hat or ask a close friend to make the decision for you. Then have a go at it.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Pick your major, apply for that job, get a degree if you need to, try it out. If it resonates, stick to it. If not, rinse and repeat.",
          "marks": []
        }
      ]
    }
  ]
}