{
  "title": "148861838.on Overcoming Our Fear Of The Ambiguous Rangeometer And Other Trials",
  "slug": "148861838on-overcoming-our-fear-of-the-ambiguous-rangeometer-and-other-trials",
  "publishedAt": "2025-11-30T19:29:38.816Z",
  "excerpt": "Yesterday, I encountered an interesting experience. For the first time in the 8 months I’ve owned my Nissan Leaf (all electric hatchback), I crossed the 5-mile range threshold while driving home.",
  "image": "https://blog.brendanbockes.com/wp-content/uploads/2017/02/6a01a73dc1cc30970d01b7c8d0ec37970b-800wi.jpg",
  "readTime": "4 min",
  "content": [
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Yesterday, I encountered an interesting experience. For the first time in the 8 months I’ve owned my Nissan Leaf (all electric hatchback), I crossed the 5-mile range threshold while driving home.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Normally, on the right side of the dash, it shows the supposed amount of electricity I have left in the battery (as shown via levels), and below that the amount of mileage (normally an indicated by a two-digit number) that I have left to go on based on a fancy algorithm based on my current speed. When I hit 13 miles it gives me a warning that I'm running low on range, and I’ve since never gone below 9 miles before charging again. But last night, it was late, and I figured I was close enough home that I could make it. Alas, when I got on the exit-ramp to get off the highway my “range-o-meter” looked like this:",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Now, I know it read I had about 6 miles to go before it gave me the illegible message, yet despite that, my fear kicked into overdrive. My chest tightened, I began to experience anxiety, and I began to wonder “what if I run out of juice?”",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "If you must know, I made it home without any issue. But I realized this is a perfect metaphor for just about any non-life-threatening fear we experience in our modern lives. Whether it’s public speaking or speaking up in a meeting, asking someone for help (or out on a date), or experiencing airplane turbulence or trying something for the first time, we experience a moderate amount of physiological fear. And then we amplify those physical feelings with anxiety, thinking about and experiencing failure before we even experience it. We ask ourselves “what if…I fail? I do something stupid? I embarrass myself in public? I’m criticized for my actions?” And our small fears (I’m going to run out of range to make it home) become big fears (I’m going to be stranded on the side of the road and everyone will laugh at me). And yet, our anxiety does little more than make it more likely that we mess up and freak out, because we’re so worried about not making a mistake in the first place. And so we psych ourselves into doing something stupid before we’ve even given ourselves a chance at responding intelligently.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Being stopped on the side of the road isn’t a big deal. Neither is calling a wrecker via your smartphone. Or calling a friend for a ride home. Same thing goes for public speaking. If you make a mistake in your presentation, those listening are generally too preoccupied with the story in their head to notice. If you ask a “dumb” question in the meeting, people will probably take it as a sign that you needed something reiterated, not that you’re just plain stupid. And being rejected is 90% of the time non-personal. If they said, it has more to do with them and their story than their objective understanding of you. Turbulence? Do you really think hyperventilating is going to help land the plane any better?",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "You see, it’s not the repercussions of what we fear or the actions we’ll have to take as a result that cause us to panic. Just like my ambiguous range-o-meter, it’s the uncertainty of not knowing what’s going to happen next that creates those numbing physiological sensations. And it’s the story you regurgitate about those feelings that serve to either agitate those feelings, causing you to become paralyzed by them, or dancing with those feelings, enabling you to respond logically and with composure.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Certainly, you’re going to experience fear; those physiological sensations, and the habitual worrying you engage in as a result. One choice is to focus all your energy on trying to numb those sensations and avoid the consequences of making a mistake. The other is to stay mindful of your freedom of choice, of how you’ll inevitably respond, and your power to act with intelligence and with composure.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Are you afraid of an action (you might have to take)? Or are you afraid of a feeling (you have no control over)?",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Worth discerning.",
          "marks": []
        }
      ]
    }
  ]
}