{
  "title": "148862600.how To Get Job Experience When You Have None",
  "slug": "148862600how-to-get-job-experience-when-you-have-none",
  "publishedAt": "2025-11-30T19:29:47.721Z",
  "excerpt": "Take interesting jobs (that might not work).",
  "image": "",
  "readTime": "2 min",
  "content": [
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Take interesting jobs (that might not work).",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Not jobs that pay well. Or that have a great benefits package. Or that (might) lead somewhere.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Instead, jobs that give you the opportunity to do work you find interesting, to capitalize on your strengths, and to learn something while you’re there.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "The only way to have experience is to get experience. And the only way to do that is to take a position that will give you the freedom to gain experience (doing something you like) in the first place.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Often, that kind of job isn’t at a big cushy company or even a well-managed one. Instead, it’s in a lesser-known organization working a less-straightforward and often lesser-paying gig that might not pan out. Doing (creative) things that might not work. Where there’s room to learn from your mistakes and gain (invaluable) experience.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Alas, it might not be exactly the experience you’re looking for. But at very least it’ll give you exposure doing something you’re semi-interested in. And having had the experience will open up new opportunities that didn’t exist before.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "So that in hindsight, in five years or ten years, you won’t be stuck still trying to climb a corporate ladder in bureaucratic inflexible company. Or worse, still be trying to convince HR to give you a job with little to no experience. Instead, you’ll have had multiple experiences in a variety of positions. Jobs that exposed you to novel things. And that gave you the freedom to leverage your strengths while you took on new tasks and acquired new skills.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "As Daniel Pink brilliantly puts it in",
          "marks": []
        },
        {
          "_type": "span",
          "text": "The Adventures of Johnny Bunko",
          "marks": [
            "link-0"
          ]
        },
        {
          "_type": "span",
          "text": ", (a book I can't recommend enough):",
          "marks": []
        }
      ],
      "markDefs": [
        {
          "_key": "link-0",
          "_type": "link",
          "href": "https://www.amazon.com/Adventures-Johnny-Bunko-Career-Guide/dp/1594482918"
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "“There is no plan. What it means is that you can’t sit there at age 21—or even 31 or 41 or 51—and map it all out…it never works that way. Life isn’t an algebra problem. Actually, it’s like an algebra problem painted by Salvador Dali. X might lead to W and W might lead to the color blue, and the color blue might lead to a chicken quesadilla.”",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "You can’t connect the dots in foresight. Life doesn’t work that way.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "All you can do is do interesting things that are an experience in themselves.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Interesting jobs that might (not) work.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "After all, a career-plan is a compass, not a roadmap.",
          "marks": []
        }
      ]
    }
  ]
}