{
  "title": "148863086.all Possible Conclusions",
  "slug": "148863086all-possible-conclusions",
  "publishedAt": "2025-11-30T19:29:55.777Z",
  "excerpt": "People aren’t very good at coping with uncertainty.",
  "image": "",
  "readTime": "3 min",
  "content": [
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "People aren’t very good at coping with uncertainty.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Which is why we’re often so ready to come up with narratives about why things happened based on inaccurate and/or incomplete beliefs.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Consider, for example, a few reasons why someone (an acquaintance, a friend, a client) may not have responded to a message (email, text, call, etc.):",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "- They don’t care enough to get back to you. - They’re feeling lazy today. - They’re busy. - They get so many messages from other people that they hardly have time to get back to you. - They decided talking to you isn’t worth their time. - They didn’t see your message. - They saw your message and forgot to message you back. - They forgot to message you back and then forgot you messaged them. - Somehow they lost your message (and forgot you messaged them). - They’re not interested in talking to you for whatever reason. - They don’t like you, because: a) You haven’t messaged them ever. b) You didn’t respond to their last message. c) It’s been over a year since you last talked. d) They think you’re a douche. e) You're unlikeable. - They’re having a bad day. - They’re having a great day (and don’t want you to spoil it). - Life is unkind to you and seemingly random, negative things like this happen to you all the time.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Not saying it’s impossible, but it’s extremely rare (and exhausting) for people to assess all the possible conclusions on the fly for every ambiguous interaction or event that they encounter. Which is why in the vast majority of cases, we tend to default to one (as if by random) for every specific event we experience (and, often, stick to those conclusions for life).",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "And that’s a shame. Because while we might be right some of the time, we could be",
          "marks": []
        },
        {
          "_type": "span",
          "text": "very",
          "marks": []
        },
        {
          "_type": "span",
          "text": "wrong a lot of the time. In fact, the chances that we’ll choose the right narrative 100% of the time—for every ambiguous event in our life—is incredibly low. (I trust you don’t need me to site from a scientific journal to determine this.) Moreover, given the law of probability (and the fact that there could be dozens of explanations for the events of our lives), it’s hard to reason that your explanation of how the world works even closely resembles an accurate depiction of reality.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Suffice to say, you could be wrong. And, if you don’t regularly test your conclusions, you could, in fact, stay wrong for a very long time.",
          "marks": []
        }
      ]
    }
  ]
}