{
  "title": "148861910.on The Values Of Smartphone Etiquette",
  "slug": "148861910on-the-values-of-smartphone-etiquette",
  "publishedAt": "2025-11-30T19:29:40.140Z",
  "excerpt": "We live in a world dominated by technology. We have these devices in our pockets and purses within arms reach practically 24/7, always on, always buzzing. An always open gateway to distraction, to ent",
  "image": "",
  "readTime": "3 min",
  "content": [
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "We live in a world dominated by technology. We have these devices in our pockets and purses within arms reach practically 24/7, always on, always buzzing. An always open gateway to distraction, to entertainment, to \"supposed\" connection.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "And that's not going to change anytime soon.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Thing is, when you're always glancing at your smartphone, you're missing out on what's happening around you. What's happening, and what could happen if you only looked up.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "What opportunities have you missed because you were too interested in what was going on that screen? What might you have experienced? What might you have noticed in that moment of apparent boredom?",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "A connection, perhaps? A new thought? A insightful idea? Maybe you'll give the guy next to you a chance to actually say \"hi,\" and you'll meet your soul mate right there an then. Who knows what could happen!",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Point is, you'll never experience these things if you're too busy listening to MP3's or playing CandyCrush or sifting through your Facebook feed.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "There's a time and place for that and it's at home in your PJ's. Not here. Not in the line at Starbucks. Not at the break room when you're sitting two feet from your coworkers. And (certainly) not when you're out in the world (wherever you are) with your friends, family, or acquaintances.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "In my view, attention is the purest form of generosity you can give. And therefore, the suppression of that attention is a disservice to both yourself and others. You can't be open to the world around you and the serendipity of what might happen or what you might see unfold if you're always looking at your phone. And there's no way to show someone you genuinely care about their wellbeing and happiness if act like they don't exist.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "So when you are out in the world, please try to be social. Not social in the sense that you need to check what's going on on Facebook or SnapChat or Twitter or the like. But social in the sense that you pay attention to the world around you and stay open to what comes your way.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Maybe that means sitting quietly and bored while you watch your barista make your drink, experiencing the art of the craft and vibe of the person behind the bar. Maybe that's people watching at the mall, or sitting by yourself at the park. Taking it all in. Experiencing the world around you. And maybe that's just actually noticing the person in front of you and making an intentional effort to connect.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "I can't promise what comes. I can't promise you'll be more entertained than what might be going on your smartphone screen.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "But I can promise you'll experience something that will make it worth it.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "The world is a lot bigger and richer than mere pixels. But the only way you'll see it is if you're brave enough to look up.",
          "marks": []
        }
      ]
    }
  ]
}