{
  "title": "148864440.the Enemy Of Good",
  "slug": "148864440the-enemy-of-good",
  "publishedAt": "2025-11-30T19:30:16.014Z",
  "excerpt": "Best-selling authors who hire world-class copy-editors average one or two typos in each of their books.",
  "image": "",
  "readTime": "1 min",
  "content": [
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Best-selling authors who hire world-class copy-editors average one or two typos in each of their books.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "That means that J.K. Rowling, Stephen King, Malcolm Gladwell, and Bill Bryson have each amassed a few dozen in their actual printed books.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Here's the thing: no one cares.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "No one cares about the minutia because they're great writers. The stories they tell more than make up for the fact that there are errors in their work.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "The same could easily be said for a whole slew of other forms of writing, from famous and unknown writers, as well as dozens of other things that people are paid to create.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "No one cares that the lead oboist as slightly out of tune or if the designer chose a slightly off shade of blue. No one cares about these small slights because they’re overshadowed by the overall experience of the product.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "It’s easy to poke at writers because everyone knows how to write, and AI only makes it easier to catch someone's errors with ease. But it’s waste to think we’re better off by counting small and negligible errors when we'd better off highlighting the things that actually matter, like content, craft, concision, and grace.",
          "marks": []
        }
      ]
    }
  ]
}