{
  "title": "148861853.when Something Goes Wrong At Work",
  "slug": "148861853when-something-goes-wrong-at-work",
  "publishedAt": "2025-11-30T19:29:39.173Z",
  "excerpt": "It’s very tempting for any boss or manager to simply confront whomever they think is at fault, and find ways to blame and discipline them into supposedly not making that same mistake again.",
  "image": "",
  "readTime": "3 min",
  "content": [
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "It’s very tempting for any boss or manager to simply confront whomever they think is at fault, and find ways to blame and discipline them into supposedly not making that same mistake again.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Thing is, when an employee makes a mistake, it’s rarely because they deliberately are trying to get in trouble or do something stupid. So blaming your employees or coworkers generally only makes them resent you, and to your employees, it shows that, despite you hiring them because of their outstanding character, you truly don’t trust them to make smart decisions.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Some managers even go so far as to create systems to keep employees accountable for their “bad” behavior, whereby each employee is granted a set number of strikes and/or write-ups until they’re fired. This ironically only makes those employees resent you more, because what happens if you write them up and they don’t deserve it? What happens when there’s a miscommunication between members on the team and they get inappropriately blamed? It’s one thing to hold you accountable for misbehavior (yelling at a customer, regularly being late to work, not doing your job) but mistakes and miscommunication are completely different things. In addition, this also inadvertently creates a company culture where mistakes are things to be avoided at all costs, even if it means cutting corners, or throwing one’s coworkers under the bus. Alas, this isn’t a great system for any company that values “learning from our mistakes.”",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "A better alternative: Recognize the difference between misbehavior and a mistake. Employees should be disciplined for their misbehavior, not their mistakes. If it was, in fact, a mistake, recognize that everyone makes mistakes. Trust your employees enough to know that their not stupid and that their not deliberately trying to ruin your day. Rather than find ways to hold them accountable for what they did wrong, create a culture where it’s their responsibility to create solutions and find ways so that they can avoid making that same mistake in the future.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "In Ashlee Vance’s insightful",
          "marks": []
        },
        {
          "_type": "span",
          "text": "biography",
          "marks": [
            "link-0"
          ]
        },
        {
          "_type": "span",
          "text": "of Elon Musk, she points out again and again that Musk, albeit having a hot tempter to begin with, generally doesn’t lose it because his employees tell him something doesn’t perform the way it was supposed to, whether it be rockets or cars or software. What makes Musk flip shit, is when his employees come to him, tell him something went wrong, and",
          "marks": []
        },
        {
          "_type": "span",
          "text": "don’t",
          "marks": []
        },
        {
          "_type": "span",
          "text": "have a step-by-step solution to fix it, or avoid making that mistake again in the future, or come up with excuses as to why it can’t be done. This teaches Tesla and SpaceX employees respectively that when something goes wrong, it’s their own responsibility to create solutions to problems, as opposed to simply focusing on the problem and finding ways to blame or criticize other people (or machines) for what’s clearly not working.",
          "marks": []
        }
      ],
      "markDefs": [
        {
          "_key": "link-0",
          "_type": "link",
          "href": "https://www.amazon.com/Elon-Musk-SpaceX-Fantastic-Future/dp/0062301233/ref=sr_1_1?ie=UTF8&qid=1483716698&sr=8-1&keywords=elon+musk+tesla+spacex+and+the+quest+for+a+fantastic+future"
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Maybe, you too can adopt a similar policy. Trust your employees (hey, you hired them) enough to know that they’re smart people, capable of learning from their mistakes and avoiding them in the future. And rather than creating a system that holds them accountable for their missteps, empowers them to grow, to focus on solutions instead of problems, and to be held accountable for creating and implementing those solutions.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Sounds like a place I’d like to work at, don’t you?",
          "marks": []
        }
      ]
    }
  ]
}