{
  "title": "148862248.someday Is Not Today",
  "slug": "148862248someday-is-not-today",
  "publishedAt": "2025-11-30T19:29:44.537Z",
  "excerpt": "It’s entirely possible that someday someone will pay you to write or sing or draw or cook or code or edit photos. A day when other people will recognize the art you have to share with the world, and g",
  "image": "",
  "readTime": "2 min",
  "content": [
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "It’s entirely possible that someday someone will pay you to write or sing or draw or cook or code or edit photos. A day when other people will recognize the art you have to share with the world, and generously compensate you for it. A time when crowds of people cherish your unique gifts and imburse you for all your hard work.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "For most of us though, someday isn’t coming anytime soon. It might never come.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Which leaves us at a crossroads. If you might never become rich or famous or at very least well-know for your creative side-hustle, should you continue to do it?",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "I honestly don’t know.",
          "marks": []
        },
        {
          "_type": "span",
          "text": "\n",
          "marks": []
        },
        {
          "_type": "span",
          "text": "What I do know is: if you you give up now, you’ll never know if you could be that good. Good enough to get paid for it. Good enough to be sought out. Good enough to be remarkable.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "If you’re doing this solely for the money. Or approval, or the spotlight, or status, or likes or tweets or upvotes. Or raving fans or an album or a book deal or a crowdfund campaign. If you’re doing this for any of those things, you’ll probably give up long before any of those things come to fruition.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "A better option? Do it because you’re hungry. Do it because you can.",
          "marks": []
        }
      ]
    }
  ]
}