{
  "title": "148861917.lack Of Willpower Or Lack Of Energy",
  "slug": "148861917lack-of-willpower-or-lack-of-energy",
  "publishedAt": "2025-11-30T19:29:40.294Z",
  "excerpt": "I realized today that when we complain we lack the “willpower” or “motivation” to accomplish something, most of the time what we really lack is pure and simple energy.",
  "image": "",
  "readTime": "3 min",
  "content": [
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "I realized today that when we complain we lack the “willpower” or “motivation” to accomplish something, most of the time what we really lack is pure and simple energy.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Psychologist’s call it",
          "marks": []
        },
        {
          "_type": "span",
          "text": "ego-depletion",
          "marks": [
            "link-0"
          ]
        },
        {
          "_type": "span",
          "text": ". I call it not getting your beauty sleep, not taking a much-needed break from life, and generally not eating right, or keeping physically healthy.",
          "marks": []
        }
      ],
      "markDefs": [
        {
          "_key": "link-0",
          "_type": "link",
          "href": "https://en.wikipedia.org/wiki/Ego_depletion"
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Call it what you like, the point is you need energy to continue to do things that require energy, whether  that's a physical exercise or psychological one. It's not willpower or motivation that we lack when we choose Chinese take-out over a salad or a homemade meal, it's energy. Same rule applies for when we watch TV from 7 to 10 pm instead of reading (or writing) that book we always put off. Energy, or rather lack of energy, is the culprit.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "On the flip side, energy (and the habits that create it) is a force-multiplier, that is, a factor that dramatically increases the effectiveness (in this case, productivity) of an item (i.e. you).",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "That said, it’s amazing what getting a good night’s sleep will do for your energy levels and overall happiness. Same goes for exercising or eating healthy or meditating or taking a break out of your schedule.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "I know, it’s tempting to want to stay up late and watch late night TV, I get it. Most nights that’s (currently) what I want to do too. But it’s infinitely more rewarding to go to bed an hour earlier, get a full 7 hours in, and wake up refreshed and energized.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "I think the question we need to ask ourselves is, “is this helping?” Obviously, part of me wants to eat junk food and skip the gym and stay up late watching TV. But if I reflect on what’s most beneficial to my overall happiness and long-term goals, the obvious answer is that I have to live a lifestyle that continually replenishes my energy levels. Only then will I have the energy to continue to do the things I need to do to accomplish my long-term goals.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Don’t confuse lack of willpower with lack of energy. The first is a byproduct of bad-thinking (and planning) on your part; a failure to hold two opposing ideas in your mind at the same time. The second is a very real thing, indeed, and much more likely the cause of your inability to deny yourself chocolate cake or hit the gym or work on your side project.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Make time for you and the stuff that keeps you going. It’s worth it.",
          "marks": []
        }
      ]
    }
  ]
}