{
  "title": "148862596.emulating Anecdotes",
  "slug": "148862596emulating-anecdotes",
  "publishedAt": "2025-11-30T19:29:47.569Z",
  "excerpt": "There’s no shortage of people online who will tell you how they achieved success in their respective endeavors.",
  "image": "",
  "readTime": "2 min",
  "content": [
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "There’s no shortage of people online who will tell you how they achieved success in their respective endeavors.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Which means that, from what to eat or read or do with your surplus of time or money, there’s never been an easier time to learn their method.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "That if you can find someone who started from somewhere similar to where you are, who despite the odds stacked against them, adjusted their world to meet the demands of success, all you have to do is repeat their process.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Because then, there’s little doubt you",
          "marks": []
        },
        {
          "_type": "span",
          "text": "can",
          "marks": []
        },
        {
          "_type": "span",
          "text": "do it. You can’t hide by being ignorant of what’s worked for people with similar circumstances.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Instead, you’ll be forced to embrace the fact that outside of good timing, what seperates you from them are merely a consistent string of choices",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Steps they took, and steps they didn’t take.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "It’s a mistake to think we’re somehow not being true to ourselves by looking for solutions to our problems externally. By following in someone’s footsteps. Or imitating our heros.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Fortunately, none of us were born in a time and place where we had to start from nothing. Because, of course, the world we were born into is a microcosm of what came before it. Culture is nothing but layer after layer of progress made by those who came before; posterity emulating the success of it’s predecessors.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "So no, there’s no shame in capitalizing on a success story, or imitating people you admire.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "The sooner you can get over the idea that you’re somehow more original, creative, or secure by acting on blind intuition, the sooner you can start learning from and leveraging the abundance of solutions other people have to offer.",
          "marks": []
        }
      ]
    }
  ]
}