{
  "title": "148861815.on Working Overtime",
  "slug": "148861815on-working-overtime",
  "publishedAt": "2025-11-30T19:29:38.132Z",
  "excerpt": "My manager asked if I’d like to work overtime today. Given my currently hourly wage, that’s about $25 for an extra two hours of work.",
  "image": "",
  "readTime": "2 min",
  "content": [
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "My manager asked if I’d like to work overtime today. Given my currently hourly wage, that’s about $25 for an extra two hours of work.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "What a fascinating proposition.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "On the surface, it sounds like a good deal. A little extra money to spend wherever I choose.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "But frankly, it’s not.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "It’s not, because I can choose how much my time is worth, even if I’m not currently being paid for it. It’s not, because I can choose what I do with those additional two hours of my time. I can work on this blog or learn a new skill or do something that can-over time-significantly improve my job prospects and therefore increase my income.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "And it’s not, because I can decide today that I want to make $75,000 annually by 2025. And I can choose to work for two hours everyday (like it’s a job) so that by the time I’m 35 years old I’m making triple what I’m making now.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Yes, this requires you to work a little more on your time off. No, you can’t simply brush it off for a little overtime pay at your current job and/or to use that time to relax or socialize or search the internet.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "This is a job, one that you commit to by allotting time for it in your schedule and by not allowing yourself to do other things when you should be working.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "You alone get to decide how much your time is worth and what you do with it.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "You can spend that time spending money, and you can spend that time on making more money (at your current income). You can also spend it doing things that might significantly improve your future circumstances, as well as your ability to make more money in the future. Or you can spend that time napping or binge-watching tv.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "The choice is yours. Today and everyday.",
          "marks": []
        }
      ]
    }
  ]
}