{
  "title": "148861833.let Him Fail Hes Got His Whole Life To Learn How To Succeed",
  "slug": "148861833let-him-fail-hes-got-his-whole-life-to-learn-how-to-succeed",
  "publishedAt": "2025-11-30T19:29:38.538Z",
  "excerpt": "I’ve found that many parents feel that the entire point of parenting is to get all their kid’s duck’s in a row. They inform them on their worldview and beliefs. They teach them how to study (not a bad",
  "image": "",
  "readTime": "3 min",
  "content": [
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "I’ve found that many parents feel that the entire point of parenting is to get all their kid’s duck’s in a row. They inform them on their worldview and beliefs. They teach them how to study (not a bad thing) and tell them the most important thing on their to-do list is get straight A’s. And they set up rules. Lots and lots of rules. Who they can hang out with (or date), what they can eat and drink, what they can buy at the store, what extracurriculars they should engage in, and alas, what they can do with their leisure time. And then of course, who to marry, what career path is practical, where to live and what to do on weekends.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "It’s as if these parents think that if they just have their kid follow a premeditated",
          "marks": []
        },
        {
          "_type": "span",
          "text": "plan",
          "marks": [
            "link-0"
          ]
        },
        {
          "_type": "span",
          "text": "from the time they are 6 to when they are 36, everything will be perfect for their children and that their job’s as parents will be a unflawless brilliant success.",
          "marks": []
        }
      ],
      "markDefs": [
        {
          "_key": "link-0",
          "_type": "link",
          "href": "https://www.youtube.com/watch?v=kXFUqlI8vSo"
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "And yet. Parenting is about raising kids how to tackle the obstacles of life. You can’t teach a kid to learn from his mistakes if he isn’t making any. Successful parenting is not about making the perfect life for your kid, it’s about teaching him how to take risks and learn from his mistakes, and about setting goals on his terms, so that he can create a life that he enjoys, based on who he is and his values.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "I recall an experience when I was working at Teavana when a teenager (about 15) was about to purchase some tea and a tea maker for his girlfriend’s birthday. His Mom, however, was doing everything she could to get him to change his decision and get something cuter/cheaper/more traditional. Thing is, he’s not going to learn how to better understand what his girlfriend likes/or dislikes based on his mother’s opinion, that’s his responsibility. And his mom’s responsibility is to let him fail. So that he can learn about the world and about this girl and about himself. So that in ten years (or twenty), he’ll have the insight to know what a girl wants on her birthday, as opposed to so many men today who simply buy the same gift they would get their mothers.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Related: Ever notice who's sells the most",
          "marks": []
        },
        {
          "_type": "span",
          "text": "girl-scout cookies",
          "marks": [
            "link-0"
          ]
        },
        {
          "_type": "span",
          "text": "? It’s not the scouts. It’s their parents. Why’s that?",
          "marks": []
        }
      ],
      "markDefs": [
        {
          "_key": "link-0",
          "_type": "link",
          "href": "http://sethgodin.typepad.com/seths_blog/2014/03/girl-scout-cookies.html"
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "I think it’s time for parents and teachers to accept that their job is not to make the perfect life for their kids. It’s not about saying “If you follow this plan, everything will work out and you’’ll always be happy.” No, I think it’s about seeing the bigger picture. Inculcating a mindset that implicitly says “Look at this world, look at all the opportunities you have…you can do anything you want in life…start a business, become an expert, make something that changes people, become any person you want to be. So go fail. Do stuff that scares you. Learn something new about this world every single day you’re in it. Everything will be okay. I’ll always be here to support you if you need me.”",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "That’s how we raise more optimistic, resilient, open-minded, excited and engaged kids. Not by handing them a script to follow. But by giving them the freedom and the support they need to create their own path forward.\"",
          "marks": []
        }
      ]
    }
  ]
}