{
  "title": "148863034.top Heavy By Design",
  "slug": "148863034top-heavy-by-design",
  "publishedAt": "2025-11-30T19:29:55.009Z",
  "excerpt": "I got a standing desk for Christmas. It's amazing. I’m sitting standing here, typing this, fully upright with my Mac four feet off the ground (looking straight ahead at my second monitor). It’s real c",
  "image": "",
  "readTime": "1 min",
  "content": [
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "I got a standing desk for Christmas. It's amazing. I’m sitting standing here, typing this, fully upright with my Mac four feet off the ground (looking straight ahead at my second monitor). It’s real cool.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "It’s also top-heavy. Which means that every time I type a letter or move my mouse the whole desk shakes.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "It’s hard to discount how annoying this is. Because in addition to the shaking (and trying to compensate for the shaking), I’m now hesitant to put too much stuff on it (undermining the utility of having a desk).",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Any more books and office supplies and this thing is bound to shake even more. Or worse, topple over.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "There’s bound to be a business/design/life metaphor here…I’m just too distracted at the moment to pick it out.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Here’s a hint: if your foundation is lacking, how on earth are you going to continue to do what you do (and get bigger or better) without risk of crumbling or collapse?",
          "marks": []
        }
      ]
    }
  ]
}