{
  "title": "148864442.in Office Marketing",
  "slug": "148864442in-office-marketing",
  "publishedAt": "2025-11-30T19:30:16.037Z",
  "excerpt": "My dermatologist has an 80-foot HDTV perched on a wall of their waiting room. They use it to market their offerings and share information about their staff.",
  "image": "",
  "readTime": "2 min",
  "content": [
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "My dermatologist has an 80-foot HDTV perched on a wall of their waiting room. They use it to market their offerings and share information about their staff.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "It's a good idea. But I think it could be better.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "It's obvious that they want people to read the stuff that's on the screen. But people rarely, if ever, read text on televisions, mainly cause it's difficult to read from a distance and because the resolution's typically pretty poor.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "It's also obvious the text would be better put on their website and probably already is. (And if the goal is to prompt a conversion, be it following their social media feeds or inquiring about a service, then they really ought to be getting people online.)",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "So, instead of putting all the content on the screen, they could put just enough content on each slide to get people to want to learn more. Then they can place QR codes on each slide and around the office for different site pages (because if you’re anything like me, you’re too self-conscious to scan the code on the screen.)",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Now they have customers on their website. While waiting in their office. At the one and perhaps only time these people will have nothing better to do than learn more about their business.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "In a few minutes, they'll be talking to someone who can answer all their questions in real time. All they have to do is offer the right kind of content to get them to ask.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "They can cross-sell and upsell and provide more information about the service or the person. They can create a touchpoint that can lead to a deeper relationship with their brand.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "I'm all for outbound marketing, but consider this. If a TV on the wall can deliver brand messaging, and perhaps an invitation to something more, what else can businesses do to engage their customers without stealing too much attention?",
          "marks": []
        }
      ]
    }
  ]
}