{
  "title": "148862132.gratitude Crystals Are Far Better Than Whatevers On Sale At The Mall",
  "slug": "148862132gratitude-crystals-are-far-better-than-whatevers-on-sale-at-the-mall",
  "publishedAt": "2025-11-30T19:29:43.595Z",
  "excerpt": "Go to a your local high-end shopping mall, sit down at the cafe, order an overpriced latte, and notice the people around you. 9 times out of 10 you’ll find that you’re surrounded by wretchedly unhappy",
  "image": "",
  "readTime": "1 min",
  "content": [
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Go to a your local high-end shopping mall, sit down at the cafe, order an overpriced latte, and notice the people around you. 9 times out of 10 you’ll find that you’re surrounded by wretchedly unhappy and despondent people. How can people so wealthy be so joyless?",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "I think the answer lies in the abject self-belittling of comparison. We go the mall because generally we’re bored with our lives and need entertainment. And so we go and look around and discover what we don’t have. How more things can make us happier, and how other people are (apparently) living lives so much better than our own. If we’re willing to go into a little bit of debt, we can have those things too.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "If comparing yourself to other people makes you miserable, don’t do it. Don’t engage with it. Avoid the mall and the latte and social media and all manner of stimuli that contribute to FOMO.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Do something better with your time and attention. Appreciate what you have. Create something of value you can share with the world. Do something that actually makes you happy. Immerse yourself in a culture of gratitude and giving instead.",
          "marks": []
        }
      ]
    }
  ]
}