{
  "title": "148863194.the New Normal",
  "slug": "148863194the-new-normal",
  "publishedAt": "2025-11-30T19:29:58.810Z",
  "excerpt": "If normal is defined as \"how we do things around here,\" the new normal must be \"how we go back to doing things.\"",
  "image": "",
  "readTime": "2 min",
  "content": [
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "If normal is defined as \"how we do things around here,\" the",
          "marks": []
        },
        {
          "_type": "span",
          "text": "new",
          "marks": []
        },
        {
          "_type": "span",
          "text": "normal must be \"how we go back to doing things.\"",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "If we choose to continue to wear masks in public (even when six months ago it was unusual), then that will set the standard for how we do things moving forward.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "And if most of the organizations that have transitioned to working remotely continue to do so (",
          "marks": []
        },
        {
          "_type": "span",
          "text": "not likely",
          "marks": []
        },
        {
          "_type": "span",
          "text": "), our culture will be forced to transition along with it.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "The point is, culture is a choice. Whether we choose to prepare for and offset the effects of the next epidemic, socio-economical tragedy, or environmental disaster is up to us. Our individual actions to some degree, but mostly our collective ones.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Whether we choose to allow things to go back to normal—how things have always been done—or proactively choose something new and different and better will likely be the defining junction in our generation.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Because given a long enough time frame, the next widespread challenge will arrive in a blink of an eye, and the degree to which we’ll be ready for it will come down to what’s normal then (not what’s normal after the fact).",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "What we do today defines who we’ll be tomorrow. Add up enough days and you get who we end up. We are the sum of what we repeat.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Think about that the next time you find yourself wary of resetting your expectations, adjusting to temporary discomfort, or too eager to defend the status quo.",
          "marks": []
        }
      ]
    }
  ]
}