{
  "title": "148861903.on Filtering Positive Vs Negative Feedback",
  "slug": "148861903on-filtering-positive-vs-negative-feedback",
  "publishedAt": "2025-11-30T19:29:39.890Z",
  "excerpt": "In her book, Mindset , Carol Dweck talks about the difference between praising kids accomplishments based on their innate abilities or talents (like saying “Susie, great job on getting an A+ on your m",
  "image": "",
  "readTime": "3 min",
  "content": [
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "In her book,",
          "marks": []
        },
        {
          "_type": "span",
          "text": "Mindset",
          "marks": [
            "link-0"
          ]
        },
        {
          "_type": "span",
          "text": ", Carol Dweck talks about the difference between praising kids accomplishments based on their innate abilities or talents (like saying “Susie, great job on getting an A+ on your math test, you’re so smart.”) vs praising the effort that went in to achieving those accomplishments (such as “Susie, I’m really proud of you for studying so hard for your math test, great job.”)",
          "marks": []
        }
      ],
      "markDefs": [
        {
          "_key": "link-0",
          "_type": "link",
          "href": "http://www.amazon.com/Mindset-The-New-Psychology-Success/dp/0345472322"
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "When we internalize compliments and praise based on our supposed innate ability, Dweck argues, although it can feel good in the short term, it can be dangerous to our self-esteem and overall ability later on. If Susie gets a D on her next math test because she didn’t study as hard, she might inappropriately assume she failed because of her ability at math rather than the fact that she simply needs to study more.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "As adults, of course, we can choose what kinds of praise we internalize from our peers. We can appreciate the fact that we did a fantastic job on a project because we put in the long hours to get it done on time, while going above and beyond the requirements. Or we can accept the apparent truth that, as our boss says, you’re the “smartest, most creative person in the company.”",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "It certainly feels nice to think we’re the smartest person in the room. But what about when we’re not. What happens when we fail or fall short and internalize that failure as a byproduct of our inability, rather than the result of the effort or tactics we put in to the project. Furthermore, what happens when your peers take notice? Should you internalize the notion that you “suck at this” and that “maybe you should consider doing something else with your time” because your boss says so, or your coworkers, or your teachers or friends or the people making the comments online?",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Brene Brown writes it her latest book,",
          "marks": []
        },
        {
          "_type": "span",
          "text": "Rising Strong",
          "marks": [
            "link-0"
          ]
        },
        {
          "_type": "span",
          "text": ", that because we have a tendency to disconnect entirely from our peers when we choose to simply not care what other people think, and because internalizing every message from our peers is a recipe for disaster, it’s extremely important to be selective about the feedback we take in from our peers. Alas, I think the same principle Carol Dweck recommends for filtering out positive vs. negative praise can be used to filter out constructive versus destructive criticism.",
          "marks": []
        }
      ],
      "markDefs": [
        {
          "_key": "link-0",
          "_type": "link",
          "href": "http://www.amazon.com/Rising-Strong-Brené-Brown/dp/0812995821/ref=sr_1_1?s=books&ie=UTF8&qid=1457109029&sr=1-1&keywords=rising+strong"
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "If the feedback is attacking you, the person, or your abilities rather than the effort you put in, don’t buy it. Don’t accept it. Don’t gurgitate it. But if it’s actually about the work, about the effort or tactics or strategy you used, consider it and reflect on it. If that person is a real peer, doing the same or similar work that you are, if their in “the arena,” as Brene says, then I think it’s appropriate to excogitate their feedback.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "I think that if the underlying intention is to challenge you and make your work better, rather than to attack you or your work, then it’s probably worth mulling over. If not, don’t even acknowledge the comments.",
          "marks": []
        }
      ]
    }
  ]
}