{
  "title": "148862977.if You Dont Understand It",
  "slug": "148862977if-you-dont-understand-it",
  "publishedAt": "2025-11-30T19:29:54.064Z",
  "excerpt": "...why would you buy it?",
  "image": "",
  "readTime": "3 min",
  "content": [
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "...why would you buy it?",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "When you buy something on Amazon (or pretty much any other retail store) you generally have a good idea of what it is your buying, how to use it, and what its benefits are.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "But in B2B transactions, it's different. Because instead of articulating what's on offer--what people are really paying for--business professionals (and the copywriters who work for them) like to use complicated language. That is, they like to bend and stretch words to make their services appear more complex or comprehensive than what they actually are (because added complexity gives the impression that it's a better value).",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Consider some copy I recently found on a B2B service page:",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "“",
          "marks": []
        },
        {
          "_type": "span",
          "text": "Our innovative service has the ability to help businesses dynamically aggregate, rank, compare, and map countless preloaded attributes. You can then upload your own proprietary data that can be analyzed on-demand.",
          "marks": []
        },
        {
          "_type": "span",
          "text": "”",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "I have little doubt that the people working with this organization don't have a clue what this service actually is (how could they?). I'm sure they have a vague idea (which is generally enough to get them to buy), but that's a far cry from explicitly knowing what it is they're paying for.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Or consider this listical from a prominent consultancy:",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "\"",
          "marks": []
        },
        {
          "_type": "span",
          "text": "RPO is an all-inclusive recruiting solution. Our experienced recruiters will assume ownership of your entire recruitment process, and assume responsibility for every aspect of it, including: - Identifying & Planning hiring needs - Job Posting & Searching - Identifying viable candidates - Recruiting A-level candidates - Screening & Interviewing - Offering of Employment - Hiring & On-boarding",
          "marks": []
        },
        {
          "_type": "span",
          "text": "\"",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "While the words themselves are fairly straightforward, creating a list doesn't expressly communicate what those services actually are. Lists are easy to hide behind, because it allows organizations to create a roster of their services or their benefits instead of clearly communicating (and demonstrating) what it is they are providing.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Point is, businesses should approach B2B transactions the same as they do with consumer transactions. You wouldn't fork over $40K to go to a college you didn't visit, or buy an automobile without knowing all it's specs, so why treat your B2B dealings any different? If you don't understand it, don't buy it until you do.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "It might take a few hours on the phone with the sales guy (or his boss) rather than reading off a company website or brochure. But seeking that clarify is certainly worth it if you can get to the point where you and your team definitively understand what you're getting (and what you're getting yourself into) before you decide to buy.",
          "marks": []
        }
      ]
    }
  ]
}