{
  "title": "148862606.weak Knees",
  "slug": "148862606weak-knees",
  "publishedAt": "2025-11-30T19:29:47.840Z",
  "excerpt": "A patient goes to see his doctor because his knee is hurting. The doctor says “Looks like there’s something wrong with your knee…must be inflamation. Take a pill twice a day for 14 days. Pain should s",
  "image": "",
  "readTime": "2 min",
  "content": [
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "A patient goes to see his doctor because his knee is hurting. The doctor says “Looks like there’s something wrong with your knee…must be inflamation. Take a pill twice a day for 14 days. Pain should subside in a week.”",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "The patient comes back two weeks later. The pain’s still there. The doctor says, “See a physical therapist upstairs and if it doesn’t work out, come back in and I’ll give you a steroid injection.”",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Physical therapist looks the patient over, does some quick tests, and says:",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "“Looks like there’s something wrong with your knee…you’ve got weak knees (literally). You have flat feet, your standing wrong, it’s causing strain.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "“Squat for me. Seriously..that’s far as you can go? For your age, you ought to be able to go lower. Look at me—I’m twice your age. Here are some exercises you can twice a day for the next 14 days. Try them out for me. Feel uncomfortable? Good, they should…that’s a sign you’re making progress.”",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "“Get some shoes with arch support. No more flat shoes. You should walk more (15 minutes or more everyday). And consider getting a standing desk. Hey maybe you’ll drop a few pounds. You’re goal is to be healthy right? No more pain? So put in the work and in a month you’ll start to see some progress. You can do this. I believe in you.”",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Sound similar?",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "If you have a problem, it’s probably because you’re doing something wrong. You might, in fact, have been doing that something for a long time. So long that it’s a normal routine, a habit, one that’s difficult to replace.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "One option is to seek the magical pill. To adopt the latest fad (diet, productivity secret, ideology or otherwise). To erase the symptoms but reject immunity.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "The other method is to embrace the idea that what you’re doing (or not doing) is a form of self-sabotage. To uncover what you’re doing wrong, and persist in the long process of making it better.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Certainly pills will eliminate your symptoms, but they don’t change anything.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "What does?",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Exercise (literal and figuarative). Long-term commitment. The inconvenience of inculcating the new normal.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Whenever possible: Commit to a process, even if slow and steady. Change what's broken. Reject short term fixes.",
          "marks": []
        }
      ]
    }
  ]
}