{
  "title": "148861961.the Psychological Struggle Of Literal And Metaphorical Strength Training",
  "slug": "148861961the-psychological-struggle-of-literal-and-metaphorical-strength-training",
  "publishedAt": "2025-11-30T19:29:40.679Z",
  "excerpt": "Yesterday I signed a contract for a personal trainer at the local gym. It’s $200 a month for one twenty-five minute session every week for a year.",
  "image": "",
  "readTime": "3 min",
  "content": [
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Yesterday I signed a contract for a personal trainer at the local gym. It’s $200 a month for one twenty-five minute session every week for a year.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Yes, that’s essentially $1000 paid for 8 hours worth of time with an expert instructor.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Some of you, maybe even most of you probably think I’m stupid. Trust me when I say I’ve already had my share of the “opportunity cost speech.”",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Thing is, $1000 or $2000 is certainly worth better health. If I do the work and gain 10 pounds of lean muscle mass over the course of a year, that means I’ll be burning about 500 calories at rest per day by this time next year. That’s the equivalent of running 5 miles at my current pace.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Also, I truly think the more I pay, the more likely I am to take this seriously. If you’re only paying $10 a month for a standard gym membership, you’re not as likely to get up and do it if it’s not yet a habit as you’d be if you’re paying $200 a month.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Regardless of whether or not this was a bad decision on my part, that’s not what this post is about. Point is, I made a commitment yesterday to do this for the next 12 months. That’s what this post is about: commitment and discipline.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "3 weeks or 3 months or 6 months from now when I’m sore almost every day, it’s going to be a really bad time for me to consider quitting this project. If I choose to do this now, I do it until the end. That’s commitment.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "The act of repeatedly taking action regardless of how you feel or the consequences of such action is discipline. Discipline is what solidifies commitment and makes it real.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Seth",
          "marks": [
            "link-0"
          ]
        },
        {
          "_type": "span",
          "text": "says that discipline is obeying a rule you set for yourself when you are in a different mood than when you started it. I can’t think of a better definition than that.",
          "marks": []
        }
      ],
      "markDefs": [
        {
          "_key": "link-0",
          "_type": "link",
          "href": "http://sethgodin.typepad.com/seths_blog/2011/08/settingthealarm-234.html"
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "I’m writing this now mainly for myself (and for social accountability) so that I stay mindful of the fact that if I fail at this project I know it won’t be because I lacked knowledge or ability or guidance, but because I chose not to put in the work. It’ll be because somewhere along the way I decided that I didn’t want this as much as I do now, and gave up.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "It’s true you can do almost anything you set your mind to, but you also have to have the grit and discipline and persistence to see things through.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "And that’s an internal battle, not an external one.",
          "marks": []
        }
      ]
    }
  ]
}