{
  "title": "148862595.dubious Claims",
  "slug": "148862595dubious-claims",
  "publishedAt": "2025-11-30T19:29:47.470Z",
  "excerpt": "Almost all forms of antagonism (and the byproducts of it) start out as a conflict of interest, made in large part by the consistent and persistent opinions of those with the power to exercise their vo",
  "image": "",
  "readTime": "1 min",
  "content": [
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Almost all forms of antagonism (and the byproducts of it) start out as a conflict of interest, made in large part by the consistent and persistent opinions of those with the power to exercise their voice.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Whether the differences are geographical, scientific, spiritual or political, pitting “us” versus “them” is perhaps the most direct route to animosity.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Of course, as we’ve seen time and again, scarcity-mindsets based on fear rarely hold up in light of the facts.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Is the earth flat? Is there a master race? Are vaccines dangerous for my child? Do we really need protection from the people on the outside?",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Not likely.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "More plausible: Human beings fear what they don’t know, what they don’t understand, and especially anything and everything that threatens their sense of self, of belonging, and of experiencing the world as they see it.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Without a doubt, fear is not fact. Discerning the difference is a mark of intellectual maturity. Confusing the two is a disservice to the world you were born into.",
          "marks": []
        }
      ]
    }
  ]
}