{
  "title": "148861851.have Less Enjoy More",
  "slug": "148861851have-less-enjoy-more",
  "publishedAt": "2025-11-30T19:29:39.118Z",
  "excerpt": "After having had jobs at some really neat companies, I realized recently that I for the most part have had an abundance of free and or much discounted experiences that most people pay a premium for.",
  "image": "",
  "readTime": "4 min",
  "content": [
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "After having had jobs at some really neat companies, I realized recently that I for the most part have had an abundance of free and or much discounted experiences that most people pay a premium for.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "I’m talking free drinks and coffee (I get a free pound every week) at Starbucks. Free tea at Teavana (some varieties are upwards of $25 per 2 ounces). Free-to-enter access to all Disney World Parks and Resorts for 7 months. And more recently, 30% everything (and basically free produce) at MOM’s, by far the best (and probably most expensive) organic market on the east coast. I’ve also had free access to Spotify Premium for the past 2 years thanks to Starbucks.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "People pay a high price for these products and experiences, and I’d like to say that I’m more than grateful for these outstanding benefits. But something I’ve recognized is that, over time, inevitably, we lose interest, we take things for granted, and then we go on searching for the next thing that we think will make us happy.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "But of course, whether it be a new car, house, or computer, an abundance of clothes or the latest iPhone, these things don’t make us permanently happy. We’re always in a state of flux, always changing. Our preferences and tastes and what we like and don’t like are always in a state of transience. And so, if our method for getting the most happiness out of life is to ceaselessly buy into consumer culture, we inevitably fail. Because no product or experience can make you happy indefinitely.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Prolongled abundance is the enemy of appreciation and therefore happiness. Once something is freely available to you over an extended period of time, you start to adapt to it, valuing it less and less. When I started at all these jobs, these “free” things made the gig seem like the best thing in the world, but 6 months later, they didn’t create the same feeling. Believe it or not there was a time at about month 4 of my Disney internship that I lost all interest in going to the parks.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "You too might find yourself in a similar predicament. Think about how many times you’ve been to Starbucks (or the mall, or the spa, or the fairway) in the past month? How many of those times did you really really enjoy being there, or your literal or metaphorical beverage.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "A simple solution that I’ve found to our insatiable desire for more is ironically to pursue less. Limit your",
          "marks": []
        },
        {
          "_type": "span",
          "text": "serving size",
          "marks": [
            "link-0"
          ]
        },
        {
          "_type": "span",
          "text": ". Possess what is absolutely most essential to get by, to stay healthy, to do your work and give the rest away. And also, find ways to build up anticipation for the small, simple things that could dramatically increase your happiness if you choose to view them as treats as opposed to day-to-day experiences.",
          "marks": []
        }
      ],
      "markDefs": [
        {
          "_key": "link-0",
          "_type": "link",
          "href": "http://sethgodin.typepad.com/seths_blog/2015/09/serving-size.html"
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Maybe your could (and should) use “Starbucks” as a treat. Go once a month and give yourself enough time to anticipate it. That way when you do go you’ll actually enjoy your visit as opposed to you just being there out of routine.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "This same concept can apply to just about any purchase or experience. Listening to music? Pick a great album, make it a treat, listen to audiobooks and podcasts instead. Shopping at the mall? One item, once per month (or two). Taking a vacation? Go one week, once per year…go anywhere in the world, save your money and make it count.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Big purchases too. Maybe you should live well below your means. If you can afford a $50,000 car maybe you should consider buying a $20,000 car instead. Same rule applies to home buying. Whether it's a new car or a new house, if you buy the most expensive model, you’ll likely take it for granted in about a year or two, so why not buy a less expensive one that works, save yourself a boat load of money, and deliberately practice gratitude for what you do possess. That way, you’ll be just as happy (is a really there a quantifiable difference between the folks who buy the most expensive model from those that don’t?), and you’ll enjoy it far more when your friends invite your over to their expensive homes that cost twice as much.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Limiting your serving size is a simple solution to happiness. It doesn’t cost much, and it forces you to appreciate all the things that make your life great. Whether it’s the occasional cappuccino, back massage, tiny car, trip to Beijing, or your 380 square foot apartment. Have less, enjoy more.",
          "marks": []
        }
      ]
    }
  ]
}