{
  "title": "148862441.layers Of Progress",
  "slug": "148862441layers-of-progress",
  "publishedAt": "2025-11-30T19:29:46.123Z",
  "excerpt": "Headway tends to be a pretty slow process. It’s something you gradually develop, after all. Adding to it little by little. Day by day.",
  "image": "",
  "readTime": "2 min",
  "content": [
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Headway tends to be a pretty slow process. It’s something you gradually develop, after all. Adding to it little by little. Day by day.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "It’s the “block of marble” metaphor in reverse. Coat after coat of improvement; familiarity, new knowledge, and skill compounding over time.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "With that in mind, it’s tempting (and common) to assume that when people are several standard deviations away from where you are (in terms of progress) that they are simply wired that way.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "That there is something innate about how they navigate the world that makes it possible (or easy) for them to do something so incredibly difficult so astonishingly well.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "This is how we end up words like geniuses and prodiges and whiz kids.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "A contrary argument is that “extreme cases” are merely situations where people (average people) started early and arrived before everyone else.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Because it’s likely that the people who are better at something than you are (by a factor of 2 or 3 or 10) simply started doing it way before you did. It’s also possible they have (or had) a faster pace (and thus learn more each day, doubling or tripling or decupling your progress).",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Thinking about progress in terms of time and pace (when the layering began and the speed of each coating) can help you discern between raw talent and people who are merely a lot farther ahead of the learning curve than you are (but no more talented).",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "What you’ll find is that most people actually fall in the the latter category. Whether that’s because they had the help of parent or coach, because they have a bigger, better network of help,  because they got a better education or simply because they started significantly earlier than you did, is all apart of that equation, but it’s",
          "marks": []
        },
        {
          "_type": "span",
          "text": "not",
          "marks": []
        },
        {
          "_type": "span",
          "text": "because the were simply born with the right combination of genes.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "It turns out that in most cases, learning to be",
          "marks": []
        },
        {
          "_type": "span",
          "text": "that good",
          "marks": []
        },
        {
          "_type": "span",
          "text": "isn’t so much a question of ‘do you have the potential to make it happen?’ as much as ‘when do you plan to start?’ and ‘how much progress can you make each day?’",
          "marks": []
        }
      ]
    }
  ]
}