{
  "title": "148862836.marketing Starts With Good Assumptions",
  "slug": "148862836marketing-starts-with-good-assumptions",
  "publishedAt": "2025-11-30T19:29:50.991Z",
  "excerpt": "A recurring newsletter about CBD oil and its benefits somehow keeps getting through Google’s spam filter, finding its way to my (heavily screened and safeguarded) inbox.",
  "image": "",
  "readTime": "2 min",
  "content": [
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "A recurring newsletter about CBD oil and its benefits somehow keeps getting through Google’s spam filter, finding its way to my (heavily screened and safeguarded) inbox.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "The ‘unsubscribe’ button seems to be broken, so I politely asked if they’d stop sending me emails.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "They got back to me with, “we need to confirm that you want to unsubscribe.”",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Of course, why would you assume that I don't already know I want to? In fact, why would you assume I want your email to begin with?",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "When marketers say that ‘people don’t know what they want,’ it doesn’t mean that unsolicited messages are going to convince them otherwise. It means that when presented with novelty or an abundance of options (circumstances where there aren’t a lot of reference points to help you make a decision), many people find it difficult to choose.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Deciding on a pair of headphones out of a magic hat is difficult. Knowing you’d prefer a pair of Airpods to Grados to Beats is easier. But it doesn’t mean that sending an email blast for your can’s is going to do the trick.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Marketing that works starts with a basic assumption: that people know what they want (that they know what content they want to see and read and what types of emails they want to receive in their inbox). That if people don’t subscribe to begin with, it means they're not interested. End of story.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "One-hundred thousand impressions is nothing without relevance, permission, and trust. If your viewers aren’t explicitly opting-in, you’re just wasting your time.",
          "marks": []
        }
      ]
    }
  ]
}