{
  "title": "148863055.selfish Short Sighted Interest",
  "slug": "148863055selfish-short-sighted-interest",
  "publishedAt": "2025-11-30T19:29:55.468Z",
  "excerpt": "This post was originally going to be a rant about why people are only eager to help you if it somehow benefits them. Then I realized how that's not ludicrous behavior...it's completely natural.",
  "image": "",
  "readTime": "2 min",
  "content": [
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "This post was originally going to be a rant about why people are only eager to help you if it somehow benefits them. Then I realized how that's not ludicrous behavior...it's completely natural.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "People lead busy lives, and if them helping you doesn't serve them in any way, the best you can hope for them is that they ignore you.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Because to them, sharing their knowledge, their network, or their (limited) resources--for nothing in return--feels like a significant investment. One that's difficult to rationalize given the opportunity cost of",
          "marks": []
        },
        {
          "_type": "span",
          "text": "not",
          "marks": []
        },
        {
          "_type": "span",
          "text": "interacting with you.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "As a consequence, many people who use social media platforms (or who attend networking events) do so not to utilize these tools for real genuine connection, but rather to see how many likes and followers and (arbitrary) connections they can make by this time next year. Of course, that's not because people are naturally ungenerous or unfriendly, it's just that it's hard for people to pay it forward when they don't see how helping a stranger can benefit them long-term.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "This also explains the initial resistance for some people to starting blogs and vlogs and podcasts. Because unless you believe in some karmic force—that the seeds you sow today will somehow benefit you someday—it’s hard to commit to making something and sharing something for free, indefinitely.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "And that’s a shame. But it’s",
          "marks": []
        },
        {
          "_type": "span",
          "text": "not",
          "marks": []
        },
        {
          "_type": "span",
          "text": "because people are inherently lazy or selfish or stupid. It’s just they don’t yet see what's in it for them.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "All another way to say that if you’re in the business of selling something (an idea, a product, a belief system) and you're struggling, maybe you ought to take some time to sell your audience on the benefit of them engaging with you (or you engaging with them) in the first place.",
          "marks": []
        }
      ]
    }
  ]
}