{
  "title": "148863117.soap Sugar Bread And Water",
  "slug": "148863117soap-sugar-bread-and-water",
  "publishedAt": "2025-11-30T19:29:56.681Z",
  "excerpt": "I took a late night trip to Target yesterday, and witnessed the remnants of what I'm sure was a frenzy comparable to Black Friday.",
  "image": "",
  "readTime": "2 min",
  "content": [
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "I took a late night trip to Target yesterday, and witnessed the remnants of what I'm sure was a frenzy comparable to Black Friday.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Whole shelves vacant, with nothing left but damaged merchandise or half consumed Starbucks beverages.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "To my surprise, I found that (with the exception of soap and bottled water) bread, baking mixes, and candy were the among the most consumed items. Which struck me as a little odd, because not unlike nasty pathogens, these things aren't particularly good for you either. Apparently the best way to stay calm and healthy(?) amid a crisis is to put yourself in a sugar-induced food comma.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "And then there's the panicking, the undue stress, the anxiety that likely caused this mess. Frenetical thinking that probably caused more harm than good, because that's what panicking does--it causes you to make reckless decisions on the fly, often without much thought as to if those choices actually help you and those you care about.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Speeding on the freeway to get to your destination, navigating through a stampede of (potentially sick) people to grab a bar of soap, consuming sugar with reckless abandon...these things can cause just as much harm than any virus, and with a 3% mortality rate, probably even more so.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Of course, you'll never make that connection if you're so consumed in worrying about what might happen that you throw everything—your health, your happiness, your level-headedness—up and out the door.",
          "marks": []
        }
      ]
    }
  ]
}