{
  "title": "148861928.on How To Prove Youre Smart",
  "slug": "148861928on-how-to-prove-youre-smart",
  "publishedAt": "2025-11-30T19:29:40.611Z",
  "excerpt": "I think a very good measure of how smart someone is is their ability to formulate an opinion and defend it.",
  "image": "",
  "readTime": "3 min",
  "content": [
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "I think a very good measure of how smart someone is is their ability to formulate an opinion and defend it.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "If you’re able to share your views using the principles of reason and/or the scientific method, providing evidence where need be to support your beliefs, I’d argue you have all the education you need to make a difference in the world.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "That’s the whole point of education, isn’t it? To learn to think for ourselves. To formulate our own views and to know how to show (and tell) someone why we believe these things and for what reasons.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Not surprisingly, it’s also the intellectual component we value most in the post-industrial economy. In a world where information is free and accessible to everyone with a smartphone, the value you bring to your customers and your students and your peers isn’t so much about how much you know, it’s your ability to explain it in a way that makes sense and that resonates. What you bring to the table is your unique take on the world, and the original ideas you have that can make a huge impact on the people you work for and those you work with.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "As Keith Ferrazzi says in his book,",
          "marks": []
        },
        {
          "_type": "span",
          "text": "Never Eat Alone",
          "marks": []
        },
        {
          "_type": "span",
          "text": ":",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "blockquote",
      "children": [
        {
          "_type": "span",
          "text": "“A unique point of view is one of the only ways to ensure that today, tomorrow, and a year from now you’ll have a job. It used to be that two arms, two legs, and an MBA were a one-way ticket to the executive office. That’s barely the price of entry these days. In America’s information economy, we frame our competitive advantage in terms of knowledge and innovation. That means today’s market values creativity over mere competence and expertise over general knowledge. If what you do can be done by anyone, there will always be someone willing to do it for less. Witness all those jobs moving offshore to Bangladesh and Bangalore. The one thing no one has figured out how to outsource is the creation of ideas. You can’t replace people who day in and day out offer the kind of content or unique ways of thinking that promise their company an edge.”",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "The main argument of this post is this: the ability to opine one’s opinions and ideas is a highly valued skill in today’s interconnected information age. If you can pick up the habit of freely and consistently distributing your ideas, then over time you’ll create a habit of defending your views, consistently refining them, and creating new ideas by way of amalgamation. A worthwhile habit for anyone seeking a non-replicable edge over their coworkers or competition.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "That said, I can’t think of a better way of doing this, of continuously practicing the art of forming opinions and defending them than by writing a daily blog. Writing forces you to think concretely, and to refine your thinking in a way that makes sense to those reading it. What’s more, if you can write",
          "marks": []
        },
        {
          "_type": "span",
          "text": "and",
          "marks": []
        },
        {
          "_type": "span",
          "text": "publish non-anonymously, even better. That’ll force you to own up to your ideas, because you’re on the hook. Then, when you click “publish” you can tell yourself with integrity, “I wrote this and I believe in it,” as opposed to plagiarizing ideas or writing BS.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "There’s no better way to get your thinking clean and simple than to write what your thinking. Likewise, there's no better way of proving your smart than by writing about your views and defending them logically and coherently.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "It’s a difficult habit, but a rewarding one. I’m sure of it.",
          "marks": []
        }
      ]
    }
  ]
}