{
  "title": "148862052.you Dont Win At Musical Chairs By Getting Picked",
  "slug": "148862052you-dont-win-at-musical-chairs-by-getting-picked",
  "publishedAt": "2025-11-30T19:29:42.215Z",
  "excerpt": "It's a disgrace that kids these days, who have the leverage to connect with millions of people from the device in their pocket, have been misled into believing that the only way to make it big is to w",
  "image": "",
  "readTime": "2 min",
  "content": [
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "It's a disgrace that kids these days, who have the leverage to connect with millions of people from the device in their pocket, have been misled into believing that the only way to make it big is to win a competition.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "That the only way to an album, or a novel, in the age of crowdfunding is to get picked by a talent scout or a publisher. Or to be screened and selected by authority figures who's entire professional careers are meditated on their ability to enforce what's commonplace. Or to go head-to-head against other would-be professionals and win the popular vote of millions by proving they're \"the best.\"",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Thing is, Björk would never win American Idol. And if she did, I doubt the artist she'd have to become to win it would sound anything like the pioneering one that she is.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "J.K. Rowling got turned down by 12 publishers before Bloomsbury gave her a shot. And if she had taken the advice of any of them we probably wouldn't have the same story that many now consider one of the best children's-fantasy novels of all time.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "And Elon would never have made",
          "marks": []
        },
        {
          "_type": "span",
          "text": "this",
          "marks": [
            "link-0"
          ]
        },
        {
          "_type": "span",
          "text": "happen if he had pitched his idea to NASA. Instead, it took years of dedicated work by a team of engineers and upsetters with a (relatively) small budget and a massively audacious goal to make it happen.",
          "marks": []
        }
      ],
      "markDefs": [
        {
          "_key": "link-0",
          "_type": "link",
          "href": "http://money.cnn.com/video/technology/2018/02/07/whats-next-spacex.cnnmoney/index.html"
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Gatekeepers of all kinds rarely can predict the future with significant accuracy. They can't tell the next big thing with any more accuracy than you or I can. Many professionals are so far engrossed in the status quo they've become inoculated against anything too foreign or progressive from it.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "They can't think that even a small group of true fans would enjoy the art you (might) have to share with the world. Or imagine that you could possibly make a significant breakthrough with as much progress that's been already achieved. Or compose or write or make something that other people would pay for, if they, themselves, don't see a market for it.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "The fact is, they don't see the same world you and I do. So don't pin your hopes and dreams on a lottery, getting picked, or having a gatekeeper give you the keys to unlock your future.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "They can't predict your future any better than the latest shady soothsayer.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "When in doubt, pick yourself.",
          "marks": []
        }
      ]
    }
  ]
}