{
  "title": "148864135.how To Deal With Angry People",
  "slug": "148864135how-to-deal-with-angry-people",
  "publishedAt": "2025-11-30T19:30:13.346Z",
  "excerpt": "Something I learned after many years of customer and client-facing service jobs is that people tend to lose their cool when it’s hot outside.",
  "image": "",
  "readTime": "2 min",
  "content": [
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Something I learned after many years of customer and client-facing service jobs is that people tend to",
          "marks": []
        },
        {
          "_type": "span",
          "text": "lose their cool",
          "marks": [
            "link-0"
          ]
        },
        {
          "_type": "span",
          "text": "when it’s hot outside.",
          "marks": []
        }
      ],
      "markDefs": [
        {
          "_key": "link-0",
          "_type": "link",
          "href": "https://www.theguardian.com/science/brain-flapping/2015/jul/03/summer-hot-weather-anger-psychology"
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Fortunately, there are a few skills that tend to help diffuse those who are easily upset or distressed. Here’s a few I’ve found that tend to work in nearly every situation:",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "listItem": "number",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Stay cool. People normally aren’t upset about the actual problem as much as they are afraid that you won’t or can’t fix it. You can work around this by reassuring them that you’re on it and remaining calm, cool, and collected. (In fact, it’s sorta fun to see how calm you can be.)Don’t feel it? Try changing your body to change your mind; by slowing down your movements, taking a cool composure, and pausing frequently. This will not only help you relax but, often, help them chill out as well.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "listItem": "number",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "You can also calm a person down by asking them sincere questions. Ask them to explain their issue in detail and ask follow up questions to make sure you understand all the details.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "listItem": "number",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "If you do give bad news, explain it with a “because” justification…explain why things are the way they are, and avoid ambiguity.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "listItem": "number",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Unless their anger is misplaced, apologize, sincerely. Similarly, stay polite throughout the entire interaction to avoid escalation.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "listItem": "number",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Don’t take it personally if they lash out or get upset - in most contexts, it’s rarely about you anyways.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Remember, angry people (whether friends, family, colleagues, or customers) are an opportunity—your chance to learn from them and make things right.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Don’t waste it.",
          "marks": []
        }
      ]
    }
  ]
}