{
  "title": "148861900.on The Implications Of Living Better Off Than Frederick William Ii",
  "slug": "148861900on-the-implications-of-living-better-off-than-frederick-william-ii",
  "publishedAt": "2025-11-30T19:29:39.738Z",
  "excerpt": "If you're reading this, you have absolutely everything you need to live comfortably. You have a computer, a gateway to the web, a limitless collection of tools, resources, connections and knowledge. I",
  "image": "",
  "readTime": "5 min",
  "content": [
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "If you're reading this, you have absolutely everything you need to live comfortably. You have a computer, a gateway to the web, a limitless collection of tools, resources, connections and knowledge. I’m sure you have a smartphone too, clothes to wear to a job interview (or date), food in your pantry and fridge, a microwave (!), a comfy memory foam mattress, and a house with AC and heat included. If you’re lucky, you’ve got good wifi too, and you live close to a grocery store that has an abundance of chocolate, coffee and aspirin. And let’s not forget, you have a car, which regardless or make or model, allows you to travel long distances at a relatively cheap cost.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "With that in mind, I think we can all agree you have more stuff and are far better off than the last King of Prussia.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Thing is, we continue to work just about every day of our lives for more stuff. Instead of just being content with the amazing lifestyle modern day technology and living standards have afforded us, we go about chasing after the next best thing, (or things) which accumulate to determine our position in our unspoken of, yet still very real, materially-obsessed caste system of status.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Take the Apple watch, for example. Coming from a long time Apple fan, it’s a horrible piece of technology. Nothing works consistently, and it doesn’t do anything your phone doesn’t do any",
          "marks": []
        },
        {
          "_type": "span",
          "text": "easier",
          "marks": [
            "link-0"
          ]
        },
        {
          "_type": "span",
          "text": ". And yet, there are more people wearing Apple watches today than in the 6 months after it’s initial release. Why? Because Apple’s marketing is top notch, sure, but also because having a $800 or $10,000 watch that everyone knows sells for that price tells the people around you that you’re affluent and therefore smart, probably good at what you do, and most importantly, that you are at a higher level in our society than they are. Why else would you spend $10,000 for a crappy watch?",
          "marks": []
        }
      ],
      "markDefs": [
        {
          "_key": "link-0",
          "_type": "link",
          "href": "http://www.wsj.com/video/apple-watch-what-living-with-it-is-really-like/13DDE53D-4DF3-4EDD-A519-4B2E3CA4F11B.html"
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Another thing, cars. Assuming we’re not billionaires, most cars within our price range typically sell from anywhere from $10,000 to $100,000. Now I have no doubt that a sports utility",
          "marks": []
        },
        {
          "_type": "span",
          "text": "vehicle",
          "marks": [
            "link-0"
          ]
        },
        {
          "_type": "span",
          "text": "with falcon wings, a bioweapon defense mode, and a ludicrously fast accelerate rate wouldn’t be a nice thing to have. But given the opportunity cost of $100,000 or even $50,000, you can have all the things listed above and maintain a fun lifestyle well above your means for years if you learn how to spend wisely. In other words, if you don’t buy the sports car, you’re left with anywhere from $50,000 to $100,000 in savings which you can use to live content with a less expensive lifestyle with less stuff, but quite possibly just as much joy.",
          "marks": []
        }
      ],
      "markDefs": [
        {
          "_key": "link-0",
          "_type": "link",
          "href": "https://www.teslamotors.com/modelx"
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "This brings us to the idea that after we’re making a certain amount of money, just about everything we work for is for something we want, not necessarily something we need. And that concept has enormous implications, because after you’re making a certain level of income (say, $40,000 annually) it means that you have an incredible amount of control over your lifestyle, as well as what you choose to do with your time and what you choose to invest in/buy. If you stop buying into the idea that more money will make you more happy, and instead choose to live a lifestyle that allows you to save money as opposed to spending the majority of it, then you get to ask yourself what are you \"working\" for? If you not working to pay off your debt, or purchase a new car or house or vacation, what are you working for? More money? Or more joy?",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "The reality is, if you’re making $40,000 a year, you can buy a $10,000 used vehicle and still pay your rent and have wifi and cable and cook nice food and still have 24 hours of free time on weekends, if you’re willing to give up a lot of the things you think are needs but are really wants. That being, daily lattes at Starbucks, a big house, pricey furniture and possibly store-bought clothes (there’s nothing wrong with going to a thrift store in my opinion).",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "If you can live with that, then the question becomes, what are you going to do with all that money, and the time your saving by not working for more stuff? Are you going to spend it working more so you can buy more things you don’t need and then buy things to store them in? Or you are you going to spend time doing things that bring you joy, that make you a better, smarter, more healthy, less-stressed person, and give up the very narrow-minded dream of owning a sports car and a 6 bedroom house in the suburbs and a watch that costs more than a year’s worth of groceries.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "You can be wealthy, and spend your life working for things. Or you can live cheaply, learn to",
          "marks": []
        },
        {
          "_type": "span",
          "text": "spend wisely",
          "marks": [
            "link-0"
          ]
        },
        {
          "_type": "span",
          "text": "on the things you want, and save money and time for greater experiences.",
          "marks": []
        }
      ],
      "markDefs": [
        {
          "_key": "link-0",
          "_type": "link",
          "href": "http://www.amazon.com/Happy-Money-Science-Smarter-Spending/dp/1451665067/ref=tmm_hrd_swatch_0?_encoding=UTF8&qid=&sr="
        }
      ]
    }
  ]
}