{
  "title": "148862915.carpe Diem",
  "slug": "148862915carpe-diem",
  "publishedAt": "2025-11-30T19:29:53.357Z",
  "excerpt": "Yesterday I wrote about how most good things happen to us when we’re prepared to take advantage of them.",
  "image": "",
  "readTime": "2 min",
  "content": [
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Yesterday",
          "marks": [
            "link-0"
          ]
        },
        {
          "_type": "span",
          "text": "I wrote about how most good things happen to us when we’re prepared to take advantage of them.",
          "marks": []
        }
      ],
      "markDefs": [
        {
          "_key": "link-0",
          "_type": "link",
          "href": "https://blog.brendanbockes.com/dont-be-lazy-dont-be-idle/"
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Of course, recognizing those opportunities when they arise is as essential a prerequisite for taking advantage of them, as being",
          "marks": []
        },
        {
          "_type": "span",
          "text": "able",
          "marks": []
        },
        {
          "_type": "span",
          "text": "to do so when given the chance.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Too often, we assume that the assets, connections, and occurrences that we regularly encounter are infinite resources—that they’ll be available forever—when, in fact, they're as finite and transient as time itself.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "So instead of taking advantage of the opportunities we have (and even acknowledging that they",
          "marks": []
        },
        {
          "_type": "span",
          "text": "are",
          "marks": []
        },
        {
          "_type": "span",
          "text": "opportunities)—we so often squander them, waiting for a more opportune time, and finding ourselves shocked when the people and things in our lives move on.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "It’s all too easy to take things for granted. To pretend that change is contestable. Or to forget that possibility is a time-sensitive, condition-specific event.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Acknowledging that the the encounters we have today might be once-in-a-lifetime occurrences, and that the stuff we find so readily available might not be here tomorrow, is a great way to shake the conception of permanence.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Far better, though, is to give up the notion of continuance entirely, to jump at, and into, possibility well before you’re ready, and to regularly cultivate a sense of urgency, knowing full well the brevity of opportunity.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Certainly, good things do happen to those who wait, and who are prepared for lucky breaks (if and when they do happen). But, I’d argue, great things also happen to those who simply take advantage of the affordances that are",
          "marks": []
        },
        {
          "_type": "span",
          "text": "afforded",
          "marks": []
        },
        {
          "_type": "span",
          "text": "them. Who make their world bigger one day at a time, by recognizing the value of the people and things and events they are given.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Opportunities rarely last forever. Better to initiate today—when you have time—then to wait until you suddenly discover you have none left.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Time's up.",
          "marks": []
        }
      ]
    }
  ]
}