{
  "title": "148861814.on Working Away From The Office",
  "slug": "148861814on-working-away-from-the-office",
  "publishedAt": "2025-11-30T19:29:38.095Z",
  "excerpt": "It’s day two of blogging outside the office and I’m already beginning to wonder why I didn’t do this sooner. I used to write exclusively in my room, where albeit the comfort of my POÄNG chair from IKE",
  "image": "",
  "readTime": "2 min",
  "content": [
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "It’s day two of blogging outside the office and I’m already beginning to wonder why I didn’t do this sooner. I used to write exclusively in my room, where albeit the comfort of my POÄNG chair from IKEA and the quiet my space provides, it’s come to my attention it’s also a space burdened with distraction.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Hence I find myself here in the Starbucks on the fourth flour of the building adjacent to my work location, writing peacefully and peering down at all the moving cars and pedestrians below.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "It’s only now that I realized that having a space that’s physically separate from home where I can work in solitude does wonders for my productivity. It’s very similar to the benefit of physically going to the gym. Whether it be because of the social element of everyone else being there doing the same thing, or simply because the purpose of me being there is to exercise, I feel exponentially more motivated and focused while being there. The same holds true for working (whether it be writing blog posts or working on course work). Having a space where, at least in my mind, my intention for being there is to work, as opposed to sleep or read or socialize, helps me focus without the distraction of all the other things I can do…even things I might do otherwise on my computer while in my room.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Maybe the question to ask when we can’t stay focused on our current task isn’t how we can be more disciplined and/or focused. Maybe the question to ask is where can I go (that’s not where I am now) that can change my perspective.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Along similar lines, when you can, change variables, change conditions, change your environment, don’t force psychology unless absolutely necessary.",
          "marks": []
        }
      ]
    }
  ]
}