{
  "title": "148861828.on The Benefits Of Implementing A Daily Routine",
  "slug": "148861828on-the-benefits-of-implementing-a-daily-routine",
  "publishedAt": "2025-11-30T19:29:38.443Z",
  "excerpt": "On Wednesday, after realizing that waking up and not really having a plan to follow doesn’t really lend itself to helping you make much progress on your goals, I implemented a daily schedule/routine t",
  "image": "",
  "readTime": "2 min",
  "content": [
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "On Wednesday, after realizing that waking up and not really having a plan to follow doesn’t really lend itself to helping you make much progress on your goals, I implemented a daily schedule/routine to follow on my weekdays.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "In a nutshell, it tells me what I’m to be doing with my time for every hour of every day, 5 days a week.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Alas, three days in, I feel like I’ve made more consecutive progress towards my goals than I have in the past 3 months.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "In retrospect, it seems obvious: no goals, no plan, no execution, no progress. And yet, somehow for the past two decades of my life I seduced myself into thinking that if I just had good intentions, I’d consistently make good decisions, make time for my priorities, and build habits without a schedule.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Schedules work for a few reasons. They allow you to allot the necessary amount of time you need to do certain tasks (a trip to the gym and back is about 2 hours for me), so that you don’t feel rushed or run out of time. Likewise, they require you to decide before hand when and where you are to be at any given time (so that you know if you’re behind or ahead-of schedule). Schedules also force you to rely on commitment (not willpower) to get stuff done. If you decide a head of time what you are to be doing at any given point of time throughout your day (i.e., I’m going start working out at 9:00 am at the gym), and you’re committed to your following your schedule, you’ll stick to it regardless of how you feel in any given moment. In contrast, if you rely on your good intentions and sheer willpower to get yourself up in the morning for your optional morning workout, you might very well give in to your desire to sleep in. Lastly, schedules create routines (macro-habits) that, just like micro-habits, become easier to follow over time.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Schedules and routines work. But until you write them down, step by step, and implement them into your life, they’re just as up in the air as your intention to go the gym everyday. Thinking you can do it all without a map is a fools errand.",
          "marks": []
        }
      ]
    }
  ]
}