{
  "title": "148862323.writing In 2055",
  "slug": "148862323writing-in-2055",
  "publishedAt": "2025-11-30T19:29:44.692Z",
  "excerpt": "It occurred to me the other day that someday this form of communication might turn out as some outdated hobby in the near future, like playing a dulcian or cross-stitching.",
  "image": "",
  "readTime": "3 min",
  "content": [
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "It occurred to me the other day that someday this form of communication might turn out as some outdated hobby in the near future, like playing a",
          "marks": []
        },
        {
          "_type": "span",
          "text": "dulcian",
          "marks": [
            "link-0"
          ]
        },
        {
          "_type": "span",
          "text": "or cross-stitching.",
          "marks": []
        }
      ],
      "markDefs": [
        {
          "_key": "link-0",
          "_type": "link",
          "href": "https://www.youtube.com/watch?v=ovSpmpePMno"
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "It’s not a stretch to say that writing, making a name for yourself and getting paid for it, might soon be replaced with a wholly content-focused readership.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "One where people no longer search you online, no longer subscribe, or read your next book because they like what you’ve written before. Instead of following your work specifically, they’ll merely collect writing they find interesting, without a care about who wrote it—like most people on Pinterest. Come to think of it, they might not be reading at all, merely listening to a robot read it back to them as they sit in their driverless car.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "My guess is you’ve never thought much about the the person who stitched the embroidery on your shirts (let alone who sewed those shirts). And most people nowadays don’t care about the person who built their appliances, or furniture, or television—just the brand name.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Some people think this is already happening: that online publishing is turning content into a commodity, that",
          "marks": []
        },
        {
          "_type": "span",
          "text": "Medium",
          "marks": [
            "link-0"
          ]
        },
        {
          "_type": "span",
          "text": "is becoming a",
          "marks": []
        },
        {
          "_type": "span",
          "text": "content-monopoly.",
          "marks": [
            "link-1"
          ]
        }
      ],
      "markDefs": [
        {
          "_key": "link-0",
          "_type": "link",
          "href": "https://medium.com"
        },
        {
          "_key": "link-1",
          "_type": "link",
          "href": "https://medium.com/thought-pills/why-you-shouldn-t-blog-on-medium-e3fd8abafb06"
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "It makes sense: within a medium (pun intended) of so much choice, with so many quality signals, uniquely curated for you, it’s almost impossible to decide who or what is worthy of our attention, recognition or compensation. So rather than deciding on, subscribing to, and supporting the work of a few writers who we follow religiously, (most) people merely subscribe to the channel and collect articles they find interesting.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Of course, without endorsing the work of the person behind the scenes making the content, there’s no way for any one writer to make a name for herself. Which means that on an a platform like Medium, there’s no longer an easy route to convert organic readers into potentially loyal fans or paying customers.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "While the mechanics of this are beyond the scope of this post, the point I want to address is this: Does this mean that writers should stop posting free content? Does it mean that we should ditch platforms like Medium in exchange for charging a premium for exclusive-only content found only within the micro-mediums of our personal blogs? Perhaps most dramatic: if a day comes when it’s impossible to make money publishing your ideas, does that mean you should stop writing altogether?",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Or does it just mean that you’ll have to find another way to make a living. That this thing that you do is a hobby, which doesn’t mean it’s not invaluable, or worthy of your time or the effort you put in. It just means there’s not enough people willing to pay for it to make it a career.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "I have no doubt that any of the countless all-hands hobbyists of yesteryear, from cross-stitchers to dulcianist still find their art both rewarding and important. I have no doubt the world would be a less interesting place without their contribution. Indeed, I don’t believe that we, as writers, idea-seekers, or ruckus-makers, should ever consider giving up trying to change, sway or articulate our culture merely because we find we can’t get paid for it.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Affluence has always been a lousy impetus for making a difference.",
          "marks": []
        }
      ]
    }
  ]
}