{
  "title": "148862331.conjunction Crossroads",
  "slug": "148862331conjunction-crossroads",
  "publishedAt": "2025-11-30T19:29:44.854Z",
  "excerpt": "“I can’t do this,” versus “I can’t do this, now.”",
  "image": "",
  "readTime": "1 min",
  "content": [
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "“I can’t do this,” versus “I can’t do this, now.”",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "The former implies you can’t indefinitely. That you are the way you are and that nothing is going to change that. The latter, however, implies that with consistent effort and practice, you can change, learn and grow. Indeed, constraining your incompetence to the present implies that your circumstances are only a temporary setback.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "“I want a job doing this, but I don’t have a degree,” versus “I want to work in this space, and I don’t have a degree.”",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Put another way: “I want to have a good day, but it’s raining outside,” versus, “I want to have a great day, and it’s raining outside.”",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Similar to the horizonless “can’t,” “but” leaves no room for possibility. “And,” in contrast, discerns our goal from our circumstances, and makes room for the opportunity to apply new approaches.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Maybe you don’t need a diploma to land your dream job (just skills and a portfolio), and maybe you can have a good day irregardless of inclement weather.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "It’s amazing how a single word can alter a phrase, change our attitude, or alter an experience.",
          "marks": []
        }
      ]
    }
  ]
}