{
  "title": "148861836.whats Your Intention",
  "slug": "148861836whats-your-intention",
  "publishedAt": "2025-11-30T19:29:38.617Z",
  "excerpt": "I often find myself in situations where I have no idea what I’m doing or why. Bouts of anger come to mind. As do self-destructive habits. Self-sabotage. Bringing home bread, or ice cream or brownies w",
  "image": "",
  "readTime": "3 min",
  "content": [
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "I often find myself in situations where I have no idea what I’m doing or why. Bouts of anger come to mind. As do self-destructive habits. Self-sabotage. Bringing home bread, or ice cream or brownies when I’ve told myself I was going to start “eating healthy again” the following day. Wasting my time watching videos online or internet browsing or walking around the mall.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "I think a simple question to ask yourself, should you find yourself in a similar situation of not knowing is to consider: “what’s my intention?”",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Is your intention to get angry? To become flustered or enraged? Is it to continue doing this thing that makes you feel good in the short term, but suffer later? Is it to eat (or drink) whatever you want in excess, regardless of the amount of sugar entering your liver? Or is it to relax by binge-watching the internet, or ease your stress, or anxiety, or restlessness, by buying things you really don’t need?",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Or is your intention to simply be happy?",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Is your intention for doing this action supportive of your goals and of your values? Or are you merely doing it because you think it will make you happy as a result, when in fact it won’t. When you yell at someone (in your car) for driving inappropriately on the freeway, are you doing it because you genuinely think this action will make you happy? Is that even the goal? Or are you doing it out of habit? What about buying things or binge-eating or ? Certainly, one purchase is nice, as is the occasional treat, or watching one episode of your latest favorite show? But doing anything in excess is bound to cause more suffering, or at very least lethargy, than good. And again, does it really make you happy? What is your true intention for engaging in this behavior?",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Intention, by its definition, relates to the end-goal, the purpose of a thing or an action or a form of conduct. Alas, it’s helpful to know what that is, in every aspect and action of your life. Otherwise, you might find yourself in a position of not knowing why you’ve done something or are doing something in the first place, because you never knew your intention for doing it from the start.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Earl Nightingale said, “People with goals succeed because they know where they’re going.” Likewise, if you don’t know where you’re going, or",
          "marks": []
        },
        {
          "_type": "span",
          "text": "why",
          "marks": []
        },
        {
          "_type": "span",
          "text": "you’re going where you’re going (in every instance of your life), how can you possibly find what you seek?",
          "marks": []
        }
      ]
    }
  ]
}