{
  "title": "148861915.on The Impractical Use Of Fear Imagination Inaction",
  "slug": "148861915on-the-impractical-use-of-fear-imagination-inaction",
  "publishedAt": "2025-11-30T19:29:40.264Z",
  "excerpt": "Imagination is an amazing human ability, perhaps the most amazing, given that it allows us to not only create what does not yet exist but also look at how the world could be. But imagination also has ",
  "image": "",
  "readTime": "2 min",
  "content": [
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Imagination is an amazing human ability, perhaps the most amazing, given that it allows us to not only create what does not yet exist but also look at how the world could be. But imagination also has a dark side. Anytime you find yourself ruminating over events that haven’t yet happened, you’re experiencing imagination’s evil twin. One “what if?” question leads to another, and soon what might have been a survival strategy a millennia ago becomes a perverse technique in holding you back from facing your fears and doing what you’re capable of. And it’s precisely that sort of thinking (better defined as",
          "marks": []
        },
        {
          "_type": "span",
          "text": "worrying",
          "marks": [
            "link-0"
          ]
        },
        {
          "_type": "span",
          "text": ") that only serves to amplify fear and encourage inaction.",
          "marks": []
        }
      ],
      "markDefs": [
        {
          "_key": "link-0",
          "_type": "link",
          "href": "http://sethgodin.typepad.com/seths_blog/2012/07/risk-fear-and-worry.html"
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "No wonder so many of us play it safe.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Alas, there’s nothing enlightening about making your world smaller, and the fact is, the worst case scenario you’ve been rehearsing rarely comes to fruition. The fact is, most of the time, most of the things we avoid out of fear generally aren’t nearly as bad as we imagine them to be in our head. Oftentimes, reality is much more generous and pleasant than we expect.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "So how do we stop the downward spiral of fearful thinking?",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Try this: Accept your fear and the thinking behind it. Acknowledge that the worst case scenario you’ve adopted is probably drastically unrealistic. And take action asap before you start ruminating again.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "As Dale Carnegie said, \"Inaction breeds doubt and fear. Action breeds confidence and courage. If you want to conquer fear, do not sit at home and think about it. Go out and get busy.”",
          "marks": []
        }
      ]
    }
  ]
}