{
  "title": "148861849.sameness Pervades",
  "slug": "148861849sameness-pervades",
  "publishedAt": "2025-11-30T19:29:39.054Z",
  "excerpt": "Ever notice how just about every Chinese carryout place is the same. Same menu. Same store-front. Same service.",
  "image": "",
  "readTime": "3 min",
  "content": [
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Ever notice how just about every Chinese carryout place is the same. Same menu. Same store-front. Same service.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Or how coffee shops, as eclectic as hey might be in the aesthetics, never seem have any sort of original coffee beverage other the standard latte or americano with (maybe) a varying flavor of simple syrup. Or how those syrup flavors always seem to mimic popular ice cream flavors? Why vanilla? Why mocha? Why caramel?",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Maybe it’s because sameness sells. Because what’s popular doesn’t feel like a risk. When you’re a small company with a budget and you have to make a profit to pay rent, it seems like that safe choice is the only option you have.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "But is it? If you’re just like the place down the street (in any category), the only reason I have to do business with you is if you’re closer to my house. Obviously, leaving everything you do up to geography isn’t a a great business strategy.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "So why not do something original? Why not have an all-organic coffee shop (the coffee, the cream, the syrups), with the standard menu, and then a limited crowdsourced-based menu featuring espresso beverages created by your fans? Imagine how cool it would be if Starbucks your local coffee shop allowed their customers to vote on next week’s new latte/frappe beverage.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "And why not have a carry-out place that’s out-of-this world amazing? So good you have to tell your friends about it? So",
          "marks": []
        },
        {
          "_type": "span",
          "text": "remarkable",
          "marks": [
            "link-0"
          ]
        },
        {
          "_type": "span",
          "text": ", the marketing takes care of itself? You can keep the same aesthetic, but upgrade everything else. Good photographed items, a menu featuring both original and standard dishes that clearly articulate what each dish is and the ingredients used. Organic produce, grass-fed meat, paleo-friendly condiments (coconut aminos!). Maybe even a friendly staff in cocktail attire, who can clearly speak both Mandarin and English and maybe even Spanish. And music? Why not have really good speakers and really good music for the folks in the front who have to wait.",
          "marks": []
        }
      ],
      "markDefs": [
        {
          "_key": "link-0",
          "_type": "link",
          "href": "https://www.youtube.com/watch?v=V82OwyF_vBg"
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Obviously, these things are added costs. It’s not cheap to use only organic ingredients or to train your staff to be exemplar customer service agents, or have a well-designed website, or buy great speakers, or pay a photographer to take outstanding pics of your stuff. It’s especially true when you can rationalize not doing half these things and doing the rest yourself for free. But then again, if you’re not doing something that makes you remarkable, you’re leaving all your business up to chance: geography, time, four-square reviews, price. And you’ll be competing with other businesses that might be doing these things. Would you drive a few extra miles for a better menu, better service or a better experience? How about a remarkable experience?",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "My point here is this: if all your doing is being like the next guy, than you’ll quickly find yourself in a",
          "marks": []
        },
        {
          "_type": "span",
          "text": "race to the bottom",
          "marks": [
            "link-0"
          ]
        },
        {
          "_type": "span",
          "text": ", finding ways to compete with the market by cutting costs and by being ever cheaper than your competitors. And if you do that, you’ll never have enough money to switch directions, so that you can even begin to make your product or service better.",
          "marks": []
        }
      ],
      "markDefs": [
        {
          "_key": "link-0",
          "_type": "link",
          "href": "http://sethgodin.typepad.com/seths_blog/2005/04/race_for_the_to.html"
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Yes, being remarkable and original is a risky move. There are going to be short-term costs and sunk-costs. It’s going to be a wild ride. But I think it's worthy one. In my view, it's far better to risk being original than settle for banality.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Sure, sameness pervades. But it's only remarkability that succeeds.",
          "marks": []
        }
      ]
    }
  ]
}