{
  "title": "148862910.rebranding Holidays",
  "slug": "148862910rebranding-holidays",
  "publishedAt": "2025-11-30T19:29:53.216Z",
  "excerpt": "I define a holiday as a day set aside by a group of people to reflect, celebrate or commemorate an agreed upon event, activity or value.",
  "image": "",
  "readTime": "4 min",
  "content": [
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "I define a holiday as a day set aside by a group of people to reflect, celebrate or commemorate an agreed upon event, activity or value.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Yet, most of the holiday’s we celebrate in the States, while good intentioned, serve more as performances that we engage in to rehearse long-standing traditions than to commemorate a mutually established value. For the un-devout or non-partisan, our traditional holiday’s can seem superficial even, given our long antiquated rituals and socially-distorted conventions.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Isn’t it about time for a holiday rebrand? One where holidays exclusively focus on established principles and inculcate practices that encourage us to reflect on them? Holidays that encourage us to be our best selves and that empower us to live more meaningful, magical and connected lives?",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Here’s an updated calendar of holidays marked with intention:",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Creativity/Cultural Appreciation Day (Halloween)",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "What if we replaced all the dead and undying hoopla with a day for simply dressing up in whatever home-made costume you chose. A day to celebrate our unique human capacity for creativity, inventiveness and play. And to celebrate all the people and things and ideas that make our culture what it is.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "(Perhaps also a day to actually enjoy your favorite candy-bar without the guilt.)",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Gratitude Day (Thanksgiving)",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "The best of all holidays. A day to consider the magnanimity of our situation. Our surplus of time and money and resources and relationships and assets. About what it is to be alive at this point in our history. I say we ditch the colonial story, keep the feast, and begin to read (and participate in)",
          "marks": []
        },
        {
          "_type": "span",
          "text": "The Thanksgiving Reader",
          "marks": [
            "link-0"
          ]
        },
        {
          "_type": "span",
          "text": ".",
          "marks": []
        }
      ],
      "markDefs": [
        {
          "_key": "link-0",
          "_type": "link",
          "href": "https://thethanksgivingreader.com/"
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Generosity Day (Christmas)",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Surely we can think of something better to do to show the people we care about that we value them than going into debt to buy them material goods. Maybe we should consider giving away some of the things we think we need, to people who could benefit more from them, instead.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Reassessment Day (New Years)",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "A day to celebrate how far we've come, to reflect on where we are, and to think deeply about where we'd like to be headed. That said, it probably would be wise to at least consider how you plan on getting there, whether it's by resetting your habits, making SMART goals, or pondering 5-year master",
          "marks": []
        },
        {
          "_type": "span",
          "text": "plans",
          "marks": [
            "link-0"
          ]
        },
        {
          "_type": "span",
          "text": ".",
          "marks": []
        }
      ],
      "markDefs": [
        {
          "_key": "link-0",
          "_type": "link",
          "href": "https://blog.brendanbockes.com/the-poetry-of-self-invention/"
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Appreciation Day (Valentines)",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "I'm fine with a once a year day to celebrate your one and only, but maybe we could also consider extending those thoughts and actions to people outside our immediate circle. Telling your friends and family and colleagues how much you appreciate them is probably a lot more beneficial and rewarding than buying your boo a box of chocolates.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Connection Day (Independence Day)",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "The more cultures and backgrounds and points of view we have, the more ideas we'll have and the better our ideas will be. Likewise, the more diverse the people we come into contact with, the better off we'll be.",
          "marks": []
        },
        {
          "_type": "span",
          "text": "Connection day",
          "marks": [
            "link-0"
          ]
        },
        {
          "_type": "span",
          "text": "is a great way to acknowledge this, while celebrating what being an American really is all about: championing diversity in all its forms, and reminding ourselves of what a joy it is to exercise such freedom. Because connection is a privilege, not a right.",
          "marks": []
        }
      ],
      "markDefs": [
        {
          "_key": "link-0",
          "_type": "link",
          "href": "https://seths.blog/2019/07/connection-day/"
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Sprint Day (Labor Day)",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "The thing about sprinting is that you can't realistically do it everyday. Going all out takes a lot of energy, which is why having an annual day to do just that-to finish a long-standing project, or to ship a new one-can be a really great idea. Knowing that there's a beginning and a definite end, that you don't have to work like this everyday (just today), can be really empowering and probably give you just enough energy to power through.",
          "marks": []
        }
      ]
    }
  ]
}