{
  "title": "148861850.on What You Believe Mainstream Culture And The Power Of Falsifiable Curiosity",
  "slug": "148861850on-what-you-believe-mainstream-culture-and-the-power-of-falsifiable-curiosity",
  "publishedAt": "2025-11-30T19:29:39.092Z",
  "excerpt": "It occurred to me the other day how much power we give to authority figures over what we know to be true.",
  "image": "",
  "readTime": "4 min",
  "content": [
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "It occurred to me the other day how much power we give to authority figures over what we know to be true.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Consider this: how do you know the world is a sphere? Because hundreds if not thousands of people, your friends, family, teachers, politicians and strangers, all accept it to be true, and they’ve been telling you the same thing since your were six. How many of us have actually been to space to verify our own beliefs?",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "We do this to save time and effort, I’m sure. It’s far easier to listen to the weatherman than it is to have to step outside everyday and verify the temperature. But as efficient as it is, there is a danger here. The problem is when we allow too much of what we know to be the result of our external world’s collective thinking and reasoning.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "This, of course, is how everything from religion to politics work. We don’t believe what we do merely because we agree with the thinking behind it. It’s pretty easy to create a story that resonates and makes sense, especially if those stories involve myths and magic and miracles. Likewise, you don’t wake up one morning and decide to be a member of the Liberal Party of Canada, or decide that it’s okay to eat meatloaf, or decide to believe in monotheism. Culture (as defined by the collective rituals, beliefs, and practices of our tribe) is at work here. Ever notice how most of your “friends” share the same beliefs you do, until you go to college? It’s no coincidence.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Consider your worldview. Do you know for a fact your beliefs about this type of food (cricket chips?), or this group of people (Republicans?) or this behavior or belief (carnivorism?) is “bad”? Bad, of course, assumes duality, assumes there is such a thing as “good” and “bad.” It assumes there is such a thing as moral behavior in a world where the concept of morality is actually a man-made, localized and subjective concept.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Is cannabalism okay? What if you have the supposed victim’s consent to be eaten? Or what about eating chickens or cows? Is there a difference? Depending on where your from and who you hang out with, people’s beliefs about these things vary a great deal. It’s not so much that we wake up one morning and decide these things are bad or good, it’s that we become immersed in a culture of people that collectively make those decisions for us.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "And who decides the culture we immerse ourselves in? We do, of course. But if you’re not aware it’s your choice, it’s no different than if someone decided for you. Consider the media. Do you get to control what’s on tv, or what stories are aired? Or what email gets sent to your inbox? Or what gets taught in school? We don’t make these decisions. Our collective culture does. Our collective votes. Our collective consumer behavior. It’s not the people on the fringes of society that decide for us, it’s the people in the mainstream, the people who win our society’s figurative popularity contest. The people, who oftentimes, would sacrifice their own integrity just for more votes, or more attention or just to have a job that pays well. And so what we end up with, whether you’re in America or in Cairo or in Syria is a place where the dominant culture manipulates knowledge and beliefs and rituals to serve they’re own political or religious or economic agenda, allowing their own fears and prejudices to pervade and seep into their citizens culture, their own thinking and beliefs.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Obviously, changing the media and our culture in ways that allow us to disseminate information and knowledge about our world in ways that are more objective, more unbiased and more unfiltered is a good thing. So is filtering your email, not watching the news, and reading non-fiction books instead.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "But before you do, try this practice: Consider what you believe to be true about your world and your life. Then ask yourself: Is there something I can prove or demonstrate that would disprove this belief? That is, is there any way you can make your thinking",
          "marks": []
        },
        {
          "_type": "span",
          "text": "falsifiable",
          "marks": [
            "link-0"
          ]
        },
        {
          "_type": "span",
          "text": "? Then go out and observe the world and seek out answers to these questions. Ask yourself “why?” a thousand times. And be curious as to what the world has to show you. You might be right, you might be wrong. But either way you’ll come back well informed, more open-minded and certainly better off than if you simply take your world’s word for it.",
          "marks": []
        }
      ],
      "markDefs": [
        {
          "_key": "link-0",
          "_type": "link",
          "href": "http://sethgodin.typepad.com/seths_blog/2016/08/putting-falsifiability-to-work.html"
        }
      ]
    }
  ]
}