{
  "title": "148861976.perceived Attractiveness",
  "slug": "148861976perceived-attractiveness",
  "publishedAt": "2025-11-30T19:29:41.029Z",
  "excerpt": "I’ve recently been trying to update my wardrobe, mainly in an bad attempt to increase my perceived “attractiveness” to member’s of the opposite sex and partially boost my self-talk (i.e. “I’m the type",
  "image": "",
  "readTime": "2 min",
  "content": [
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "I’ve recently been trying to update my wardrobe, mainly in an bad attempt to increase my perceived “attractiveness” to member’s of the opposite sex and partially boost my self-talk (i.e. “I’m the type of guy who dresses like this”).",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "So I spent $200 on a Vince Camuto jacket (parents please don’t read this). Another $300 on new shoes (boots from Tawny Goods and 2 pairs of wingtips from Cole Haan) and $200 on two pairs of raw selvedge jeans from RPMWEST.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Thing is, I can think of at least twenty alternative things I can do to increase the amount of women in my life. And there are certainly better ways to increase self-confidence. All free, with the exception of a gym-membership and possible a meditation cushion.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Cheaper. Not easier.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "I think this is universal. We buy expensive material goods (clothes, a car, a fancy apartment, etc.) so that we’ll be better-liked or perceived a certain way, or to change our self-talk, when, in fact, it would be a hell of a lot cheaper to take actions that make us better-liked or better people in general.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Obviously, this doesn’t apply to everyone and everything. People don’t buy their dream homes just to be well-liked. But I think it’s always important to consider opportunity cost, and our primary intentions for buying things, especially things we don’t need.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "No, I don’t regret buying $700 worth of new threads, but I think it’s really important that I continue to balance this out with taking actions that bring me up, that align with my values, and that make me, in my view, valuable as both an individual and as a man. That way, my wardrobe isn’t some facade I’m using a conceal a less-than-confident true self, but rather an extension of who I am and what I value.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Side-note: It’s literally taken me a hour to get my thoughts out on this post, I know what I want to write but I don’t yet know how to word it in a way that’s clear and that gets my point across. Alas, it’s still being shared, because perfection isn’t the goal, publishing is.",
          "marks": []
        }
      ]
    }
  ]
}