{
  "title": "148863500.missing Out On Something 2",
  "slug": "148863500missing-out-on-something-2",
  "publishedAt": "2025-11-30T19:30:02.876Z",
  "excerpt": "Being a teetotaller, I’m frequently asked by friends why I don’t drink. After I give them my standard response (I don’t like consuming depressants), and after they reply with the usual “well good for ",
  "image": "",
  "readTime": "2 min",
  "content": [
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Being a teetotaller, I’m frequently asked by friends why I don’t drink. After I give them my standard response (I don’t like consuming depressants), and after they reply with the usual “well good for you!”, I’m sometimes asked, ‘…but aren’t you worried about missing out?’",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "My response—which I rarely get around to giving—is that,",
          "marks": []
        },
        {
          "_type": "span",
          "text": "of course I am.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Of course I’m concerned with missing out. Because it’s human nature, and because I am—for the most part—an experientialist. I like to try new things and I often think about all the things I haven’t yet experienced. We all do.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "The interesting thing is, the wine enthusiasts and social drinkers and beer hipsters and drunkards I know never consider all the things they might be missing out on",
          "marks": []
        },
        {
          "_type": "span",
          "text": "too",
          "marks": []
        },
        {
          "_type": "span",
          "text": ".",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Because you can’t do and try and experience",
          "marks": []
        },
        {
          "_type": "span",
          "text": "everything",
          "marks": []
        },
        {
          "_type": "span",
          "text": ". And choosing one choice over another means you’re missing out on another choice,",
          "marks": []
        },
        {
          "_type": "span",
          "text": "at all times.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "The people who ask me if I’m upset that I might miss out on booze or hootch or spirits rarely consider that they’re missing out on many other things they could be drinking (after all, there are hundreds of types of loose leaf teas, single-origin coffees, sodas, and alcohol-free mocktails). And they almost never think about all the things they could be doing with their money or time if they didn’t spend every weekend drinking.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Everyone",
          "marks": []
        },
        {
          "_type": "span",
          "text": "is missing out on something. All the time. What’s important is that you frequently find yourself doing, savoring, or experiencing what you",
          "marks": []
        },
        {
          "_type": "span",
          "text": "want",
          "marks": []
        },
        {
          "_type": "span",
          "text": "to be doing, savoring or experiencing, now that you know that you can’t",
          "marks": []
        },
        {
          "_type": "span",
          "text": "not",
          "marks": []
        },
        {
          "_type": "span",
          "text": "miss out.",
          "marks": []
        }
      ]
    }
  ]
}