{
  "title": "148862349.was It The Color Of My Tie",
  "slug": "148862349was-it-the-color-of-my-tie",
  "publishedAt": "2025-11-30T19:29:45.312Z",
  "excerpt": "When we get cut from the team, we never say it’s because of what we wore to try-outs.",
  "image": "",
  "readTime": "2 min",
  "content": [
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "When we get cut from the team, we never say it’s because of what we wore to try-outs.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "No, when we get turned down, we tell ourselves it’s because we lacked the skills, experience, or training.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Which might be true.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "What’s not true (mostly) is that you got rebuffed because of anything inherent about who you are.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "They didn’t turn you down because of the narrative you in your head. You didn’t get rejected because the world is against you. Or that because of your unique upbringing or background or parents or education or worldview, you, solely you, didn’t get picked.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "The story in",
          "marks": []
        },
        {
          "_type": "span",
          "text": "their",
          "marks": []
        },
        {
          "_type": "span",
          "text": "head matters far more in",
          "marks": []
        },
        {
          "_type": "span",
          "text": "their",
          "marks": []
        },
        {
          "_type": "span",
          "text": "decision. Beliefs and biases reacting to their perception of the story you’re telling them. So sure, you can improve your odds by having a professional-looking resume and font-face and looking your best. You can show up early, befriend the dean or the assistant coach. Ace the SAT, GRE, or any number of standardized qualifiers. Or create of body of work (or a reputation) that speaks for itself.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "But if you try your best and still get cut, understand that it has much less to do with you, and much more to do with the conceptions and predispositions of the person actually making the decision.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Rejection has a negative connotation, and it shouldn’t. It doesn’t mean that you or your pitch are unqualified, let alone capable. It merely means that the person making the decision either wasn’t sold (enough) and is therefore assured in your proposition to choose you or your solution, or based on what they believe and how they see the world, they see (at least in their mind) a better alternative.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "It has almost nothing to do with you and your beliefs about yourself, and everything to do with them. When you get turned down, it merely means this person doesn’t know what you know, doesn’t see it the way you see it, and is blinded by their own perception about what’s scarce, what matters, and what’s available.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Their values, their worldview, their biases. Not yours.",
          "marks": []
        }
      ]
    }
  ]
}