{
  "title": "148861909.on Doing The Work Despite Weekend Fomo",
  "slug": "148861909on-doing-the-work-despite-weekend-fomo",
  "publishedAt": "2025-11-30T19:29:40.115Z",
  "excerpt": "I went to the gym earlier. On a Friday night. At about 7 pm or so.",
  "image": "",
  "readTime": "3 min",
  "content": [
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "I went to the gym earlier. On a Friday night. At about 7 pm or so.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Back in college I would never have even considered showing up to do any sort of work (let alone working out) on a Friday (or Saturday) night. It was almost taboo for me (and I'm sure I'm not the only one). The thought of working (whether it be in front of a computer screen or at the gym) when I could have been out with friends or at a party or on a date with a pretty girl would have made me feel really uncomfortable (it still does). It's as if I thought just the feeling of missing out would have been too much to bear.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Thing is, when you're not working overtime on your goals, you're not really getting anywhere worth being. You're slacking off in a way, and that can't help your progress, let alone your psyche.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "I went to the gym tonight because I set a goal for myself to lose 20 pounds before my next birthday, and I'm committed to achieving that goal. But back in college, on a typical Friday night I would have shrugged off that goal so I could go out to Cook Out and eat burgers, fries and shakes with friends. And so, despite my efforts, I never lost the weight I said I'd lose.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "The same rule applies to my writing habit. It's been a little over a year since I starting blogging, but I haven't been able to do it consistently mainly because I sleep in until I have to get up for work, and I generally avoid writing on weekends. And so, post's don't get written and what starts out a two day break becomes a month long break from writing. This week was an exception; I've written a post every evening since Tuesday, and it was only a moment ago that I decided to do something different and write out a post tonight. That's right, tonight, on a Friday night, when I could be out, I'm home, in my PJ's, writing a post no-one as far as I know will ever read.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "But I'm doing it because (a) I have momentum on my side, (b) I want to make this a habit, and (c) the only way I'm going to do this consistently is if I either wake up at 6 am every day and write, or train myself to write on Friday and Saturday evenings. Yes, it still makes me uncomfortable knowing that somebody might read this and presume that I don't have anything better to do on a Friday night than sit and write at home in my PJ's. I sorta wish I was out having fun too. But for the first time in my life, I'm willing to sit with this discomfort and do the work anyways, because I've made a commitment to myself to keep up this habit.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "In other words, I'm letting my goals, values and commitments dictate my schedule and priorities, not allowing my feelings of discomfort and my fear of missing out to control my actions.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Certainly, I may not end up having had the most fun tonight that I could have had. But at least I'll go to bed with peace of mind knowing I put in the work to achieve my goals. And it's really nice knowing (the first time ever!) that I can push through the discomfort of weekend FOMO and do this consistently when the need arises.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "No it's not exhilarating. But for what it's worth, it's worth it.",
          "marks": []
        }
      ]
    }
  ]
}