{
  "title": "148862341.no Point In Trying",
  "slug": "148862341no-point-in-trying",
  "publishedAt": "2025-11-30T19:29:45.021Z",
  "excerpt": "It’s possible that the system is designed to work against you. That each subsequent lesson assumes full knowledge of all that was passed on before, and that you’re so far behind you really need to go ",
  "image": "",
  "readTime": "2 min",
  "content": [
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "It’s possible that the system is designed to work against you. That each subsequent lesson assumes full knowledge of all that was passed on before, and that you’re so far behind you really need to go back anywhere from 5 to 50 lectures.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "It might be that the material, is, in fact, incredibly difficult to grasp. You might not have an accurate model for how this thing",
          "marks": []
        },
        {
          "_type": "span",
          "text": "really",
          "marks": []
        },
        {
          "_type": "span",
          "text": "works. You might even lack the big picture understanding (the motivation) to care enough to overcome the sheer difficulty of learning it.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Maybe you think you’re the only one who finds this difficult. You might assume that everyone else finds this effortless. So you don’t seek help, or ask questions, or raise your hand, because you don’t want people to know you don’t know what you’re doing. Instead, you commit yourself to silence, to not-knowing, to assuming you’re an outlier, and to forgetting how to try.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Most likely is that you’ve never had a series of generous teachers. Someone who cares enough about you and your success that they challenge the dogma of immobility. Who rejects the notion that you can’t do anything with consistent effort and practice. Who takes the time to meet you where you are, not where the curriculum says you ought to be. Someone who provides you with the knowledge and resources and step-by-step roadmap to get you from confusion to competence. Who understands the mechanics of",
          "marks": []
        },
        {
          "_type": "span",
          "text": "helplessness",
          "marks": [
            "link-0"
          ]
        },
        {
          "_type": "span",
          "text": ", who doesn’t make an enigma of it, who calls your bluff and reveals that you",
          "marks": []
        },
        {
          "_type": "span",
          "text": "can.",
          "marks": []
        }
      ],
      "markDefs": [
        {
          "_key": "link-0",
          "_type": "link",
          "href": "https://en.wikipedia.org/wiki/Learned_helplessness"
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "You’re not stupid. You can learn this.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Believing there’s no point in trying because you’ll fail no matter what—that’s a disservice. It’s a injustice to your students, to your kids, to your peers, and most poignantly, to yourself.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Accomplishment begins with embracing that idea that you can. That investing in better will pay off.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Difficult, sure. Impossible, not ever.",
          "marks": []
        }
      ]
    }
  ]
}