{
  "title": "148862421.spanning Extremes Begins With Changing The Story",
  "slug": "148862421spanning-extremes-begins-with-changing-the-story",
  "publishedAt": "2025-11-30T19:29:45.860Z",
  "excerpt": "One useful way to approach the long process of changing the attitudes of a group of people is to think about how to move the line of what is tolerable (by the collective) to a future target.",
  "image": "",
  "readTime": "3 min",
  "content": [
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "One useful way to approach the long process of changing the attitudes of a group of people is to think about how to move the line of what is tolerable (by the collective) to a future target.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "The challenge is making “people like us do things like this” a journey that the members of that tribe want to be apart of.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "It can be tempting to try to convince these people with facts and figures and colorful branding. To argue that a way of seeing the world is an ideology based on pseudoscience or that a specific congregation is merely a form of informal brainwashing.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Of course, forcing a worldview on people is often impetuous and ineffective, and often only reinforces their arguments.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "A better method might be to consider the thinking behind those on the opposite end of the spectrum: What’s different about how this tribe navigates their world? What are they doing differently?",
          "marks": []
        },
        {
          "_type": "span",
          "text": "Then",
          "marks": []
        },
        {
          "_type": "span",
          "text": "consider, how can we create a story that these other folks, the neophobic in whatever category, will want to be apart of?",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Case in point: Supremacist rallies and poetry readings are alike in that their purpose is to encourage and participate in a worldview. The difference between these groups is how they go about it.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Supremacist rallies take a closed-view—a linear thought-line often based on scarcity, and use a top-down system to indoctrinate a set of prejudices within and throughout the group. On the flip side, people go to poetry readings to open their minds to a different point of view. The intention is to come away having learned about something or someone and to develop empathy for them or their thoughts or their cause. Furthermore, it’s a horizontal system: everyone has the opportunity to both be speaker and listener. And so it’s inherently open to an abundance of views, attitudes, and artistic styles, where the purpose of the gathering is to celebrate them as a coherent group.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "So we start from, how do we make rallies more like readings from the inside-out?",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Could you (possibly) encourage a potential members to share their thoughts or their doubts? To (maybe) open the door towards a conversation that leans toward a more liberal view?",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "From there, the question might be, how do we gradually make supremacist rallies more open? First, more open to the views of their members, because not everyone who considers himself a supremacist is a hardcore neo-nazi. And then, gradually, working from within, to begin to consider the thoughts and feelings of those on the outside.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Given a long enough time frame, with tenacious effort, I have little doubt we can intentionally change the culture. But to change other people’s inclinations and ideologies, we have to be consistent and intentional about the journey we’re selling and the behavior we’re prescribing, as well as how we choose to go about incentivizing those actions from the start.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Indeed, changing the marketing is the best way to span extremes.",
          "marks": []
        }
      ]
    }
  ]
}