{
  "title": "148863493.vexing Standards",
  "slug": "148863493vexing-standards",
  "publishedAt": "2025-11-30T19:30:02.632Z",
  "excerpt": "On May 20, 1899, Jacob German, a taxi-driver, was arrested and jailed for driving his taxi at the then \"breakneck speed\" of 12 miles per hour.",
  "image": "",
  "readTime": "2 min",
  "content": [
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "On May 20, 1899, Jacob German, a taxi-driver, was arrested and jailed for driving his taxi at the then \"breakneck speed\" of 12 miles per hour.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Shortly after, the state of Connecticut enforced the",
          "marks": []
        },
        {
          "_type": "span",
          "text": "first speed limit",
          "marks": [
            "link-0"
          ]
        },
        {
          "_type": "span",
          "text": "at 12 mph, and--for the folks so accustomed to horse-drawn carriages and bicycles and walking--you can bet it was enough to fill their need for speed.",
          "marks": []
        }
      ],
      "markDefs": [
        {
          "_key": "link-0",
          "_type": "link",
          "href": "https://www.wired.com/2008/05/dayintech-0521/amp"
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Now consider the guy in the Subaru WRX who cut me (and a dozen other cars) off yesterday going 90 mph on the beltway. Sure, he felt a thrill for all of 30 seconds. Some G-force, perhaps. But what's the difference--viscerally and emotionally--between his experience of escape velocity and Jacob German's?",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Assuming there's nothing physically different between people today and people from 100 years ago (which there isn't), I'm guessing not much.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "But, of course, psychologically and socially, we're completely different, in almost every way. A hundred of years of change and choice and standards has completely altered our expectations about what makes up a worthwhile experience.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "So that where driving 10 miles per hour was once fun for most people, modern people often struggle to enjoy themselves unless they're going seven times as fast (sometimes more).",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Combine this process of evolution to nearly every facet of modern life and it's easily to see how we got here: numb, reckless, stupid. Chasing more when we already have so much.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "The thing to think about, the lesson to learn, is that in parallel to our rising standards of living, our standards have also changed. Not our physiology, not our brain chemistry, but our expectations about what makes us happy or excited or contented.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Recognizing that what was once a thrill is something that we now get to experience everyday (but have simply gotten used to) is the way to recalibrate our expectations back to a more sober threshold, and, in so doing, learn to enjoy the state of things",
          "marks": []
        },
        {
          "_type": "span",
          "text": "more",
          "marks": []
        },
        {
          "_type": "span",
          "text": "while we consume and seek out",
          "marks": []
        },
        {
          "_type": "span",
          "text": "less",
          "marks": []
        },
        {
          "_type": "span",
          "text": ".",
          "marks": []
        }
      ]
    }
  ]
}