{
  "title": "160428284.meetings And Listening",
  "slug": "160428284meetings-and-listening",
  "publishedAt": "2025-11-30T19:30:17.033Z",
  "excerpt": "Meetings are a bane on many productive workers. They’re also a bore.",
  "image": "",
  "readTime": "2 min",
  "content": [
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Meetings are a bane on many productive workers. They’re also a bore.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "That’s usually because most of the things that are said in meetings could be easily summarized in a sentence in an email, or a slew of bullet points in an addendum. But also, often because, if you’re in a large meeting, it is rare that",
          "marks": []
        },
        {
          "_type": "span",
          "text": "everyone",
          "marks": []
        },
        {
          "_type": "span",
          "text": "has something to say that’s directly related to you.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "So we doze off, we check our email or our phones, and we ‘mentally escape’ while waiting for our turn to speak—or for the meeting to end.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "At the same time–we’re openly aware of our poor listening skills, our general lack of empathy, and our need to see the big picture–to understand fully how what everyone is working on fits together and contributes to the larger goal.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Hence a simple hack that might make your meetings more engaging–and that will certainly improve your listening skills: whenever you’re in a meeting, open a separate doc, and, anytime anyone speaks, write a summary of what they say.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Not what you hear word for word, but what they mean to say–what they probably should have said if they’d had the time to organize their thoughts.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "It’ll force you to process what they’re saying, filter out the fluff and focus on the core message. And by translating what’s said into clear concise points, you’ll be better able to understand the big picture and the relevance of what each person has said.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "I can’t promise it’ll transform every meeting from a tedious time-sink to a meaningful session, but it can at least make for a productive use of the time you do spend in them.",
          "marks": []
        }
      ]
    }
  ]
}