{
  "title": "165343740.comfortable Problems",
  "slug": "165343740comfortable-problems",
  "publishedAt": "2025-11-30T19:30:17.226Z",
  "excerpt": "I just finished reading Michael Easter’s book, The Comfort Crisis , which is a great read even if you’re not an extreme adventurer or fitness enthusiast, as the title might suggest.",
  "image": "",
  "readTime": "2 min",
  "content": [
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "I just finished reading Michael Easter’s book,",
          "marks": []
        },
        {
          "_type": "span",
          "text": "The Comfort Crisis",
          "marks": [
            "link-0"
          ]
        },
        {
          "_type": "span",
          "text": ", which is a great read even if you’re not an extreme adventurer or fitness enthusiast, as the title might suggest.",
          "marks": []
        }
      ],
      "markDefs": [
        {
          "_key": "link-0",
          "_type": "link",
          "href": "https://www.amazon.com/Comfort-Crisis-Embrace-Discomfort-Reclaim/dp/0593138767"
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "His premise is simple: Our modern world is full of comforts that, despite making our lives easier and more enjoyable, can also make us forget how good we have it and contribute to many of the problems that threaten our happiness and wellbeing.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "It got me thinking about the level of comfort I’ve allowed myself to settle into and whether that comfort is actually serving me in my own life. In the process, I thought up a simple exercise to help me evaluate my relationship with comfort, one that I think might benefit others as well.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "It’s pretty simple. Open a word doc and write down, as best you can, all the ‘problems’ you’re encountering right now or things that are causing you to worry. They could be aches and pains, a broken faucet, paying down your credit card, or even just feeling uninspired at work. Big or small, write them all down without filtering or judging.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Then, for every item on your list, ask yourself–is this a third world problem or a first world problem masquerading as something worse?",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "In other words, is this issue truly threatening your well-being, safety, or ability to live? Or is it a discomfort dressed up as a crisis because I’ve become so used to ease and predictability?",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "It’s a powerful reframe. By calling it out for what it is, you strip away the drama and start to see the challenge for what it is: something that might be uncomfortable, but also manageable, even growth-inducing.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Because if you’re lucky enough to be reading this post at all (on a smartphone or a pc) it’s likely that most of your problems aren’t about survival — they’re about comfort, control, or expectation.",
          "marks": []
        },
        {
          "_type": "span",
          "text": "\n",
          "marks": []
        },
        {
          "_type": "span",
          "text": "\n",
          "marks": []
        },
        {
          "_type": "span",
          "text": "It's usually not a crisis. It's a reminder — to appreciate how good you have it.",
          "marks": []
        }
      ]
    }
  ]
}