{
  "title": "A list of possible solutions",
  "slug": "a-list-of-possible-solutions",
  "publishedAt": "2018-09-14T06:38:00.000Z",
  "excerpt": "…might be the best way to work your way around a problem.",
  "image": "",
  "readTime": "2 min",
  "content": [
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "…might be the best way to work your way around a problem.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Asking, “what would my circumstances look like if I proactively made this situation better?”",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "And “what are other options I’m not seeing?”",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "The first question helps you take responsibility, focusing on realistic solutions that you can initiate.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "The second helps you avoid narrow framing: seeing only one or two options that limit your choices to mere “yes or no, this or that” solutions. As opposed to being open to the vast amount of choices available to you.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Realizing that quitting your stressful job (or not) is merely one choice, out of a pool of many other reasonable alternatives, is a far better way to pilot the decision-making process than highlighting your one choice.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Knowing that other (proactive) solutions exist: working less (and doing something else to supplement your income), taking proactive steps to be more tolerant of negative emotions, finding ways to make the job less-stressful, hiring an assistant, or taking on a less-demanding (or more entertaining) role within your present company, is a far better way to land on a solution that works well for you.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "It takes effort to change your focus, to see other options. That’s why physically writing a list is so powerful, it forces you recognize your blind spots, to seek out multiple (and actionable) points of view.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Far harder to navigate a place (or a situation) if you’re stuck between going forward or going back.",
          "marks": []
        }
      ]
    }
  ]
}