{
  "title": "An antidote to busywork",
  "slug": "an-antidote-to-busywork",
  "publishedAt": "2020-03-24T06:50:59.000Z",
  "excerpt": "As more businesses shut down or transition to working remotely, they’re receiving far fewer tickets, customers, and inquires than they’re likely used to.",
  "image": "",
  "readTime": "2 min",
  "content": [
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "As more businesses shut down or transition to working remotely, they’re receiving far fewer tickets, customers, and inquires than they’re likely used to.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Which means that employees of all kinds are experiencing a surplus of (free, disposable) time unlike anything they’ve ever had.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "In response, many bosses have resorted to is assigning their people needless tasks that likely won’t benefit them or their clients' in the slightest: boring content articles, how-to guides for future employees, cleaning furniture...",
          "marks": []
        },
        {
          "_type": "span",
          "text": "anything",
          "marks": []
        },
        {
          "_type": "span",
          "text": " that makes them feel like their contributing something worthy of a paycheck.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Moreover, many employees are being asked to document every little thing they do—so that they end up spending a full hour everyday filling out a timesheet to compensate for their bosses’ lack of oversight.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Another great option—as you may have presumed I'd allude to—is to spend all those extra hours doing something meaningful instead. Because whether it’s learning a new skill or helping your customers see, or kickstarting a new product*, time is all you need. And now, for better or worse, we all have more of it.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Busywork, after all, rarely helps anyone as much as much as we’d like. But your next project, ",
          "marks": []
        },
        {
          "_type": "span",
          "text": "that",
          "marks": []
        },
        {
          "_type": "span",
          "text": " might make the impact we’ve all been waiting for.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "*Not sure where to start? Do what ",
          "marks": []
        },
        {
          "_type": "span",
          "text": "Valve",
          "marks": [
            "link-0"
          ]
        },
        {
          "_type": "span",
          "text": " does: For the next week or two, level your organizational hierarchy so that there’s no barrier between your subordinates and the people they want to work with. Then, allow every person in the company to decide what projects they want to initiate and work on, and with whom. Employees can thus ‘vote’ on projects by deciding where to spend their time.",
          "marks": []
        }
      ],
      "markDefs": [
        {
          "_key": "link-0",
          "_type": "link",
          "href": "https://www.nytimes.com/2012/09/09/technology/valve-a-video-game-maker-with-few-rules.html"
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Since their might be more than few projects (and since everyone at your company is likely a smart, talented person) there may be any number of internal recruiting efforts underway. And since projects and staffing will be fully democratized (and scarce)—only the most interesting ideas will likely attract the most, or the best, talent. This ensures that, all in all, the best ideas will win, and that the excess of ventures you’re left with might just be worth the time and money you gave away to enable them.",
          "marks": []
        }
      ]
    }
  ]
}