{
  "title": "Anyone can learn to cook like an amazing chef",
  "slug": "anyone-can-learn-to-cook-like-an-amazing-chef",
  "publishedAt": "2016-06-27T12:20:02.000Z",
  "excerpt": "There’s no shortage of free  recipes . Anyone reading this can afford to go the store everyday and pick up ingredients and go home and cook. And it’s not necessary access to equipment either. There’s ",
  "image": "",
  "readTime": "2 min",
  "content": [
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "There’s no shortage of free ",
          "marks": []
        },
        {
          "_type": "span",
          "text": "recipes",
          "marks": [
            "link-0"
          ]
        },
        {
          "_type": "span",
          "text": ". Anyone reading this can afford to go the store everyday and pick up ingredients and go home and cook. And it’s not necessary access to equipment either. There’s no shortage of cheap chef’s knifes, Cuisinarts, and other cooking tools on Amazon, or at very least your local thrift store.",
          "marks": []
        }
      ],
      "markDefs": [
        {
          "_key": "link-0",
          "_type": "link",
          "href": "http://www.yummly.com/browse/popular-now"
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "In the culinary arts, what separates the pros from the amateurs is simply experience. The people who do this well enough to do it for a living simply have cooked far more than the everyone else. And so what really makes the difference between a remarkable chef and an average one isn’t access to tools, resources or education. That’s stuff’s all easily available to every person reading this. What characterizes someone who gets better at this over time from someone who doesn’t is simply his willingness everyday to try new recipes, to make mistakes and to ceaselessly learn from his failures. As Bobby Flay has said, “Take risks and you’ll get the payoffs. Learn from your mistakes until you succeed. It’s that simple.”",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Point is, cooking is a skill. Something that can learned, and refined over years and years of practice.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Why don't we view every other profession like that?",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Science? Business? Entrepreneurship? Sales? Teaching? Design?",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "All it takes is a commitment to learn what works (and what doesn’t), a willingness to take on new challenges, and a mindset that encourages us to take risks, to make mistakes and to learn from them until you inevitably get better.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "That's what we should be teaching our kids. At home, and in our schools.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "More on this here.",
          "marks": [
            "link-0"
          ]
        }
      ],
      "markDefs": [
        {
          "_key": "link-0",
          "_type": "link",
          "href": "https://www.amazon.com/Mindset-Psychology-Success-Carol-Dweck/dp/0345472322"
        }
      ]
    }
  ]
}