{
  "title": "Art as a lens to see past our own expectations for what is",
  "slug": "art-as-a-lens-to-see-past-our-own-expectations-for-what-is",
  "publishedAt": "2017-01-26T10:57:14.000Z",
  "excerpt": "I went to the National Gallery of Art in D.C. yesterday and despite having no formal knowledge of how to look at or appreciate art, I noticed some things that stood out to me.",
  "image": "https://blog.brendanbockes.com/wp-content/uploads/2017/01/6a01a73dc1cc30970d01b7c8ce6bba970b-800wi.jpg",
  "readTime": "3 min",
  "content": [
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "I went to the National Gallery of Art in D.C. yesterday and despite having no formal knowledge of how to look at or appreciate art, I noticed some things that stood out to me.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Art can be a lens of seeing our world as it was at a time in our history. You could call it the zeitgeist of the times, so to speak. It’s no coincidence that abstract art exploded in the late 19th century. These artists simply felt a need to create a new kind of art which encompassed the fundamental changes taking place in technology, science and philosophy. That’s what was happening then, and so the ideas being shared at the time created what it now known today as abstract art.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "For the purpose of this post, however, I’d like to draw attention to the fact that art can also prove helpful to see what reality isn’t. That is to say, the flaws of our own perception and cognition and how our mind’s ability to synthesize information about what’s in front of us can often play tricks on us. The world is what we see it is, but sometimes that’s not the world it really is.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Consider these two examples:",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "This is “Clearning” from 2003 by Thomas Demand. At first glance, it looks similar to any other typical jungle scene, one you might find in a travel brochure or as commoditized art in your living room. On closer inspection, however, the keen observer will notice it’s actually all invented. Every leaf, every branch, carefully constructed out of paper. The light shining through the trees? All electric; one big flashlight. Demand does this with most of his works, crafting seemingly real sets meticulously by hand, then taking photographs of them. Sarah Greenough, a curator at the museum put it best, “It seduces you with its apparent reality, and when you get close it surprises you with the artificially…it’s turns your expectation on its head.”",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "This is “Tokamak Asdex Upgrade Interior 2” a photograph made by Thomas Struth in 2009. Notice how you really have no idea what you’re looking at. You assume your looking at a piece of inconceivably complex technology, but only because you have prior experience looking at pictures that are apparently similar to this, whether it be the inside of an industrial plant or a spaceship. And so your past experience is helping you make an assumption about what you’re seeing, even though there’s absolutely no way to make sense of it. There’s no people. There’s no sense of scale or orientation. You don’t know how big or small it is. Or where it is. And so all your left with is your own expectation, your own unique assumption that’s been guided by your previous experience looking at objects that are seemingly similar, but not the same. It’s exhausting. Which is why your mind swiftly categorizes it as “complex technology.” But is it really? And (without looking it up) how do you know for sure?",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "I wonder how our all-to-quick to make yet false assumptions about what we’ve seen or experienced applies to other things. Your beliefs about the world or yourself? The intentions of other people? What you’ve seen or are seeing this very moment? What if it’s all invented by you as a way to simplify the abstract? What if it’s more complex than what you previously thought? Could it be that you’re too caught up in the drama of your life or so far entrenched in your own view to see the world as it really is?",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Something to consider.",
          "marks": []
        }
      ]
    }
  ]
}