{
  "title": "At around 5 pm or so",
  "slug": "at-around-5-pm-or-so",
  "publishedAt": "2017-01-30T10:43:38.000Z",
  "excerpt": "go to your local sit-down coffee shop, when the afternoon caffeine-fix crowd and after-school teens have all gone home. You’ll quickly notice two things. It’s a lot quieter, and almost everyone there ",
  "image": "",
  "readTime": "3 min",
  "content": [
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "go to your local sit-down coffee shop, when the afternoon caffeine-fix crowd and after-school teens have all gone home. You’ll quickly notice two things. It’s a lot quieter, and almost everyone there is on their laptop working on something.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "If you’re reading this, you have a device in your pocket and maybe a personal computer (or two) that allows you read, record, play music, podcasts, and audiobooks, edit multimedia, connect with people from all around the world and generally learn just about anything you could ever want. In fact, you can purchase just about any book on any subject and start reading it less than a minute (same with instructional videos, music, and audiobooks).",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "I don’t think it’s necessary to even consider asking “who has the bigger library?” or “Is my device bigger or better than your’s?” or “Can I afford to pursue higher education?”",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "The important question to ask is, “What am I going to make/create/learn/do with this device?” That’s what our education system should be centered around, and it’s what the jobs of the next two decades are going to be hiring for. It won’t be a physical resume. It’ll be your body of work, the projects you’ve been a part of, and the trail of you’ve left behind.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Certainly, you can consume the internet. Watch as much Netflix and Youtube videos as you like, scroll through endless feeds of useless news. Or you can learn a new skill (or ten). Share news stories and articles that resonate with you. Connect with like-minded people. Create something, do something, lead.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "You can learn anything you want with a computer. And you have the same tools as everyone else to create and share something valuable.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "You don’t need to spend your time and attention checking the specs and upgrading to a newer bigger device or researching and cataloging and purchasing every book (or article, or audiobook, or podcast, or video, or website) you want to read, watch or listen to later. All that matters ",
          "marks": []
        },
        {
          "_type": "span",
          "text": "now",
          "marks": []
        },
        {
          "_type": "span",
          "text": " is what you’re working on ",
          "marks": []
        },
        {
          "_type": "span",
          "text": "now",
          "marks": []
        },
        {
          "_type": "span",
          "text": ". Your next project. What you’re learning, what you’re creating.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "No, you don't need to seek out or “own” more content. Everyone has everything now, or at least instant access to it. And soon, it’ll all be free. No one cares who has the most books (or tools) in their library, or if you have the latest smartphone, or a sleek pc.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "What matters now, what’s important, and what people (potential bosses, partners, investors, friends and tribe-members) are going to seek out is what you choose to ",
          "marks": []
        },
        {
          "_type": "span",
          "text": "do",
          "marks": []
        },
        {
          "_type": "span",
          "text": " with the device in front of you, and what you’re working on at around 5 pm.",
          "marks": []
        }
      ]
    }
  ]
}