{
  "title": "Bad crowds",
  "slug": "bad-crowds",
  "publishedAt": "2019-09-02T09:12:28.000Z",
  "excerpt": "It’s widely known among performers that crowds respond differently based on geography, culture and feeling.",
  "image": "",
  "readTime": "1 min",
  "content": [
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "It’s widely known among performers that crowds respond differently based on geography, culture and feeling.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Example: Jerry Seinfeld would never have a good night in Tatarstan, no matter how hard he tried.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Unfortunately, less people seem acknowledge that the same psychological dynamics apply elsewhere…both online and off.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Which means that, unless you’re prepared for it, getting variable feedback can ruin you and your work, making you feel like no matter what you do, it’s never good enough.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "The alternative is to acknowledge that pleasing everyone is an impossible challenge. That when 20 percent of the people who see your work criticize you, it has very little to do with its quality or your intent, and very much to do with them. Their story, their background, their tastes.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "One star reviews adjacent to 5 star reviews doesn't mean you should work to cater to the former. It merely means that a few people, for whatever reason, be it geography or culture or lack of feeling, didn't get the joke (or don't care enough to try).",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Not everyone can be a perfect spectator, and that's okay.",
          "marks": []
        }
      ]
    }
  ]
}