{
  "title": "Be the solution not the problem have faith",
  "slug": "be-the-solution-not-the-problem-have-faith",
  "publishedAt": "2015-08-06T12:43:53.000Z",
  "excerpt": "I’ve found that most people who complain a lot are often committed to broadcasting their problems (to themselves or others), as opposed to constructively thinking about solutions to their problems.",
  "image": "",
  "readTime": "3 min",
  "content": [
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "I’ve found that most people who complain a lot are often committed to broadcasting their problems (to themselves or others), as opposed to constructively thinking about solutions to their problems.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Now, for a lot of people (hopefully not you), what I’m about to say next won’t apply to them, because they are content with complaining. They enjoy it and are comforted by it, in part, because it allows them to actively blame the world (their upbringing, their lack of willpower, their genes, their circumstances, etc.) for their misfortunes, without ever taking any of the responsibility for it. For those smart and humble and honest enough to realize that they have a degree of autonomy over how they respond to the challenges they face, today, or any day, I have a proposition to make: Is it the problem itself that makes overcoming it so hard? Or is it your own invented way of thinking about the problem and your ability to overcome it that’s holding you back?",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Is your very way of thinking about your problems and challenges holding you back from accomplishing them? Do you genuinely believe you can succeed? Are you a “special case,” one where the analogies and anecdotes of everyone else don’t apply? Or are you confusing lack of self-discipline with apathy-are you just too lazy to do what you know needs to be done?",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Are you a solution-focused individual when it comes to the adversity in your life, or do you create problems out of problems (in which case ",
          "marks": []
        },
        {
          "_type": "span",
          "text": "you",
          "marks": []
        },
        {
          "_type": "span",
          "text": " are the greater problem)? Does your thinking about your problems make them smaller or does it amplify them?",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "If you're problem-focused, here’s a thought: Why not try and be the solution for once? That is to say, stop complaining for a day or a week, and spend your time productivity thinking up solutions. Keep in mind that how you approach the challenges you face today is entirely your own decision. What holds you back the most is you're thinking about your problems, not the problems themselves. It's you're ",
          "marks": []
        },
        {
          "_type": "span",
          "text": "perceived",
          "marks": []
        },
        {
          "_type": "span",
          "text": " challenges and inadequacies that are self-limiting, and yet most of it is invented, born out of nothing but a misguided sense of self and life. And thus, changeable, adaptable, and overcome-able.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "You see, you can choose to either think inside the box, or outside it. To see your challenges in the same light you have for years, or choose to have faith in something outside the box, faith in your ability to succeed, or to find a solution that works.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "To me, that’s what faith is, not something guided by religion or spirituality, but rather our ability to trust ourselves in our greatest moments of uncertainty; to act on solutions that feel like a risk, especially when they’re not consistent with the narrative we tell ourselves about what we're capable of. Faith is our ability to look out and see our world (and ourselves) through a lens of possibility, simultaneously inventing new ways of thinking and being, and adapting our behavior to today’s challenges, in ways that foster growth, not stifle it.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "It’s a much healthier way of looking at the world, and ourselves. And it helps overcome the problem/solution dichotomy too.",
          "marks": []
        }
      ]
    }
  ]
}