{
  "title": "Begin with the end in mind an alternative approach to job hunting and education",
  "slug": "begin-with-the-end-in-mind-an-alternative-approach-to-job-hunting-and-education",
  "publishedAt": "2017-03-08T10:50:18.000Z",
  "excerpt": "Yesterday, while applying for jobs online, sending my resume out, I began to wonder: what if there’s a better way? Or at very least, a different way?",
  "image": "",
  "readTime": "2 min",
  "content": [
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Yesterday, while applying for jobs online, sending my resume out, I began to wonder: what if there’s a better way? Or at very least, a different way?",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "We assume that the best way to get a good job is to go to school, get a degree and apply to as many jobs whos jobs requirements align with our experience. But what we flipped that approach on it’s head?",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "What if we simply found a job that we liked, a job that was better than our current one…more money, better benefits, a company culture that cares…found a position that most aligns with our experience, or what we’d like more experience doing, and then spend anywhere from 3 to 8 months learning the skills required to get that job. Whether we continue our formal education, use online resources, or take on more responsibility at our current positions, we then learn the skills required so that we would, at very least, be considered for our “short-term dream job.”",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "No, it’s not a sure-fire way to land that specific job. But that’s not the point. The point is that instead of you spending an hour a day for 6 months applying to as many jobs as you have time for, you spend an hour a day in that same time learning the skills you need to land one really great (possibly life-changing) job. In addition, because you know the specific skills and experience required, you don’t waste your time learning irrelevant skills or sitting through lectures that don’t align with those job requirements. Landing that job (or a similar one) is the purpose of your education, so there’s no sense wasting your time learning something unessential.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "At best, if everything works out, you become (over time) the “obvious choice” for the HR department of the company you want to work for. Worst case scenario: you spend 3 months to a year learning the skills you need to land a similar job at a different company that needs a person with those skills.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "It’s a far better choice, in my opinion, than wasting all that time shipping out resumes to unattractive companies that only offer better pay, or sitting through a boring lecture that’s not teaching you anything relevant.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Surely, you can do better.",
          "marks": []
        }
      ]
    }
  ]
}