{
  "title": "Big minds little ideas",
  "slug": "big-minds-little-ideas",
  "publishedAt": "2018-09-16T06:04:00.000Z",
  "excerpt": "I think there's a temptation for lots of people to make things bigger than they need to be because they're seeking the impression that their busy work is actually going somewhere.",
  "image": "",
  "readTime": "2 min",
  "content": [
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "I think there's a temptation for lots of people to make things bigger than they need to be because they're seeking the impression that their busy work is actually going somewhere.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Take non-fiction books. Most books in this category, particularly business books, have a main argument that can be pretty much surmised as a long article on ",
          "marks": []
        },
        {
          "_type": "span",
          "text": "Medium",
          "marks": [
            "link-0"
          ]
        },
        {
          "_type": "span",
          "text": ". That said, the vast majority of articles online would be sharper (and thus more impactful) as blog posts.",
          "marks": []
        }
      ],
      "markDefs": [
        {
          "_key": "link-0",
          "_type": "link",
          "href": "https://medium.com/"
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Or consider that most of the ",
          "marks": []
        },
        {
          "_type": "span",
          "text": "hottest",
          "marks": [
            "link-0"
          ]
        },
        {
          "_type": "span",
          "text": " startups or big businesses (run by presumably some of the smartest minds in the country) work hard to find innovative solutions to merely increase market share. The only beneficial end result being that they make more money (or take money from) their competition.",
          "marks": []
        }
      ],
      "markDefs": [
        {
          "_key": "link-0",
          "_type": "link",
          "href": "https://angel.co/newsletters"
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Indeed, there's far less thinking about actually changing the world or improving lives as there is fabricating a brand identity that ostensibly resonates with our core values. As if the design of our gadgets and widgets and garb say more about us than the projects and tribes we engage in.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "One last example: Useless jobs. It’s one thing to write an exorbitantly long and superfluous book, entirely another to spend one’s whole career having done nothing but clock-in. From clericalists to telemarketers to middle-micro-maintenance managers, ",
          "marks": []
        },
        {
          "_type": "span",
          "text": "David Graeber",
          "marks": [
            "link-0"
          ]
        },
        {
          "_type": "span",
          "text": " paints an vivid account of how pervasive and corrosive these jobs can be, both for those employed in them, and society as a whole.",
          "marks": []
        }
      ],
      "markDefs": [
        {
          "_key": "link-0",
          "_type": "link",
          "href": "https://www.amazon.com/Bullshit-Jobs-Theory-David-Graeber/dp/150114331X"
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "The message is two-fold: If you find yourself making a livelihood out of doing something where our collective society wouldn’t notice (or care) if you were gone, you should find something better asap, or find ways to make your work more meaningful and useful. If you’re fortunate enough to still get to make a decision about what it is you do for a living, consider a career that actually makes a difference.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "That's what counts doesn't it? From big thinking to books to business, and every interaction in between, the intention is to make an impact.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "If all you're doing is merely generating more words, more money, or more bureaucracy, well, you've completely missed the point.",
          "marks": []
        }
      ]
    }
  ]
}