{
  "title": "Can i trust you",
  "slug": "can-i-trust-you",
  "publishedAt": "2024-01-03T06:00:00.000Z",
  "excerpt": "Many parts of digital marketing are predicated on the assumption that if you can be the first service that a user clicks on when they’re looking for something, then you effectively have the “cat in th",
  "image": "",
  "readTime": "1 min",
  "content": [
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Many parts of digital marketing are predicated on the assumption that if you can be the first service that a user clicks on when they’re looking for something, then you effectively have the “cat in the bag” when it comes to making a sale.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "But if that were always true, then whoever is ranking for the largest pool of keywords in a space, or whoever paid the most for ads, would always be #1.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "What many marketers overlook is the fact that people don’t care about keywords or ads when it comes to choosing a business to work with or buy from.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "What they care about is whether they can trust what you say.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "It’s a waste to spend any amount of time churning out content or assets or ads before you create a reason for people to trust you.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Plain language, good reviews, and a portfolio of work can do a lot more for a business than having high rankings or a big ad budget.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Because trust is what leads to conversions and loyal customers—not clicks.",
          "marks": []
        }
      ]
    }
  ]
}