{
  "title": "Career navigation and the dip",
  "slug": "career-navigation-and-the-dip",
  "publishedAt": "2018-09-09T07:05:00.000Z",
  "excerpt": "If you choose to let it guide your decisions, a growth mindset can empower you to achieve almost anything. It’s true, with consistent effort and practice, you can be anything you want in life. Rocket ",
  "image": "",
  "readTime": "4 min",
  "content": [
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "If you choose to let it guide your decisions, a growth mindset can empower you to achieve almost anything. It’s true, with consistent effort and practice, you can be anything you want in life. Rocket scientist, crowd-funded artist, digital anthropologist, biochemist? All possible to the person eager to do the required reading, learn the essential skills, and go pro.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "That said, while you can certainly be and do anything you want in life, it’s not a fair game. If you want to be (or become) the best in the pool of potential hires or obvious choices or easily sought-out professionals, it takes working through multiple layers of obstacles that are unique to you.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "The Dip",
          "marks": [
            "link-0"
          ]
        },
        {
          "_type": "span",
          "text": ", as defined by Seth, is the experience of being confronted with any one obstacle that makes you consider quitting. It could be organic chemistry or the cost of getting a degree or the time it takes to learn something new.",
          "marks": []
        }
      ],
      "markDefs": [
        {
          "_key": "link-0",
          "_type": "link",
          "href": "https://seths.blog/?s=the+dip"
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Depending on your circumstances and what you choose to do with yourself, there are a number of factors (Dips) that can work against you. Being aware of and preparing for these potential obstructions can help you make better decisions about what to do or where to go.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Here are just a few to consider:",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Effort:",
          "marks": []
        },
        {
          "_type": "span",
          "text": " Depending on your unique personality and experience, you’ll excel in something things and falter in others. Thus, while it’s certainly possible for everyone to learn to rap or develop an app or write a novel, it’s not the same level of difficulty for everyone. It’s far easier to become best in class in something you’re good at (by leveraging your strengths) than to slug away committed to something you find much more difficult.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Time and Commitments:",
          "marks": []
        },
        {
          "_type": "span",
          "text": " It’s one thing to learn computer science or development as a freshman in college, entirely another to make a similar jump later in life. Furthermore, the more you have on your plate (a full-time job or business, loans, debt, marriage, kids) the more difficult it’s going to be to carve out the time to develop the skills and obtain the knowledge to do something completely new. This is not to say that it’s impossible to pivot in another direction, just that starting from scratch gets more difficult as you grow older and acquire more obligations.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Goals:",
          "marks": []
        },
        {
          "_type": "span",
          "text": " If you want to move out of your parents house (or get married and have kids) within two years, then making a career switch (now) might not be a great choice. If, on the other hand, you’ve thought it through and decided you’ll stop at nothing to be a VR developer or Space-X engineer or whatever in the near-future, the time is now.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "There’s no straightforward easy way to know what you should do to for a living. But being aware of and planning for the Dip, for that unique combination of internal and external factors than can impede you and your progress, can certainly help you navigate it better.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Here’s my advice:",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "listItem": "number",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Discover your strengths. Far easier to capitalize on what you’re already good at than to make a leap in the other direction.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "listItem": "number",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Compare what you want to do (or what you’re interested in) with what you think you can realistically achieve.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "listItem": "number",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Consider the dip (in all it’s forms): required-effort, time-available, goals, lack of resources or connections, commitments, or competition that could potentially derail your efforts.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "listItem": "number",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Consider opportunity cost: are there better alternatives elsewhere? Is there a way to still have everything you want in life and do something else that’s cheaper, faster, or easier in the long run?",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "listItem": "number",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "If you can’t see a better way to do what you want, do that. If you’re stuck on multiple choices that all seem like realistic and good options, draw from a hat or ask a few friends or do what pays the most. Try it out and learn as you go.",
          "marks": []
        }
      ]
    }
  ]
}