{
  "title": "Citation needed",
  "slug": "citation-needed",
  "publishedAt": "2017-05-09T12:05:38.000Z",
  "excerpt": "Ever notice how most of the stuff you read on social media nearly always confirms your pre-existing beliefs?",
  "image": "",
  "readTime": "3 min",
  "content": [
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Ever notice how most of the stuff you read on social media nearly always confirms your pre-existing beliefs?",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "That being said, is it possible that the organizations and tribes and leaders you follow simply promote one linear way of seeing the world?",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "And could it be that the savvy marketer behind every ad and article you see online (in a medium where ad-revenue is based on clicks) is deceiving you? Could news organizations only be promoting and sharing information and media that conforms to their worldview and thus confirms yours?",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Are you reading material that’s based on real-world fact-based evidence where you can see the source? Or is it distorted, presented out of context and/or simply made-up? How do you know for sure?",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "If the business-model is opaque, if we can’t verify that the investors have a hidden-agenda or if advertisers are relying on clicks to meet their monthly goals, how can we trust that what we’re reading or watching is unbiased or even accurate?",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Obviously, this is a huge real-world problem. If we don’t have a reliable news platform that we can trust to inform our opinions, worldviews and decisions, we can’t make sound judgements.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "And if people only get their news in a vacuum, then a very large percentage of the population is only seeing the world through one narrow lens, as opposed to seeing the world as it is. It's not a reliable method for developing empathy for all people. And it's a huge concern given our established system of government whereby our citizenry has the the potential to impact the lives of millions through our aggregate decision-making and voting procedure.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "This is the problem ",
          "marks": []
        },
        {
          "_type": "span",
          "text": "Wikitribune",
          "marks": [
            "link-0"
          ]
        },
        {
          "_type": "span",
          "text": " is trying to solve. How do we create a news platform that’s transparent, open and honest? One where our culture is getting news that's relevant, unbiased and most importantly legitimate. It’s a radically different approach, one that might not work, but it is a huge step in the right direction. I hope you’ll support me in funding their project. All they need is enough to hire ten journalist, a relatively small funding goal, but enough to plant the seeds for a better future.",
          "marks": []
        }
      ],
      "markDefs": [
        {
          "_key": "link-0",
          "_type": "link",
          "href": "https://www.wikitribune.com"
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Maybe in ten years we’ll have news that’s been certified as being “true-news” using peer-reviews from other credible news sources, much like how established science-based journals work today. Maybe we’ll have a reliable method for determining whether any particular piece of media, whether it’s an article or video or breaking “news” coverage, is from an honest and unbiased source. News that’s not “certified” will be obviously be cast as an opinion piece, thereby lacking the merit and credibility of unbiased news.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "We have to start now to change the culture of the media conglomerate so that it starts adopting these new methodologies. In a world where news is free and ubiquitous, it’s about time we starting voting (with our wallets and our attention) for news that’s transparent about it’s sources, expenses and intentions as a media outlet. Only then can we get the unfiltered, objective, evidence-based journalism we deserve.",
          "marks": []
        }
      ]
    }
  ]
}