{
  "title": "Consistency is the goal a quick guide to habit building",
  "slug": "consistency-is-the-goal-a-quick-guide-to-habit-building",
  "publishedAt": "2017-01-04T10:31:49.000Z",
  "excerpt": "It occurred to me today that more than anything, consistency is the difference between people that get results from those that don’t.",
  "image": "",
  "readTime": "2 min",
  "content": [
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "It occurred to me today that more than anything, consistency is the difference between people that get results from those that don’t.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Certainly, going to the gym on a Friday night isn’t going to do you much good. But if you view it as a matter of routine, this being one step in continuation with countless others, it makes a huge difference. Because if you skip Friday, and then you skip next Monday, and then Tuesday, you might soon find yourself having spent an entire month not having gone to the gym. On the flip side, if going Friday makes you more likely or committed to continue going next week, as opposed to skipping more days, that single day makes a huge difference.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Consistency creates routines, and routines create results. So (in the case of exercising regularly) mark on your calendar when you plan on working out. Determine the time and days. Then go at those specified times on those respected days until you reach your goal (and hopefully, as in the case of going to the gym, well after it).",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Plan your schedule in advance. Commit to making progress. And obey those rules like your wellbeing depends on it.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Quick tip: When you’re trying to develop any sort of habit or routine (whether it be going to the gym or writing a daily blog or reading), continuation and consistency is the goal, as opposed to the quality of what you’re doing/creating. So plan to go just 15 minutes everyday for a month (or 3) and simply work on creating the habit of going and doing and fitting whatever project you’re working on into your schedule. If you’re committed to making progress, and you treat those 15 minutes as if they’re your job, (you wouldn’t be late for work would you?) you should have no problem building a habit and thus making progress.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Got no time? It’s only 15 minutes—no excuses.",
          "marks": []
        }
      ]
    }
  ]
}