{
  "title": "Do whats better than now career advice for indecisive people like me",
  "slug": "do-whats-better-than-now-career-advice-for-indecisive-people-like-me",
  "publishedAt": "2017-03-18T22:11:10.000Z",
  "excerpt": "Someone told me recently:",
  "image": "",
  "readTime": "2 min",
  "content": [
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Someone told me recently:",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "“You know if you have a really hard time choosing what you want…you should just forget everything and choose one thing which is better than the last, whether it’s for more money or a better lifestyle.”",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Maybe that’s all it takes.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "For those of us stuck in a job and not sure where to go next, searching (waiting) endlessly for our “passion” to struck us like lightning, maybe it’s time we simply just worked to find the next best thing. Something that isn’t a huge leap, but a small step in a direction that excites you or interests you or is something you want to learn more about.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "For the folks who don’t know what their passion is yet, maybe “do the next best thing” is the best advice. Stop waiting to find you’re passion, and make a small pivot in a direction that's simply better than where you are currently. Set a short-term goal and work towards it every day.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Better can mean multiple things for different people: maybe it’s a raise or a an increase in responsibility at your current position, maybe it’s an internship somewhere new, or even an entry-level job in a line of work that you find interesting. Whatever the case, going in the direction of what’s simply “better” is far, well, better, than simply doing more of what you’re doing now.",
          "marks": []
        }
      ]
    }
  ]
}