{
  "title": "Effectiveness vs efficiency",
  "slug": "effectiveness-vs-efficiency",
  "publishedAt": "2019-10-05T08:56:45.000Z",
  "excerpt": "The most effective way to do something is not always the most efficient way. That’s because the time it takes you do something matters little if you can’t manage to get it done right, or to maintain y",
  "image": "",
  "readTime": "3 min",
  "content": [
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "The most effective way to do something is not always the most efficient way. That’s because the time it takes you do something matters little if you can’t manage to get it done right, or to maintain your success long-term.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Consider the case of weight-loss.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Many proponents of the cause will tell you that the most effective way to lose weight is to go the gym 4 to 7 days a week. To hire a personal trainer. To commit to an abnormally restrictive (calorie conscious) diet. And to focus on grueling high-intensity, full-body workouts that burn as much as possible, as fast as possible.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Indeed, the most efficient way to lose 40+ pounds ",
          "marks": []
        },
        {
          "_type": "span",
          "text": "is",
          "marks": []
        },
        {
          "_type": "span",
          "text": " to go on the Biggest Loser (or something like it). And if that’s your schtick, all the power to you.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "But you’re looking for a way to keep it off for good, it might benefit you to reconsider your approach. Focusing on changing your old habits (and supplanting them with new ones), for example, is dramatically more effective long-term. It’s a slower process, one that demands (or rather affords) not relying on shortcuts to make progress, but the benefits outweigh the surplus of time it takes to see results.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Routinely going to the gym and doing short workout—ten to 30 minutes of jogging (or walking briskly), or perhaps two lifts and a run—is a lot less efficient, for sure. It will take you far longer to lose weight. But if you do it everyday—same time, same place—for two months, you’ll inevitably make it a habit. When you do, you’ll realize that’s something is off on the days you neglect doing it (not unlike the ‘dirty mouth feeling’ of not brushing your teeth), which is a sure sign that you’re on to something that works for you. That feeling can get you to go to gym on the days that you normally wouldn’t feel like it, as opposed to you repeated giving it up and starting over when you find yourself in a state of inertia.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "From this point of view, doing what works long term (by slowly changing your habits) is a far more reliable (and more efficacious) strategy, because as opposed to short-term fixes, habits enable you to create progress that lasts.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Conclusion? Efficiency is not always the same as effectiveness. Sometimes it is; clearly the bobsled that makes it down the hill the fastest is both the most efficient and the most effective. But more often, it’s not.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "For most processes and people, choosing effectiveness over efficiency is often more efficient long-term than relying on a short-term fix that inevitably rebounds.",
          "marks": []
        }
      ]
    }
  ]
}