{
  "title": "Explicit rules and why to follow them",
  "slug": "explicit-rules-and-why-to-follow-them",
  "publishedAt": "2019-12-12T05:02:12.000Z",
  "excerpt": "(or why Abe Lincoln thinks you should drive the speed limit.)",
  "image": "",
  "readTime": "3 min",
  "content": [
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "(or why Abe Lincoln thinks you should drive the speed limit.)",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "At the age of 29, Abraham Lincoln gave this ",
          "marks": []
        },
        {
          "_type": "span",
          "text": "talk",
          "marks": [
            "link-0"
          ]
        },
        {
          "_type": "span",
          "text": " to a crowd a curious onlookers. It’s a great read in an of itself, but in case you don’t have the time or the patience to peruse through it, here’s what I took away from it:",
          "marks": []
        }
      ],
      "markDefs": [
        {
          "_key": "link-0",
          "_type": "link",
          "href": "https://medium.com/swlh/lincoln-on-mobs-99009fe97533"
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Rules are generally a good thing when used to keep things fair and safe, which is why obeying the law is generally a good idea.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Thing is, when society abuses those rules (encouraging more and more people to follow suite) it becomes harder for the whole of people to know what the rules are and where the boundaries of those rules occupy. (Making it ever harder for their self-appointed leaders, governments and enforcement officers to keep people in check).",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Case in point: if you notice that, of the people who drive in your town, some of them drive over the speed limit, you're stuck between two choices. Do you drive the speed the signs on the rode tell you to, or do drive as fast as the people around you do on any given day. (Some people might even propose a third option: driving as fast as you can go without getting a ticket).",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Point is, the more people who abuse the rule, the more ",
          "marks": []
        },
        {
          "_type": "span",
          "text": "other",
          "marks": []
        },
        {
          "_type": "span",
          "text": "people are going to feel like they can get away with it too. So in time, you live in a town where the vast majority of people drive over the limit and a minority of drivers are ridiculed for ",
          "marks": []
        },
        {
          "_type": "span",
          "text": "not",
          "marks": []
        },
        {
          "_type": "span",
          "text": " driving as fast as everyone else, which only encourages more people to break the law (and encourages 'fast drivers' to drive even faster).",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "It’s only when someone you know becomes a victim of reckless driving that we respond to the incredulousness of this mechanism…how almost no one drives with other drivers in mind (or recognizes how fast they are actually going). And so it’s no surprise that speeding is the cause of at least a ",
          "marks": []
        },
        {
          "_type": "span",
          "text": "third",
          "marks": [
            "link-0"
          ]
        },
        {
          "_type": "span",
          "text": " of all motor-vehicle fatalities (year after year).",
          "marks": []
        }
      ],
      "markDefs": [
        {
          "_key": "link-0",
          "_type": "link",
          "href": "https://driving-tests.org/driving-statistics/"
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "As Mr. Lincoln would have argued, the solution is simple (albeit difficult): ",
          "marks": []
        },
        {
          "_type": "span",
          "text": "Obey the law",
          "marks": []
        },
        {
          "_type": "span",
          "text": ". Respect the establishment—the system of laws and punishments we have in place for when we violate them. Hold yourself and the people around you accountable for their actions, and find (creative) ways to encourage people to follow the rules. Better yet, advocate ",
          "marks": []
        },
        {
          "_type": "span",
          "text": "solutions",
          "marks": [
            "link-0"
          ]
        },
        {
          "_type": "span",
          "text": " that make it a default choice—so that people can’t choose.",
          "marks": []
        }
      ],
      "markDefs": [
        {
          "_key": "link-0",
          "_type": "link",
          "href": "https://social.ford.co.uk/could-this-spell-the-end-for-speeding-tickets/"
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Lots of people will inevitably argue that our government shouldn’t impose any such laws. That somehow a speed limit is an invasion of our civil liberties. Of course, many of people fail to recognize that having rules like these is what allows them to get from one place to another safely and comfortably in the first place. Rarely do people dispute our need for stop signs and traffic lights and roads with clear signage. Or all of the motor vehicle safety standards and driving laws that make our commute safe and sound.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "What people need to understand is that owning a vehicle (and the ability to drive one on government-made roads with government funded traffic lights, signals, and signs, and in a community where people are expected to follow the rules) is a responsibility (not a right). In truth--by entering a vehicle--you owe it to yourself and everyone around you to drive safely, to respect the law (in whatever capacity), and own up to it if you miss the mark. That’s how a stable ‘government by the people’ works.",
          "marks": []
        }
      ]
    }
  ]
}