{
  "title": "False proxies and tech",
  "slug": "false-proxies-and-tech",
  "publishedAt": "2024-10-14T11:03:59.716Z",
  "excerpt": "A few months ago, I had a conversation with a hiring manager at an association outside D.C.",
  "image": "",
  "readTime": "2 min",
  "content": [
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "A few months ago, I had a conversation with a hiring manager at an association outside D.C.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "You’ve definitely heard of them.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "They’re known for setting the bar when it comes to fair hiring. Or, at least, claiming that they do.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "The thing is, at no point in the five weeks between when I applied for the job and when I was asked to come in for a final third-round interview did they accurately assess my performance.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "They could have easily asked me to take a test using Typeform. Or, perhaps, give me a take-home assignment to gauge my skills.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "You can’t claim to practice equitable hiring unless you’re brave enough to ignore false proxies—the things we use to gauge a person’s ability to perform a task without actually asking them to do it.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Things like where they went to school and where they last worked, or even what they said they've done on their resume.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Resumes don’t tell the full story. And interview skills, for better or worse, rarely reflect someone’s potential.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Equitable hiring requires a deeper assessment of someone’s actual abilities and potential contributions, beyond surface-level indicators like educational background or previous roles. It's about ensuring that every candidate has a fair opportunity to demonstrate their skills and suitability for a role, rather than relying on assumptions or unreliable markers of success.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "There’s never been an easier time to design an accurate assessment and evaluate it for multiple pre-vetted candidates, at scale. AI can do most of the work for us, but it’s employers to make it happen.",
          "marks": []
        }
      ]
    }
  ]
}