{
  "title": "How to decide what to read next",
  "slug": "how-to-decide-what-to-read-next",
  "publishedAt": "2020-04-13T05:20:36.000Z",
  "excerpt": "Sometime ago, I picked up the idea that the ‘most successful people are those who are voracious readers,’ a notion that’s stuck with me since. An so, as a writer and ever curious human, I have and con",
  "image": "",
  "readTime": "4 min",
  "content": [
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Sometime ago, I picked up the idea that the ‘most successful people are those who are voracious readers,’ a notion that’s stuck with me since. An so, as a writer and ever curious human, I have and continue to consume and collect many, many books.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "In fact, it used to be that if I found something partially interesting at a bookstore, I’d buy it. If I didn't buy it, I'd snap a picture of it. And so now, not only do I own something like 400 books (many of which I've never read), I also have dozens and dozens of photos of books I’d like to own and someday read.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "I also used to mistakenly believe that the reason I wasn’t successful in many of my endeavors was because, despite my avid reading, I didn’t read enough. Given the gift of hindsight, I realize now it’s far simpler: assuming my problems are the result of a lack of action, it's likely insufficient ",
          "marks": []
        },
        {
          "_type": "span",
          "text": "action",
          "marks": []
        },
        {
          "_type": "span",
          "text": " is the culprit.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "And so we arrive at one enlightened way of determining what book to read next (as opposed to choosing at random): Given the off chance my problems are the result of a lack of foresight (not a lack of action) the solution is ever so simple: determine what book is going to give me the answer for the problem I now have, and read ",
          "marks": []
        },
        {
          "_type": "span",
          "text": "that",
          "marks": []
        },
        {
          "_type": "span",
          "text": " book. Then put those insights to good use before I go out seeking another book.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Along the same lines, if I find myself reading a book that doesn’t suite me or my immediate interests or problems, it doesn’t help me to continue reading it. In fact, as ",
          "marks": []
        },
        {
          "_type": "span",
          "text": "Morgan Housel",
          "marks": [
            "link-0"
          ]
        },
        {
          "_type": "span",
          "text": " notes, the best readers (and thinkers) are those who consume a lot of information but have a very strong filter.",
          "marks": []
        }
      ],
      "markDefs": [
        {
          "_key": "link-0",
          "_type": "link",
          "href": "https://www.collaborativefund.com/blog/how-to-read-lots-of-inputs-and-a-strong-filter/"
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "It's not that reading a lot helps you in and of itself, it's that reading widely about a concentrated topic makes it more likely you'll stumble upon something that’s actually useful and applicable to your project. A voracious appetite combined with a strong filter ensures you’ll find something actually worth reading, saving you time, and enabling you to move on to your next challenge.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "---",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Update: I realize now, after having wrote this weeks ago, that this strategy is inherently narrowing, mainly because it’s meant to ",
          "marks": []
        },
        {
          "_type": "span",
          "text": "converge",
          "marks": []
        },
        {
          "_type": "span",
          "text": " on a single idea or topic of thought. And so while this strategy might work well to help you find answers to our most immediate woes, it’s not without its shortcomings.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "The advantage of this strategy of reading deeply about a particular topic (what one might call ‘goal-oriented reading’), after all, is not the same as the benefit you get from reading broadly across many genres (what we generally refer to as ‘reading for leisure.’) While the former is how you might find an immediate answer to your most pressing needs, the latter is how you learn to connect dots between ideas. This can then help you create the groundwork necessary to enable the divergence of thought needed to combine and synthesize ",
          "marks": []
        },
        {
          "_type": "span",
          "text": "new",
          "marks": []
        },
        {
          "_type": "span",
          "text": " ideas.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Hence an all important caveat to my previous post: if you're reading to find an answer to an immediate problem, read deeply by exposing yourself to many books on the same topic (",
          "marks": []
        },
        {
          "_type": "span",
          "text": "while keeping a strong filter",
          "marks": []
        },
        {
          "_type": "span",
          "text": "). If, on the other hand, you’re a writer, a reader, or a thinker who simply likes to read for pleasure (or good fortune), read as as widely as you can, about as many topics that interest you. Draw from a hat, or save some money and check out 5 books each week at the library.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "At the end of the day, there’s really no fault in reading either deeply or widely, just in spending any more time than you need consuming the wrong book.",
          "marks": []
        }
      ]
    }
  ]
}