{
  "title": "How it fits in their world",
  "slug": "how-it-fits-in-their-world",
  "publishedAt": "2024-03-12T07:00:00.000Z",
  "excerpt": "When teaching someone a new concept or tool, it's important to think about what where they’re coming from, and to connect the new thing you’re teaching with what they already know.",
  "image": "",
  "readTime": "1 min",
  "content": [
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "When teaching someone a new concept or tool, it's important to think about what where they’re coming from, and to connect the new thing you’re teaching with what they already know.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "From my own experience, many people know about writing on the web, but not about SEO. You can explain ideas like interlinks and backlinks and queries by connecting them through content.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Another example is UX. People pick up their phones and rely on interfaces every day, but only a few people know about what might have gone into creating them. If you want to explain concepts like site architecture and interaction design, it helps to relate their daily experiences with these concepts.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "The point is, you can’t teach something in isolation. Everything we learn is connected, and the more we can relate new concepts to what people already know, the easier it will be for them to understand and retain the information.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "It takes work to speak in terms of someone’s experience, but it's worth it to bridge the gap between their existing knowledge and the concepts you’re teaching.",
          "marks": []
        }
      ]
    }
  ]
}