{
  "title": "How do you know what makes you most happy against potential alternatives",
  "slug": "how-do-you-know-what-makes-you-most-happy-against-potential-alternatives",
  "publishedAt": "2017-05-22T12:42:33.000Z",
  "excerpt": "Do you know, undeniably, that say, sipping wine with your best friends in the backyard of some vineyard makes you more happy than say, attending Coachella?",
  "image": "",
  "readTime": "3 min",
  "content": [
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Do you know, undeniably, that say, sipping wine with your best friends in the backyard of some vineyard makes you more happy than say, attending Coachella?",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Or camping? Could camping be as enjoyable, if not more fun, than say a dinner and movie date?",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Could it be that, despite all your years of evading exercise, going to the gym actually puts you in a far better mood than just about anything else you would otherwise do? (Like shopping, or snacking, or internet surfing).",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "What about watching tv? How do you know for a fact that watching tv makes you more happy than reading a good book? Have you ever actually gone to a bookstore and found something that really truly engages you? Something you want to learn more about? We don’t hesitate to apply this sort of criteria-based decision-making to the shows in our queue — reading is no different. If you find yourself saying “reading is boring,” maybe you simply haven’t found the right book. That’s like saying watching tv is boring when all you’ve seen is what’s on cable as opposed to Netflix Originals.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "And how about time, and space? Do you have a set time to read (maybe time you would otherwise spend watching tv)? Do you have a comfortable place to sit and read in peace? Your local cafe or bookstore will do. Would you agree that if you don’t read a book, just one, you’ll never know if reading (and learning) could potentially be just as, if not more enjoyable than watching tv? And that by not trying, you’re therefore missing out on doing something that could potentially revolutionize your life?",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "This goes beyond reading or working out merely because they are good things to do for your mind and body. This is about doing what most makes you happy with your limited time. And discovering those truths through real world exposure, rather than simply accepting your pre-existing beliefs, worldview and cultural dogma as uncontrovertibly true. This is about not missing out on your one chance of a lifetime to enjoy life in as many ways as possible.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "I have no doubt that what you’re experiencing whenever it is you experience happiness is, in fact, happiness. Who am I to tell you otherwise? The question is, does this make me as happy as I’d be if I were doing something else? Something that doesn’t completely align with my worldview or self-concept? Something that I’ve never experienced before? Or something I've simply seduced myself into thinking is boring, arduous or nonsensical?",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Then go do that thing. Try it out, just once.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "You’ll either have a great time, or it’ll make a good story. The upside is yours.",
          "marks": []
        }
      ]
    }
  ]
}