{
  "title": "How to make your writing better via expanding the lifecycle of unpublished thoughts ie journaling",
  "slug": "how-to-make-your-writing-better-via-expanding-the-lifecycle-of-unpublished-thoughts-ie-journaling",
  "publishedAt": "2017-02-27T11:16:42.000Z",
  "excerpt": "Up until now, I’ve previously thought that I needed to sit down and write a full post in one setting. That is, sit down, think of something to write about, write a full post and click publish.",
  "image": "",
  "readTime": "2 min",
  "content": [
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Up until now, I’ve previously thought that I needed to sit down and write a full post in one setting. That is, sit down, think of something to write about, write a full post and click publish.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Recently what I’ve realized, however, is that if I just rush it, I’ll inevitably leave out thoughts that may have pushed this idea further, and I’ll undoubtedly find better ways of articulating a concept later. Good things come to those who wait.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "So instead of thinking up something on the fly and publishing it right then and there, what if I write a thought (no matter how bad) as it comes to me, in a journal. I could keep a journal everywhere. In my gym bag, my car, on my coffee table. And then later I might write that idea into my word processor, and then have it sit there a bit, journaled, but not published, swimming around in my mental cache so to speak. And then maybe as time goes by, I can further add to and develop that idea, as I glean new information from what I read and what I listen to and what I experience. So that in 6 months to a year, I might then make better connections between concepts as well as articulate those concepts to the best of my ability.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Writing down mediocre ideas is a precursor to discovering the better ones. No it’s not a breakthrough idea, but it is one that works.",
          "marks": []
        }
      ]
    }
  ]
}