{
  "title": "Inevitable precarious lol forcing it",
  "slug": "inevitable-precarious-lol-forcing-it",
  "publishedAt": "2016-02-24T12:07:30.000Z",
  "excerpt": "The first time I heard someone use the word “inevitability,” was when I had my first real falling out with one of my best friends from junior high. When I asked her why we don’t hang out anymore she s",
  "image": "",
  "readTime": "3 min",
  "content": [
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "The first time I heard someone use the word “inevitability,” was when I had my first real falling out with one of my best friends from junior high. When I asked her why we don’t hang out anymore she said, “change is inevitable,” and I literally had no idea what she was talking about. I had to look it up.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "The first time I heard the word “precarious” used in a sentence was a time at work recently (I currently work at a tea bar) when I was engaging in a somewhat insecure (and probably unsanitary) way of making iced tea. Trying to balance out the temperature from a cup filled with ice, after just pouring hot tea over it, I thought at the time a great way to equalize the temperature in the cup was to to flip the drink upside down with the lid attached and my fingers over the straw hole, instead of pouring it into another glass and then back again like a bartender probably would. Although it worked, my forethoughtful coworker told me it was a “precarious move” and that I should adjust my strategy.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "The first time I heard saw the acronym “lol” I thought it stood for “lots of love,” a common mistake that can potentially alter the entire meaning (or intention) of a text message.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "And lastly, the first time I heard the phrase “forcing it” was when my first real girlfriend broke up with me. She said the reason she was ending it was because she felt we were “forcing it,” a phrase that even now you won’t find in any modern dictionary, let alone an ",
          "marks": []
        },
        {
          "_type": "span",
          "text": "urban",
          "marks": [
            "link-0"
          ]
        },
        {
          "_type": "span",
          "text": " one. But I think I get the gist of it.",
          "marks": []
        }
      ],
      "markDefs": [
        {
          "_key": "link-0",
          "_type": "link",
          "href": "http://www.urbandictionary.com"
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "My point is words are ideas. The words and phrases we are exposed to create in a part the world we inhabit. If you know what “forcing it” means you’ll know what to look for when you are in fact “forcing it,” because you’ll know that “forcing it” is a real thing. Just as if you know that “inevitable” is a word you’ll be aware that change is, in fact, inevitable, and you’ll see it for what it is when the time comes.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "At the same time, if you’re not aware of what those words or phrases mean (but your peers are), you’re essentially cutting yourself off from that insight, from that way of seeing the world, and actually providing your peers with leverage over you. All the more reason to pay attention to the language and expressions the people around you use, and to learn their meanings even if you won’t find them in a standard dictionary.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Certainly, plenty of people use big words to sound smart, but at the same time smart people use words to see the world more accurately, and to communicate those insights more clearly.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "[",
          "marks": []
        },
        {
          "_type": "span",
          "text": "Here’s",
          "marks": [
            "link-0"
          ]
        },
        {
          "_type": "span",
          "text": " a great resource to help you get started.]",
          "marks": []
        }
      ],
      "markDefs": [
        {
          "_key": "link-0",
          "_type": "link",
          "href": "http://sethgodin.typepad.com/files/million-dollar-words-by-godin-and-mandell.pdf"
        }
      ]
    }
  ]
}