{
  "title": "Investing with the houses money",
  "slug": "investing-with-the-houses-money",
  "publishedAt": "2019-09-14T10:44:41.000Z",
  "excerpt": "When you bet on your winnings at the casino, pro gamblers call it 'betting using the house's money.'",
  "image": "",
  "readTime": "2 min",
  "content": [
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "When you bet on your winnings at the casino, pro gamblers call it 'betting using the house's money.'",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "It's a tempting move that often cause you to lose more than you gained (which is why most pros avoid it).",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Doing this in the real world, on the other hand, happens to be a great financial strategy.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "If you can only invest on profit, you can maintain a stable cushion against your losses, while still being able to invest in avenues that give you more leverage or capital over time.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "The most obvious example of this is buying (a cheaper home you can afford), renovating it, and selling it for far more than it cost you, using the earnings to repeat the process on a larger scale. Do it enough times and you can become the next Fixer Upper (or at very least, own the home you want).",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "This strategy applies to other decisions as well, such as how you go about acquiring an education. There are abundance of free and cheap resources available to the aspiring learner...what would happen if you defaulted to using them before you considered taking out a school loan? Or what if you started a (small) side-hustle to make a substantial dent in those loans, before you enrolled?",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "I'm not necessarily advocating that the best way to start a business or get an education is to wait until you can fully afford their associated expenses, but I do think that defaulting to borrowing money (and investing in anything with it) probably shouldn't be your first choice if you truly want these assets to pay for themselves.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "If you're going to be so saddled in debt that you can't afford to enjoy yourself, why invest the thing you think you want to begin with? It's better to start small and work your way up, than to go all in and risk losing everything.",
          "marks": []
        }
      ]
    }
  ]
}