{
  "title": "Inverse differentiation",
  "slug": "inverse-differentiation",
  "publishedAt": "2020-09-10T06:05:00.000Z",
  "excerpt": "I decided after much deliberation to quit my gym membership at my local fitness center.",
  "image": "",
  "readTime": "2 min",
  "content": [
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "I decided after much deliberation to quit my gym membership at my local fitness center.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Already familiar with the antics of the art of terminating one's account from my former gym, I sent my local representative an email asking if I could somehow cancel online because I'd prefer to stay socially distanced because of Covid.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "She confirmed the inevitable. I had to come up with a formal letter explaining why I was cancelling. It was company policy.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "It's interesting that gyms don't use this as a competitive advantage. Why not market the fact that you can quit and cancel anytime, for free, in your pajamas, at a time that's convenient for you, in the easiest way possible?",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "That's a good differentiator, because no other gym (that I know of) is doing it. And far easier to implement than trying to compete on price of membership, diversity of classes, quality of trainers, or quantity of equipment.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "No doubt any gym that adopts this strategy might lose some profit, because people who otherwise wouldn't want to go through the hassle of quiting by snale mail would never quit until they needed to.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "But it works in reverse too--if I'm so delighted by your quality of service (and the ease of quiting) that I'm willing to refer my friends to you, you might make back just as much. And because you're different (because you've adopted a dozen other ways to be differentiate your business) you'll come out ahead of your competition for as long as they don't adopt the same tactics.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Turns out, doing what your competitors are doing can hurt as much as help, so it's wise to give some thought to all the ways you can or would like to be unique.",
          "marks": []
        }
      ]
    }
  ]
}