{
  "title": "Job economics",
  "slug": "job-economics",
  "publishedAt": "2020-03-07T06:32:05.000Z",
  "excerpt": "A decade ago, right on the cusp of my first year of college, I picked up Dan Pink’s insightful book  A Whole New Mind . In it, Dan makes a compelling case that, given the effects of globalization, tec",
  "image": "",
  "readTime": "2 min",
  "content": [
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "A decade ago, right on the cusp of my first year of college, I picked up Dan Pink’s insightful book ",
          "marks": []
        },
        {
          "_type": "span",
          "text": "A Whole New Mind",
          "marks": [
            "link-0"
          ]
        },
        {
          "_type": "span",
          "text": ". In it, Dan makes a compelling case that, given the effects of globalization, technology, and outsourcing, job-seekers would do well to capitalize on ‘",
          "marks": []
        },
        {
          "_type": "span",
          "text": "right-brain",
          "marks": [
            "link-1"
          ]
        },
        {
          "_type": "span",
          "text": "’ oriented skillsets--namely, jobs that require empathy, creativity, synthesis, or pattern recognition, and that therefore can't be so easily outsourced or automated by a machine.",
          "marks": []
        }
      ],
      "markDefs": [
        {
          "_key": "link-0",
          "_type": "link",
          "href": "https://www.amazon.com/Whole-New-Mind-Right-Brainers-Future/dp/1594481717"
        },
        {
          "_key": "link-1",
          "_type": "link",
          "href": "https://www.healthline.com/health/left-brain-vs-right-brain#left-brainright-brain-theory"
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Now I realize that Dan was only partially right. Because, all things considered, there are right-brainers in virtually every city, in every continent—so it’s not like ‘right-brain jobs’ are inherently more scarce, because creative work can be outsourced too.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Furthermore, there turns out to be a lot of ‘right-brained activity’ involved in many industries that one would typically label as purely analytical. High-level tech, programming and (data) science professionals regularly utilize creative skills to come upon new solutions or new approaches to solving challenges. And those combinations of skills--right brained and left-brained—make for indispensable talent that can be difficult to automate and even harder to outsource.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "So…how do you get a job in the new economy?",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "It’s simple. Just astonishingly(!) difficult: acquire skills that are both high in demand, and relatively low in supply.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Right brained, left brained, doesn’t matter. If it’s scarce ",
          "marks": []
        },
        {
          "_type": "span",
          "text": "and",
          "marks": []
        },
        {
          "_type": "span",
          "text": " sought-after, it’s valuable—and is likely worth the cost of tuition. Labor markets, after all, are an ",
          "marks": []
        },
        {
          "_type": "span",
          "text": "economy",
          "marks": [
            "link-0"
          ]
        },
        {
          "_type": "span",
          "text": " in themselves, and just like commodities, they’re governed by--you guessed it--supply and demand.",
          "marks": []
        }
      ],
      "markDefs": [
        {
          "_key": "link-0",
          "_type": "link",
          "href": "https://www.youtube.com/watch?v=2kOQMkFE1E8&list=PL-uRhZ_p-BM5RMTe83Cmp5UB1W2bm076Q&index=7"
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Make no mistake. What matters isn’t your GPA or where you went to school or what side of the brain you habitually activate…what matters is how much value you can produce for an employer in an hour or in a day.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Acquiring scarce-skills is clearly the path to job-security. Doing what’s inherently interesting but clearly valueless, not so much.",
          "marks": []
        }
      ]
    }
  ]
}