{
  "title": "Just 7 years",
  "slug": "just-7-years",
  "publishedAt": "2025-01-09T22:44:38.066Z",
  "excerpt": "If you look at the founders of Facebook, Twitter, Instagram, Doordash, Instacart, and Medium.com, you'll notice something striking: it took them less than a decade to go from novice coders to founders",
  "image": "",
  "readTime": "2 min",
  "content": [
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "If you look at the founders of Facebook, Twitter, Instagram, Doordash, Instacart, and Medium.com, you'll notice something striking: it took them less than a decade to go from novice coders to founders of some of the world’s most successful tech companies.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "If you do the math, it took them an average of 7 years to go from learning the basics of programming to disrupting entire industries.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Two lessons here.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "One, 7 years is a long time. But in the grand scheme of life, 7 years is surprisingly short. If all it takes is 7 years of practice to go from novice to founder of a billion-dollar company, then more people shouldn’t overlook coding (or anything else!) as a career path. Because, regardless of when you’re starting, you likely have the potential to acquire the skills to launch something impactful.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Two, the power of compounding effort. Progress doesn’t happen overnight, but with consistent effort, the results compound in ways you might not initially expect. Mark Zuckerberg founded Facebook six years after launching several other projects–many of which were duds. If he hadn't kept building imperfect apps and learning from each one, Facebook may never have existed.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "The more you build, the more you learn. The more you learn, the better you become, and the more you’ll realize what’s possible. It’s that understanding, paired with the ability to make it happen, that enables people to have an idea and turn it into reality.",
          "marks": []
        }
      ]
    }
  ]
}