{
  "title": "Keep it consistent stupid",
  "slug": "keep-it-consistent-stupid",
  "publishedAt": "2023-11-10T05:00:00.000Z",
  "excerpt": "The point of having brand guidelines, style guides, and design systems is to keep things consistent.",
  "image": "",
  "readTime": "1 min",
  "content": [
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "The point of having brand guidelines, style guides, and design systems is to keep things consistent.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Because if people have a different experience every time they interact with your brand, they won’t know what to expect.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "It’s smart to use the same colors, the same fonts, and the same voice. Or to design your spaces in ways that look similar and feel the same. But it only works for as things stay constant and are seldom in a state of flux.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "If you have great customer service in-person but non-existent customer service on the phone, it doesn’t work. If you hire a designer to create assets for your social feeds but publish amateur videos alongside them, the illusion of a cohesive narrative falls apart. And, perhaps most common, designing a beautiful website but neglecting your messaging will leave visitors irritated and confused.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "It doesn’t make sense to invest in any one thing if you’re unwilling to invest in the entire system—because branding only works if you keep things consistent throughout every piece of content and every customer touchpoint.",
          "marks": []
        }
      ]
    }
  ]
}