{
  "title": "Late blame and long term guilt",
  "slug": "late-blame-and-long-term-guilt",
  "publishedAt": "2020-09-02T07:15:00.000Z",
  "excerpt": "I recently learned that some countries, in sharp contrast to contact tracing in the States, will notify your employer if and when you get Covid. They’ll then shut down your workplace, and not only tel",
  "image": "",
  "readTime": "2 min",
  "content": [
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "I recently learned that some countries, in sharp contrast to contact tracing in the States, will notify your employer if and when you get Covid. They’ll then shut down your workplace, and not only tell all your coworkers that you have the virus, but inform them how you got it, where you were, who you were with, etc.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Not unlike the social shaming that’s common in a collectivist cultures, it’s seems that by infecting Covid with a social taboo, people are less likely to engage in behaviors that may promote transmission. Moreover, by making contagion a double-edged sword—resulting not only in illness but social estrangement—many people in these communities are ",
          "marks": []
        },
        {
          "_type": "span",
          "text": "more",
          "marks": []
        },
        {
          "_type": "span",
          "text": " worried about the social implications of getting sick than ",
          "marks": []
        },
        {
          "_type": "span",
          "text": "actually",
          "marks": []
        },
        {
          "_type": "span",
          "text": " getting sick.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "On one hand, I think this is a pretty clever strategy. Because it encourages people to take responsible actions without the use of force. On the other hand, I realize that it’s not without it’s consequences.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "For one, this approach is a blatent invasion of privacy. (One that, I’m sure, no conscientious politician would ever approve.) It’s also a recipe for hostility (among friends and colleagues), humiliation, opprobrium, and—as [Brené Brown] points out—mental distress.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "What happens to these people after the come down with Covid? What happens to them in five months or ten? How will they ",
          "marks": []
        },
        {
          "_type": "span",
          "text": "feel",
          "marks": []
        },
        {
          "_type": "span",
          "text": " (about themselves or the world), years later?",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "To blame, after all, is to criticize and ostracize after the fact. To assign responsibility for something someone ",
          "marks": []
        },
        {
          "_type": "span",
          "text": "already",
          "marks": []
        },
        {
          "_type": "span",
          "text": " did (and perhaps couldn’t have known to avoid). A hard price to pay (for anyone and everyone) for being too late.",
          "marks": []
        }
      ]
    }
  ]
}