{
  "title": "Lessons from retail",
  "slug": "lessons-from-retail",
  "publishedAt": "2020-06-03T06:32:01.000Z",
  "excerpt": "As most people who’ve worked retail in the past can attest, I learned a lot of lessons(?) from working in the retail industry.",
  "image": "",
  "readTime": "2 min",
  "content": [
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "As most people who’ve worked retail in the past can attest, I learned a lot of lessons(?) from working in the retail industry.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Things that come to mind: how to keep your cool (when people are innervating), how to stay calm and composed (when coping with serious stress), how to set boundaries, keep promises, and work hard.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "I also learned a lot about people. That (some) people can be terrible, and that some seemingly intimidating people can be a joy to interact with (which is why exercising empathy and curiosity usually pays off). I realized that roughly 10% of the people you come into contact with have serious personal problems that make it really hard for them to see the world (and the world around them) clearly. And I learned about status…or rather, the ‘status’ that privilege and money can afford, which, as with most things that can be easily measured, are relative and largely hollow. Which is why while money can buy you nice things (and a certain amount of assuredness), wealth can’t make you cheerful or contended, and it’s certainly no measure of competence, let alone common sense.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "I also learned some handy things about working with people in retail jobs (or just people in general). One being that if you treat people with respect, they’ll generally go above and beyond to give you what you want (and they’ll usually treat you with respect while they’re at it). The converse is also true: if you act like a pretentious prick, you’re going to get exactly what you deserve.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "In summary, I think retail teaches you a lot of things about people. (Certainly more than I ever learned in a lecture hall.) Which is why I think getting some experience working in retail before, during, or after college, (or at least once in your life) is a good idea for most people. Sure, you won’t make nearly as much money as you would interning at a Fortune ten-thousand (or externing a foreign conglomerate) but you just might learn and experience some things that you might never otherwise.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Plus, those skills of emotional-resiliency, empathy, and self-reliance, ",
          "marks": []
        },
        {
          "_type": "span",
          "text": "they’ll stick with you for life",
          "marks": []
        },
        {
          "_type": "span",
          "text": ". Even if you never have to stock merchandise, make a latte, or take out the trash, again.",
          "marks": []
        }
      ]
    }
  ]
}