{
  "title": "Less or more capable",
  "slug": "less-or-more-capable",
  "publishedAt": "2019-02-24T05:42:00.000Z",
  "excerpt": "It's interesting the lengths people go to to insulate themselves from discomfort, particularly the fear of taking responsibility for their futures.",
  "image": "",
  "readTime": "2 min",
  "content": [
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "It's interesting the lengths people go to to insulate themselves from discomfort, particularly the fear of taking responsibility for their futures.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "For example, we often tell ourselves that we’re stuck with the way things are because we’re confined by who or what we’re not. That the reason we can't do X or Y is because we lack something that other people somehow innately have more of, whether it's courage or creativity or simply more potential.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "It's easier that way, because the alternative--admitting to ourselves that we can exercise choice over who become--is scary indeed.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Because if that's true, it means that you’re responsible for where you go. That despite where you are, you’re answerable for your quality of life moving forward. For how you choose to act, for what you do, and who you become. That you alone are accountable for making the recurring choice of being willing to work through the discomfort of proving to yourself you’re capable of more.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "“Your potential is only limited by your willingness to work hard and continue to try new approaches until something works.”",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "That’s a significant stretch from telling yourself you’re simply incapable or incompetent.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Indeed, it’s incredibly uncomfortable to own up to. Because it means that the only way around the obstacles in front of you is to overcome the internal discomfort (and quite possibility a very pernicious self-dialogue) about what you can accomplish. To leap. To admit to yourself, and consistently embrace the fact, that the only limits that exist are the ones you place on yourself.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Ultimately, trading your excuses for higher expectations is the only way to level up.",
          "marks": []
        }
      ]
    }
  ]
}