{
  "title": "Making time is the most important part",
  "slug": "making-time-is-the-most-important-part",
  "publishedAt": "2018-12-28T07:28:00.000Z",
  "excerpt": "It turns out, that on your way to mastery, to knocking out your 10,000 hours, you actually don’t need to practice perfect.",
  "image": "",
  "readTime": "2 min",
  "content": [
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "It turns out, that on your way to mastery, to knocking out your 10,000 hours, you actually don’t need to practice perfect.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "You simply need to show up.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "This is my 300th(!) post on this blog. And yet, half the time, I still don’t know what I’m doing. I don’t wake up in the morning knowing what to write. I just sit down to write (or more precisely think) and the words (ideas) come to me.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Then miraculously, I look back on the stuff I wrote 2 years ago and the stuff I wrote in college before this blog existed, and I’m astonished to find how obscure my writing was. The blobs of text, difficult to understand prose, run-on sentences, tangents, gramatical errors, overused verbage.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Learning to write better wasn’t exactly a conscious, deliberate process. But by making a commitment to write nearly every day, I ",
          "marks": []
        },
        {
          "_type": "span",
          "text": "just",
          "marks": []
        },
        {
          "_type": "span",
          "text": " did.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Issac Asimov, the famed sci-fi writer wrote nearly 500(!) books in his lifetime by waking up everyday at 6 and writing until about noon.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Immanuel Kant, perhaps one of the most influential thinkers in modern history, did the same thing from 5 to 8 am, for 40-plus years.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "I don’t think these guys were literary geniuses from the start. In fact, I contend that saying stuff like that undermines the amount of work they put in. Because you don’t get to mastery by knowing what you’re doing. You get to mastery by showing up, consistently. By doing a thing every day. By learning as you go.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Indeed, commiting to a time and place to practice might be the only significant decision you make enroute to mastery.",
          "marks": []
        }
      ]
    }
  ]
}