{
  "title": "Mindfulness the baristas greatest asset",
  "slug": "mindfulness-the-baristas-greatest-asset",
  "publishedAt": "2017-03-19T06:36:00.000Z",
  "excerpt": "You’ve got thirty drinks on the bar. Steam wand and pitcher in hand. Queuing shots like it’s a pinball machine. The regular playlist-upbeat jazz-barely audible over all the commotion in the room. But ",
  "image": "",
  "readTime": "2 min",
  "content": [
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "You’ve got thirty drinks on the bar. Steam wand and pitcher in hand. Queuing shots like it’s a pinball machine. The regular playlist-upbeat jazz-barely audible over all the commotion in the room. But you’re in a state of flow. This is easy. You’ve been doing this for a while now. In fact, you could keep this up all day.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "And then it happens.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "You start thinking about how you’re going to make all these drinks before someone crosses their arms and gets impatient and yells at you. Or before you have ten people look up at you like a zombie as if you’re an animal at the zoo. Or thinking, what are you’re doing here, working here on your weekends because for some stupid reason you thought it was fun. And that’s precisely when you make a mistake and it slows everything down.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Certainly it’s a challenge to stay calm under pressure…but once you’ve been doing this enough, you realize it isn’t so much about keep calm as it is keeping focused. The real challenge is to stay mindful of the present-as it’s happening. To stop worrying about the future or the external reactions of other people, or what you’re going to eat for dinner or why you’re here, and to simply focus on right here, right now.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "It’s a hard skill to master, but that’s what (I think) separates the really great baristas from the average ones. Certainly, they’re calm under pressure, they’re generally optimistic and they have a great customer service mentality. But they can also stay in a state of perpetual flow (making beverages, calling orders out, handling concerns), without getting preoccupied in whatever else might be happening or otherwise occur. They do their job, the best way they know how, and they don’t allow external factors (impatient customers, lazy coworkers, the thoughts going in their own head) to distract them from what they’re doing now.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Of course, this sort of skill doesn’t just apply to baristas, but to all sorts of professions: teachers, athletes, surgeons, engineers, musicians, uber-drivers, office workers, and to just about any other job that requires focus, interaction with people, or repetition. That means you.",
          "marks": []
        }
      ]
    }
  ]
}