{
  "title": "Moved versus touched",
  "slug": "moved-versus-touched",
  "publishedAt": "2018-04-18T12:23:57.000Z",
  "excerpt": "James P. Carse  makes an important distinction between what it means to be moved by someone or something, and being touched by them.",
  "image": "",
  "readTime": "2 min",
  "content": [
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "James P. Carse",
          "marks": [
            "link-0"
          ]
        },
        {
          "_type": "span",
          "text": " makes an important distinction between what it means to be moved by someone or something, and being touched by them.",
          "marks": []
        }
      ],
      "markDefs": [
        {
          "_key": "link-0",
          "_type": "link",
          "href": "https://www.amazon.com/Finite-Infinite-Games-James-Carse/dp/1476731713"
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "One can be moved, in the sense that they are affected from without. You can be moved to tears by a rehearsed performance, or moved to take action by reading a book, or moved to make a donation via an automated ad. The key point here is that it’s scripted, the performers and writers and directors don’t feel the same as you do in the moment. You’re not sharing a feeling, you’re concerned with their cause. It’s external, even if the emotions you’re experiencing are from within.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "To be touched is to be changed from within, not merely by someone, but with someone. It’s the empathetic conjuncture of a mutual experience. Touching is reciprocal; I can only touch someone in as much as they touch me, change me, influence me. To be touched is to be changed from within, beneath the narrative of who we tell ourselves we are, or how we’d like to be seen.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Moved is a determinate, conclusive scheme. You win (as a performer, as a writer, as a salesmen) when you stir the emotions and actions of an audience. Indeed, the success of a performance is characterized the world over by the intensity and duration of applause, reciprocated only with the half-sincere smiles and brief obeisance of the entertainers.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Touched is an infinite game. To truly touch, is to change and be changed. To see your audience not as detached spectators, but as active performers. To recruit the onlookers and encourage participation in the telling of your story (whether it be a lecture, a sales pitch or a theatrical performance). To touch is to seek out and enroll others in the possibility of learning from and being changed by the other.",
          "marks": []
        }
      ]
    }
  ]
}