{
  "title": "New words part 1",
  "slug": "new-words-part-1",
  "publishedAt": "2019-05-19T04:22:00.000Z",
  "excerpt": "When I was younger I used to cringe at the thought of another vocabulary quiz. The thinking then was that it was a waste to spend hours studying words that only made me sound ever more pretentious.",
  "image": "",
  "readTime": "2 min",
  "content": [
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "When I was younger I used to cringe at the thought of another vocabulary quiz. The thinking then was that it was a waste to spend hours studying words that only made me sound ever more pretentious.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "These days I’ve taken a brighter point of view: new words are how we articulate new concepts, and more pertinently, how we give language (and meaning) to familar ones.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Knowing the words or phrases specific to a body of knowledge, being able to talk about them about with ease, is a good indicator that you’re on a track towards proficiency, or at very least familiarity.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Moreover, being readily aquanted with new ways of articulating an idea, or using a more semantically appropriate word can help you think (and write) with both nuance and clarity.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Just consider all the possible ways you can laugh: you can chuckle, chortle, cackle, howl, hoot, roar (with laughter) and guffaw.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Knowing all the ways to express an idea gives you the freedom to move around in your language, to better navigate the world (of ideas), and most importantly, to learn to see.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "It turns out that investigating new words is a great way to leverage your ability to communicate with those around you and voice your thoughts. It helps in Scrabble too.",
          "marks": []
        }
      ]
    }
  ]
}