{
  "title": "New rules for a new you an unassorted list",
  "slug": "new-rules-for-a-new-you-an-unassorted-list",
  "publishedAt": "2017-09-15T11:00:28.000Z",
  "excerpt": "Buck up and grow up. Don’t yet feel the part of the person you want to be? Act the way you’d like to be and soon you’ll be the way you act. Remember: the only way to a better future, a better you, is ",
  "image": "",
  "readTime": "2 min",
  "content": [
    {
      "_type": "block",
      "listItem": "number",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Buck up and grow up. Don’t yet feel the part of the person you want to be? Act the way you’d like to be and soon you’ll be the way you act. Remember: the only way to a better future, a better you, is by overcoming this obstacle, this reality, or this uncertainty. The obstacle itself is the way.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "listItem": "number",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Nothing will ever change for the better unless you take action. You have to be a proactive and independent agent of your own life and destiny. Everything you achieve is up to you.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "listItem": "number",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Planes are the safest mode of transportation. Alas, what often feels like a risk is often the best (and most reliable) choice in the long run. Risk and reward are conjoined twins. Do what scares you (or excites you), make your world bigger, grow everyday.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "listItem": "number",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Not deciding is the worst decision you can make. The best decision is to decide (and commit) to a process and then change your mind later if it doesn’t work out. Far better than wasting your time and life in a perpetual state of indecision.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "listItem": "number",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Who you were yesterday doesn’t matter nearly as much as who you can be tomorrow, and the steps you take today that will get your there. Be productive today; waiting on tomorrow is a lame excuse.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "listItem": "number",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Probably the most impactful decision you can make for your life and your future is the culture you choose to engage with on a routine basis. You’ve been given a huge privilege in that, for the most part, you get to regularly choose the people you interact with, the beliefs you inculcate, and the ideas you come into contact with.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "listItem": "number",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Fight cynicism and apathy daily. Things turn out best for those who make the best out of the way things turn out, and boredom is a useless state of mind. Far better to find ways to be actively optimistic and curious instead.",
          "marks": []
        }
      ]
    }
  ]
}