{
  "title": "Observational statements",
  "slug": "observational-statements",
  "publishedAt": "2024-10-12T10:05:54.000Z",
  "excerpt": "We’re often told that making assumptions about people is usually the wrong way to build rapport, since it often leads to misconceptions and unfair judgements.",
  "image": "",
  "readTime": "2 min",
  "content": [
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "We’re often told that making assumptions about people is usually the wrong way to build rapport, since it often leads to misconceptions and unfair judgements.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "That's because making assumptions (without asking questions) can blind us to who the person really, truly is.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "But if you’re making conversation and you want to probe deeper, making observations (",
          "marks": []
        },
        {
          "_type": "span",
          "text": "with an open mind",
          "marks": []
        },
        {
          "_type": "span",
          "text": ") can be a potent tool. Because while questions can certainly open the door to deeper conversations, casual observations–like commenting on someone’s outfit or guessing someone’s plans–can act as light, non-threatening icebreakers.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "If you assume right, it shows you’re observant. While if you assume wrong, it can lead to a playful correction and clarification, which can make for good conversation.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Of course, you might think that you can’t possibly come up with much to talk about someone, based solely and squarely on their appearance alone, but that’s because we often overlook all the things that a person in a place suggests.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Sure, you can comment on their clothing, their hairstyle, their accessories, and, of course, their physique. But what about their posture? Their body language? Their facial expressions or their voice or their mood?",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "What does it look like they’re doing? Where does it look like they’re going? Do they compliment or contrast with their surroundings? ",
          "marks": []
        },
        {
          "_type": "span",
          "text": "Say so!",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "There’s certainly a lot more to know about a person than their appearance might suggest. But there’s also loads you can gather from what meets the eye at first glance–if only you’re willing to see the details that paint that more vivid picture.",
          "marks": []
        }
      ]
    }
  ]
}