{
  "title": "Obstinance takes patience",
  "slug": "obstinance-takes-patience",
  "publishedAt": "2020-02-23T06:20:43.000Z",
  "excerpt": "It's rare that an unstoppable force meets an immovable object.",
  "image": "",
  "readTime": "2 min",
  "content": [
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "It's rare that an unstoppable force meets an immovable object.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Because most often most people are far too impatient to be obstinate, and far too lazy to be inconvenienced.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Case in point: You're on the freeway, middle-lane, and you decide to drive the limit (or 5 miles under, whatever you prefer). Most people will cruise behind you, wait the 5 to 30 seconds it takes to realize you're ",
          "marks": []
        },
        {
          "_type": "span",
          "text": "not",
          "marks": []
        },
        {
          "_type": "span",
          "text": " going to speed up, and then change lanes and fly right on by.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Rare is the case when someone is patient enough to be obstinate in their approach. To sit with their discomfort long enough to ",
          "marks": []
        },
        {
          "_type": "span",
          "text": "not",
          "marks": []
        },
        {
          "_type": "span",
          "text": " change lanes.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Or consider the case of sustainability or justice or even world peace. Lofty goals that people say they're devoted to, but given the option between the convenience of compromise and self-interest, and the inconvenience of commitment and long-range selflessness, too few default to the latter.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "It's hard to give up something for something we can't (or won't) experience in the immediate or relatively near future, let alone be patient when things don't turn out the way we want or expect. Which is why given the absence of high-stakes rewards or punishments, most people opt for what’s convenient and immediate and easy. Even if it means we never make progress on the things we say we want.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "There’s a life lesson here, I know it. But I’ll leave it to you and your infinite patience to mull it over.",
          "marks": []
        }
      ]
    }
  ]
}