{
  "title": "On customer expectations purple cows and foursquare reviews",
  "slug": "on-customer-expectations-purple-cows-and-foursquare-reviews",
  "publishedAt": "2017-08-28T13:18:56.000Z",
  "excerpt": "When we go to a restaurant (or any other place where we do business), we have a certain set of expectations. These are factors that, although we barely notice them when they're there, determine the ba",
  "image": "",
  "readTime": "4 min",
  "content": [
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "When we go to a restaurant (or any other place where we do business), we have a certain set of expectations. These are factors that, although we barely notice them when they're there, determine the basic standard of service of what’s being offered by the businesses we engage with.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Going to a restaurant, for example, we expect that we’ll be greeted by our server promptly upon arrival, that she’ll speak clearly and that she’ll remember our order. We expect that our beverages to be refilled when empty and that our food will be served within a 20 to 40 minute window. In the event that mistakes were made, and thus the kitchen is behind schedule, we also expect those issues will be communicated to us and resolved with a sense of urgency. Most importantly, we expect that you (the manager, the sous chef, the wait staff, the receptionist) will make us feel like you care, and treat us with respect, regardless of how you genuinely feel in the moment.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Alas, the job of everyone who works there is to intuit these expectations without help from their patrons, and to provide a level of service that consistently meets those expectations. That’s what a business does.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Thus, when we evaluate you and your company on your “job performance” either in a formal audit or on Foursquare, that’s what we’re rating. We’re assessing your competency, both by which you are aware of these unspoken standards upon which you’re expected to operate from, and your unique ability (from our perspective) to fulfill those expectations.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "If you fail on those basis expectations, you fail. You get one or two stars on Foursquare and Yelp. Keep it up and you start losing customers. Struggling to keep things afloat, you cut corners. Pretty soon, you’re in race to the bottom, one were the only way to keep your job is to lower your prices and provide an ever more un-extraordinary service. Things consistently get worse until you’re out of a job.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "If you meet those expectations you’re average. Locals stop by for a bite to eat. You get a consistent pay. But no one talks about or writes about you or your company.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "If you exceed those expectations (by doing something or providing something that’s ",
          "marks": []
        },
        {
          "_type": "span",
          "text": "remarkable",
          "marks": [
            "link-0"
          ]
        },
        {
          "_type": "span",
          "text": ") you get to be a ",
          "marks": []
        },
        {
          "_type": "span",
          "text": "purple cow",
          "marks": [
            "link-1"
          ]
        },
        {
          "_type": "span",
          "text": ". This not only gets you talked about, but it allows you the freedom to charge more (because you’re in demand) and then, if you’re so obliged, use that money to reinvest in your product or service. This creates a virtuous cycle, one that consistently allows you to invest in being better than you were yesterday by providing an even more extraordinary service. Of course, when the competition steals your ideas and your purple cows become commonplace, then you have start over with upgraded standards (what we call “raising the bar”). Alas, this is a far more difficult path, but infinitely more rewarding.",
          "marks": []
        }
      ],
      "markDefs": [
        {
          "_key": "link-0",
          "_type": "link",
          "href": "https://www.merriam-webster.com/dictionary/remarkable"
        },
        {
          "_key": "link-1",
          "_type": "link",
          "href": "https://www.fastcompany.com/46049/praise-purple-cow"
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "What’s interesting to me isn’t that some businesses choose to be purple cows and others don’t. It’s that the primary difference between the businesses that become remarkable versus those that don’t is this: they simply choose to care, ",
          "marks": []
        },
        {
          "_type": "span",
          "text": "more.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Tonight, I’ll be celebrating my birthday at one the ",
          "marks": []
        },
        {
          "_type": "span",
          "text": "best",
          "marks": [
            "link-0"
          ]
        },
        {
          "_type": "span",
          "text": " restaurants in D.C. It’s not the most extravagant or the most expensive, but it is arguably the most popular. I don’t think it’s because they have better food (great food is ubiquitous in D.C.) or because of it’s eclectic vibe or stunning string-lit ",
          "marks": []
        },
        {
          "_type": "span",
          "text": "atrium",
          "marks": [
            "link-1"
          ]
        },
        {
          "_type": "span",
          "text": ". The secret to its success? As Michael Richmond, the assistant GM mentioned in an ",
          "marks": []
        },
        {
          "_type": "span",
          "text": "interview",
          "marks": [
            "link-2"
          ]
        },
        {
          "_type": "span",
          "text": " on the subject: \"We treat our clients with empathy…we treat them the way we'd want to be served on any night out.\"",
          "marks": []
        }
      ],
      "markDefs": [
        {
          "_key": "link-0",
          "_type": "link",
          "href": "http://www.bonappetit.com/restaurants-travel/best-new-restaurants/article/roses-luxury"
        },
        {
          "_key": "link-1",
          "_type": "link",
          "href": "http://media-cdn.getbento.com/bentobox/blog/images/drkAbwdCR5W4KTzg5cIg_rosesluxury.jpg"
        },
        {
          "_key": "link-2",
          "_type": "link",
          "href": "http://www.instyle.com/news/roses-luxury-michelle-obama-favorite-restaurant-review"
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "It amazes me how simple this theory of business is and yet how few managers, creators, and customer service reps operate from it.",
          "marks": []
        }
      ]
    }
  ]
}