{
  "title": "On changing the wallflowers destiny",
  "slug": "on-changing-the-wallflowers-destiny",
  "publishedAt": "2015-07-21T13:34:05.000Z",
  "excerpt": "I’ve been thinking a lot lately about how our beliefs — about ourselves, our world, and this intersection between the two — ultimately shape who we are and create the worlds we inhabit.",
  "image": "",
  "readTime": "4 min",
  "content": [
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "I’ve been thinking a lot lately about how our beliefs — about ourselves, our world, and this intersection between the two — ultimately shape who we are and create the worlds we inhabit.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "I’ll give you a (somewhat personal) example: I’m an introvert. Always have been. Alas, as a kid and teenager, people always assumed I was just “a quiet one.” And naturally, as a kid, being an introvert (although unaware of it), I was quiet in most peer-group situations, and soon I started believing I was a quiet, somewhat shy, kid myself.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Here’s the thing: I *believed* I was the quiet one because I was labeled as one. And I became more and more quiet because everyone (including myself) believed I was. Despite all evidence to the contrary (I was actually extremely sociable outside of school), I continued to believe I was just a quiet, shy, guy.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "It wasn’t long before this very simple belief (and the compounding actions that followed them) shaped my world, and created a new layer of beliefs that would define what I was capable of. Fyi, quiet kids have less friends, they’re less popular, they don’t get invited to parties and after school outings, and they usually don’t have girlfriends. If you’re a teenager and you are “the quiet one,” you usually don’t try out for extracurriculars either, unless encouraged by a parent. Hence, you’re making less friends in class, and virtually no friends after school.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "This compounds too, because it’s not so long before neutral words like “quiet” and “shy” are replaced by more adult-sounding pessimistic synonyms: ",
          "marks": []
        },
        {
          "_type": "span",
          "text": "wallflower",
          "marks": [
            "link-0"
          ]
        },
        {
          "_type": "span",
          "text": "; loner; creep; awkward; anti-social, etc. How do you think that effects a kids self-esteem? His level of confidence? His willingness to take social risks and join clubs and meet new people?",
          "marks": []
        }
      ],
      "markDefs": [
        {
          "_key": "link-0",
          "_type": "link",
          "href": "http://www.urbandictionary.com/define.php?term=wallflower&defid=1666386"
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "What’s more, after a “quiet anti-social introvert loner with less real friends than he has fingers” survives high school, he goes to college. College is a place designed for social interaction. You can’t go to parties if you don’t know people, and you can’t know people if you don’t go to parties. Alas, quiet introverted twenty-somethings usually don’t have friends that invite them to parties, and they generally don’t go to parties (or club meetings) on their own. The result: no more friends than they had in all four years of high school.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "I hate to paint such a stark image. But that’s the truth of the situation for many of these people (it was for me) . They graduate college with a degree, sure, but they still don’t have the social skills necessary to perform any job, let alone make long lasting friendships in the real world without the isolated gallimaufry of people at school.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "But you see, this could all have been avoided if society (friends, family, teachers, leaders, etc.) didn’t classify our kids as strictly “quiet” or “talkative.” There’s a huge difference between the thought line of, “you know, you’re not quiet or anti-social per se, you’re just naturally in your head a lot and you need alone time to think and recharge and be you,” and the sharp black and white duality of “you’re just the odd duckling; anti-social and awkward and in a sea of socially-adept kids.”",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "What if every introvert-kid that’s been labeled as “quiet” or “awkward” or “shy” by his peers, parents and teachers knew he didn’t have to be that way all the time? What if he believed he has just as much ability as his peers to be sociable, to make friends, to be popular, to ask girls out on dates and have them say, “yes”? I think thousands of potentially “anti-sociable/socially-awkward” kids and adults could avoid a lot of pain, a lot of regret, and go on to create amazingly rewarding social lives.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "It all starts with our beliefs; with our interpretations of our world and the adversity we face as well as our beliefs about who we are and what we can be. Beliefs define the limits of our potential, and ultimately shape our world because of it.",
          "marks": []
        }
      ]
    }
  ]
}