{
  "title": "On commitment deciding on rules versus guidelines",
  "slug": "on-commitment-deciding-on-rules-versus-guidelines",
  "publishedAt": "2017-05-18T11:39:01.000Z",
  "excerpt": "I define commitment as a rule that you follow when you are in a different mood than when you started it. That’s what makes it a rule as opposed to a guideline.",
  "image": "",
  "readTime": "3 min",
  "content": [
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "I define commitment as a rule that you follow when you are in a different mood than when you started it. That’s what makes it a rule as opposed to a guideline.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Thus, a useful way of thinking (and making decisions) about everything from diets to relationships to personal values to habits is deciding, before you actually make decisions related to these things, what’s a rule versus what’s a guideline?",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "What’s important is that you decide ahead of time what your rules are, so you don’t waste time or ",
          "marks": []
        },
        {
          "_type": "span",
          "text": "mental energy",
          "marks": [
            "link-0"
          ]
        },
        {
          "_type": "span",
          "text": " thinking about whether or not they are guidelines. If it’s a rule, you follow it regardless of how you feel in any given moment and regardless of the circumstances that arise. If it’s a guideline, it’s simply good advice that you try to follow, with exceptions. Those exceptions are completely okay to have, just as long as you make clear what they are in light of your personal values and goals.",
          "marks": []
        }
      ],
      "markDefs": [
        {
          "_key": "link-0",
          "_type": "link",
          "href": "https://en.wikipedia.org/wiki/Ego_depletion"
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "This line of thinking is especially pertinent for those seeking to make the lifestyle choice of changing their diet. When considering following a specific diet in question, for example, the question to ask (and I realize only know the benefit of writing this down) is “is this rule?” versus \"is this simply good advice that I’ll try to follow except when...\"",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "listItem": "bullet",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "I’m having a really stressful day and don’t feel like it",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "listItem": "bullet",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "I’m craving pizza, ice cream, chocolate, or sugar in any form",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "listItem": "bullet",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "I’m out somewhere (like a different city or country) where I can only try this once-in-a-lifetime food while I’m here",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "listItem": "bullet",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "I’m out at a specific restaurant that specializes in this dish (amazing pizza at an equally amazing pizza joint)",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "listItem": "bullet",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "It’s convenient (sure I could make something at home, but it’ll be so much easier to go here instead)",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "listItem": "bullet",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "I’m on holiday (cookies in December, pumpkin pie in the fall, cake on my birthday)",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "listItem": "bullet",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "I’m at a party or social gathering and everyone is talking about how incredible Sarah’s chicken-chile con queso casserole is",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "listItem": "bullet",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "This (glutenous food item) is normally $7.00+, but I can get it for free today",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "listItem": "bullet",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Free samples?!?",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "listItem": "bullet",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "It’s date night or I’m out with my friends",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "listItem": "bullet",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Bill brought in homemade cupcakes for everyone at work",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "listItem": "bullet",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "I’m starving, it’s late, and there’s nothing in the fridge except…",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "listItem": "bullet",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Someone just handed me an ice-cream bar.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Alas, when you cast things up as mere guidelines, it’s easy to see how your feelings and circumstances can get in the way of your progress and goals. When you apply this same exercise to your other decisions, you can see how everything from your finances to your relationships to your health can deteriorate over a long-enough timespan by way of the simple action of short-term compromise.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "We all know that sacrifice is what makes success possible. What our culture generally fails to inculcate, however, is that rules set the standard for those sacrifices. Rules set decisions apart from guidelines in that they don’t allow ourselves to be seduced by the conveniences of the day. And they create the accountability we need in ourselves, to know that we will make the right (long-term, goal-oriented) decision always, regardless of how we feel or what comes up. Not letting ourselves off the hook when it’s convenient is the only way I know to make real lasting progress.",
          "marks": []
        }
      ]
    }
  ]
}