{
  "title": "On essentialism the little prince and that thing we call love",
  "slug": "on-essentialism-the-little-prince-and-that-thing-we-call-love",
  "publishedAt": "2017-02-02T11:19:09.000Z",
  "excerpt": "Last night, I read this great intro on essentialism, the idea that behind every object, there is an invisible essence or nature of sorts that makes them what they are. That is to say, the essential qu",
  "image": "",
  "readTime": "5 min",
  "content": [
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Last night, I read this great intro on essentialism, the idea that behind every object, there is an invisible essence or nature of sorts that makes them what they are. That is to say, the essential qualities that make up an object (or person) are those that make it what it is, without which, it would not be that kind of thing. This is a sometimes useful way of making sense of the world.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Consider gold, as Paul Bloom asserts in his book, ",
          "marks": []
        },
        {
          "_type": "span",
          "text": "How Pleasure Works",
          "marks": []
        },
        {
          "_type": "span",
          "text": ", “We think about gold, spend money on it, and talk about it, and when we do all of this, we’re not thinking and talking about a category of objects that just happen to look alike. If you put gold-colored paint on a brick, it isn’t a gold brick.”",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Classifying animals works the same way, ",
          "marks": []
        },
        {
          "_type": "span",
          "text": "dogs",
          "marks": [
            "link-0"
          ]
        },
        {
          "_type": "span",
          "text": " that look like lions are still dogs, because what an animal inherently is isn’t primarily based on his appearance, but rather his essential nature, invisible aspects such as genes and organs and behavior.",
          "marks": []
        }
      ],
      "markDefs": [
        {
          "_key": "link-0",
          "_type": "link",
          "href": "https://s-media-cache-ak0.pinimg.com/736x/36/b6/c6/36b6c60848e3ce630dc41f84c957f840.jpg"
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "This is also what enables us to understand that a person could be lying or when ",
          "marks": []
        },
        {
          "_type": "span",
          "text": "food",
          "marks": [
            "link-0"
          ]
        },
        {
          "_type": "span",
          "text": " has been prepared to look like something it’s not, because we’re able to see past mere appearances and understand that someone or something’s true essence (or intentions) are more than what meets the eye. It’s this inherent understanding of essentialism that provides us with a better way of navigating our world.",
          "marks": []
        }
      ],
      "markDefs": [
        {
          "_key": "link-0",
          "_type": "link",
          "href": "https://www.instagram.com/p/7beVTiKiKm/"
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Essentialism is also how we distinguish relationships. Your significant other is yours. You have a mark on each other. But the only way you know that and she knows that is because of the experiences and conversations you've shared, the acts of kindness and generosity and attention, all of which have compounded over time, which have created (and continues to influence) the relationship you now share. Anyone else who see’s them see’s just another girl (or guy) on the street, but you see past the 3-dimension image. Instead, you see the invisible (albeit essential) qualities and experiences you share with that person, and the feelings attributed to those experiences. And so you share an experience (the experience of an all-encompanying set of experiences) and a wide range of feelings for and with this person that you've shared over your time with them, and it’s this invisible quality that makes your relationship what it is. When we talk about “love,” (whether it’s romantic love or familial) what I think we’re really doing is talking about essentialism.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "The protagonist in Antoine de Saint-Exupéry’s brilliant story, ",
          "marks": []
        },
        {
          "_type": "span",
          "text": "The Little Prince",
          "marks": [
            "link-0"
          ]
        },
        {
          "_type": "span",
          "text": ", puts it best. After caring for and befriending an anthropomorphized fox and a rose, the Little Prince crosses a field of roses, upon which he says…",
          "marks": []
        }
      ],
      "markDefs": [
        {
          "_key": "link-0",
          "_type": "link",
          "href": "https://www.amazon.com/Little-Prince-Antoine-Saint-Exupery/dp/198781794X"
        }
      ]
    },
    {
      "_type": "block",
      "style": "blockquote",
      "children": [
        {
          "_type": "span",
          "text": "\"You are not at all like my rose,\" he said. \"As yet you are nothing. No one has tamed you, and you have tamed no one. You are like my fox when I first knew him. He was only a fox like a hundred thousand other foxes. But I have made him my friend, and now he is unique in all the world.\"And the roses were very much embarassed.\"You are beautiful, but you are empty,\" he went on. \"One could not die for you. To be sure, an ordinary passerby would think that my rose looked just like you--the rose that belongs to me. But in herself alone she is more important than all the hundreds of you other roses: because it is she that I have watered; because it is she that I have put under the glass globe; because it is she that I have sheltered behind the screen; because it is for her that I have killed the caterpillars (except the two or three that we saved to become butterflies); because it is she that I have listened to, when she grumbled, or boasted, or ever sometimes when she said nothing. Because she is my rose.And he went back to meet the fox.\"Goodbye,\" he said.\"Goodbye,\" said the fox. \"And now here is my secret, a very simple secret: It is only with the heart that one can see rightly; what is essential is invisible to the eye.\"\"What is essential is invisible to the eye,\" the little prince repeated, so that he would be sure to remember.\"It is the time you have wasted for your rose that makes your rose so important.\"\"It is the time I have wasted for my rose--\" said the little prince, so that he would be sure to remember.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Just in time for Valentine’s day, I think it’s important that we recognize that it’s the time and attention you put in to your relationship that has created and will continue to define what it is today. The invisible is what’s important. Not the flowers, not the chocolates, not the diamonds. It’s the experiences you share together, the feelings you have for each other, those thoughtful timely acts of kindness, and the invisible connection that binds you.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "That is what is truly essential.",
          "marks": []
        }
      ]
    }
  ]
}