{
  "title": "On learning skills and leaving a trail to increase your job prospects a guide for the unemployed and those seeking a bette",
  "slug": "on-learning-skills-and-leaving-a-trail-to-increase-your-job-prospects-a-guide-for-the-unemployed-and-those-seeking-a-bette",
  "publishedAt": "2017-03-23T09:57:32.000Z",
  "excerpt": "It occurred to me the other day that while it’s difficult for many college graduates to find a great job (as defined by great pay, great benefits and a great work/life balance), there’s not shortage o",
  "image": "",
  "readTime": "2 min",
  "content": [
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "It occurred to me the other day that while it’s difficult for many college graduates to find a great job (as defined by great pay, great benefits and a great work/life balance), there’s not shortage of skills to learn to make our resumes better or (even better) leave a trail that shows future employers how we can contribute more than our competition.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Instead of spending three hours a day (or eight) sending out resumes and going through all the stupid loops some HR departments throw at you, maybe a more efficient, better use of your time might be to spend it learning skills instead.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Certainly, we should be learning skills in college. Every semester we should learn a handful of both technical skills and people skills. But for those of us who weren’t fortunate enough to have a curriculum centered around learning real world skills that would help us land a job, there are plenty of resources to be found ",
          "marks": []
        },
        {
          "_type": "span",
          "text": "online",
          "marks": [
            "link-0"
          ]
        },
        {
          "_type": "span",
          "text": ". And you can learn every “soft skill” you need to know at just about any job that requires you to work with (or work for) people.",
          "marks": []
        }
      ],
      "markDefs": [
        {
          "_key": "link-0",
          "_type": "link",
          "href": "https://www.udemy.com"
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Maybe every month you could pick both a ",
          "marks": []
        },
        {
          "_type": "span",
          "text": "technical skill",
          "marks": [
            "link-0"
          ]
        },
        {
          "_type": "span",
          "text": " and a ",
          "marks": []
        },
        {
          "_type": "span",
          "text": "real skill",
          "marks": [
            "link-1"
          ]
        },
        {
          "_type": "span",
          "text": " to master. Whether it’s learning a programming language or relearning excel or learning how to use photoshop, or speaking up or being patient or being flexible, you’ll now be building a routine that enables you to continue to grow on your path to finding a better job.",
          "marks": []
        }
      ],
      "markDefs": [
        {
          "_key": "link-0",
          "_type": "link",
          "href": "https://www.thebalance.com/technical-skills-list-2063775"
        },
        {
          "_key": "link-1",
          "_type": "link",
          "href": "https://itsyourturnblog.com/lets-stop-calling-them-soft-skills-9cc27ec09ecb#.39lbyabsc"
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Far better, in my opinion, than wasting your time waiting to get picked, or sending out resumes and doing backflips for people who won’t read them and who simply don’t care. Certainly, you can (and should) send out a few resumes, but they should be for jobs you truly care about, and for positions you clearly have the skills to do competently. That said, I think 80% of your time should be spent learning skills and initiating projects that demonstrate how well you know them, thereby creating a body of work that will make you the obvious pick for the positions you apply for in the future.",
          "marks": []
        }
      ]
    }
  ]
}