{
  "title": "On living through discomfort",
  "slug": "on-living-through-discomfort",
  "publishedAt": "2015-08-07T13:36:50.000Z",
  "excerpt": "Yesterday, I did a pretty intense high intensity interval workout at the gym.",
  "image": "",
  "readTime": "3 min",
  "content": [
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Yesterday, I did a pretty intense high intensity interval workout at the gym.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "It was exhausting.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "It occurred to me in between doing jumping jacks and squats and swinging kettle bells that for the most part, many of the people who avoid going to the gym consistently do so because they want to avoid the discomfort and exhaustion associated with working out.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Same thing applies for the people who refuse to speak up on the conference call or speak publicly or talk to strangers or do anything else that feels like a risk. They don’t want to feel the discomfort of doing these things, so they avoid it.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Now you see, everyone has their own point of physical exhaustion. Once a person has hit their physical limits, they feel fatigue and exhaustion. Likewise, everyone has their own emotional comfort zone, and everyone, once their out of that zone, feels discomfort.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "That said, the people who go to the gym everyday and the brave folks who consistently take risks still feel physical exhaustion and emotional discomfort, respectively — probably just as much as those who don’t do these things. What makes them able to continue doing these things, however, is that they’ve learned to make space for it in their psyche’s. They’ve learned that pain and discomfort are a necessary component of growth, whether your goal is to build bigger muscles or increase endurance or build character or face your fears. The trick to overcoming these obstacles isn’t to avoid the discomfort, it’s to accept it, to live with it, and to relish it.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "As Ray Dalio writes in his insightful book, ",
          "marks": []
        },
        {
          "_type": "span",
          "text": "Principles",
          "marks": [
            "link-0"
          ]
        },
        {
          "_type": "span",
          "text": ":",
          "marks": []
        }
      ],
      "markDefs": [
        {
          "_key": "link-0",
          "_type": "link",
          "href": "http://www.bwater.com/Uploads/FileManager/Principles/Bridgewater-Associates-Ray-Dalio-Principles.pdf"
        }
      ]
    },
    {
      "_type": "block",
      "style": "blockquote",
      "children": [
        {
          "_type": "span",
          "text": "“Nature gave us pain as a messaging device, to tell us that we are approaching, or that we have exceeded, our limits in some way. At the same time, nature made the process of getting stronger to require us to push our limits. Gaining strength is the adaptation process of the body and mind to encountering one’s limits, which is painful. In other words, both pain and strength typically result from encountering one’s barriers.”",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "If you can accept that physical exhaustion and fatigue are good things when you’re working out (because they literally mean you’re improving), you can learn to enjoy the pain you associate with working out regularly. And you’ll probably do it more often.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Likewise, if you can accept that the worst case scenario of doing what you fear isn’t going to kill you, and that the pros of action outweigh the cons of inaction, you can learn to make space for your fear. If you can learn to embrace it with the certainty of knowing that doing this ",
          "marks": []
        },
        {
          "_type": "span",
          "text": "is",
          "marks": []
        },
        {
          "_type": "span",
          "text": " the path, that doing this thing, whatever the outcome, is the goal, you can train yourself to overcome that which you fear. To experience it in your body and mind, and proceed in being brave, taking risks and making your world bigger.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Pain is required to become strong. And fear is required to be fearless. Learning to live with that discomfort is what makes the strong, strong, and the brave, brave.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "The goal isn’t to avoid it. The goal is to seek it out, and to make peace with it.",
          "marks": []
        }
      ]
    }
  ]
}