{
  "title": "On manual vs automatic processes as it relates to espresso machines motorcycles and business",
  "slug": "on-manual-vs-automatic-processes-as-it-relates-to-espresso-machines-motorcycles-and-business",
  "publishedAt": "2017-09-23T11:54:44.000Z",
  "excerpt": "Recently, in what can only be described as the holy grail of thrift store finds, I stumbled upon a fully-functioning, home-use, die-cast espresso  machine . Although technically semi-automatic, it giv",
  "image": "",
  "readTime": "8 min",
  "content": [
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Recently, in what can only be described as the holy grail of thrift store finds, I stumbled upon a fully-functioning, home-use, die-cast espresso ",
          "marks": []
        },
        {
          "_type": "span",
          "text": "machine",
          "marks": [
            "link-0"
          ]
        },
        {
          "_type": "span",
          "text": ". Although technically semi-automatic, it gives you many of the options you would typically find in a manual machine. The first being that you have to physically dial-in the amount of coffee that goes into your portafilter, as well as manually adjust for the amount of water that goes through it when pulling shots.",
          "marks": []
        }
      ],
      "markDefs": [
        {
          "_key": "link-0",
          "_type": "link",
          "href": "https://www.amazon.com/Breville-800ESXL-Triple-Priming-Die-Cast-Espresso/dp/B00092ZVXA"
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "These two facets give you the unique ability to then adjust for and compare the amount of coffee that goes in with the amount of liquid espresso that comes out, known as adjusting your brew-ratio. In the world of standard espresso ",
          "marks": []
        },
        {
          "_type": "span",
          "text": "theory",
          "marks": [
            "link-0"
          ]
        },
        {
          "_type": "span",
          "text": ", this means that if you prefer a bolder-tasting, more viscous shot-otherwise known as a “ristretto shot,” you can adjust the amount of coffee to liquid espresso from a standard ratio of 1:2-1:3 (18 grams in/36-54 grams out) to a 1:1-1:2 ratio (18 grams in/18-36 grams out). If want a shot that allows you to taste the individual notes and the uniqueness of lighter roasts or single-origins, you can use a larger than standard ratio of 1:3-1:4 (18 grams in/54-72 grams out, what is appropriately called a “long shot.”",
          "marks": []
        }
      ],
      "markDefs": [
        {
          "_key": "link-0",
          "_type": "link",
          "href": "https://www.youtube.com/watch?v=Jjfxr24iuuw"
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "The ability to select your brew-ratio, combined with the ability to select your grind size (and thus influence the time it takes to pull your shot), as well as determine your water temperature, make up the tripartite that can most influence your results when making espresso. Whether it be that you pull a great espresso shot, an over-extracted or an under-extracted shot, most of the time these are the factors that most impact your results. Having a manual machine thus gives you leverage over the entire espresso making process, greater enabling you to understand how the process and theory works, learn from your mishaps, and adjust your inputs for better outcomes.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "In contrast, automatic machines (like the ones you might find at Starbucks and other grab-and-go cafes), involve little more than monotonously filling it with a bag of beans and pressing a few buttons. Manual machines, thus, are more difficult to operate, require more patience (and time) and force you to understand the theory behind what you’re doing. That said, for the purposes of cranking out 15 drinks in 15 minutes, an automatic machine is more appropriate given the demands of fast-food coffee shops. However, because there’s no manual ability to adjust the brew ratio or the brew-time, automatic machines don’t give baristas the freedom to exercise control over the espresso making process, which can then create greater inefficiency’s down the road. If the machine has a malfunction and pulls a shot greater than the ratio than intended (known as “bad shots” in Starbucks nomenclature) there’s nothing you can do other than have the machine adjust the grind size and wait for it to recalibrate. Sometimes this can take minutes (not seconds), with a full line of busy ",
          "marks": []
        },
        {
          "_type": "span",
          "text": "I’m-late-for-work-ready-to-get-out-the-door",
          "marks": []
        },
        {
          "_type": "span",
          "text": " customers, and stall to no avail. Furthermore, because everything is automatic, there’s no need for Starbucks to train it’s barista’s the theory behind how to calibrate an ideal shot (by weight, time, and temperature), despite the fact that they charge much more than most lesser known third-wave coffee shops.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Alas, there’s a counter-efficiency that comes from relying too heavily on automatic processes over manual ones. It’s certainly more efficient in that you can simply press a button (metaphorically and literally) and it (generally) works. In addition, you don’t need to learn (or train people) the theory or the epistemology behind how and why something works, just how it operates. So it saves time and money, in the short run. But, if the machine or process is pulling bad shots (literally or figuratively), if some ambiguous factor occurs that’s not expected, or if something breaks, then you often have pay someone else to fix it for you, and you lose assets in the time it takes for it to be repaired.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Robert M. Pirsig applies this concept to mechanics in his famous book: ",
          "marks": []
        },
        {
          "_type": "span",
          "text": "Zen and the Art Of Motorcycle Maintenance",
          "marks": [
            "link-0"
          ]
        },
        {
          "_type": "span",
          "text": ". In the book, our narrator’s friend, John Sutherland, doesn’t learn how to maintain his new expensive motorcycle. Refusing to go through the seemingly tedious task of mechanical work (and learning the theory behind it), John inevitably becomes frustrated when he can’t fix his bike using the standard repair manual (which are often made by and for mechanics) and is forced to spend additional resources on professionals to fix the problem for him. In contrast, the narrator prefers to manually diagnose and maintain his motorcycle himself. This then requires him to master an understanding of the engineering of his bike, regularly assess and acknowledge when something is amiss, and learn how to diagnose and repair those problems himself when they inevitably come up.",
          "marks": []
        }
      ],
      "markDefs": [
        {
          "_key": "link-0",
          "_type": "link",
          "href": "https://www.amazon.com/Zen-Art-Motorcycle-Maintenance-Inquiry/dp/0060589469"
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Think about how this also applies to business and customer interactions where employees make daily decisions (often on the fly) that have far-reaching impacts. It’s certainly cheaper for ",
          "marks": []
        },
        {
          "_type": "span",
          "text": "Forever21",
          "marks": [
            "link-0"
          ]
        },
        {
          "_type": "span",
          "text": " to oppose full-refunds because it’s easier to tell a teenager to “always deny a refund when asked,” than it is to train them to assess situations and use good judgement to decide on their own what merchandise is acceptable for a return and what isn’t. And it’s far easer to train people to ",
          "marks": []
        },
        {
          "_type": "span",
          "text": "always ask customers if they’d like a sample",
          "marks": []
        },
        {
          "_type": "span",
          "text": " (or if they’ve heard about the latest sale), regardless of how they how many times they’ve walked by or told you they’re not interested. It’s hard to read from the script without being pernicious. If you just tell people what to say and how to act and what to do, it can appear disingenuous, subtly creating a divide between your service and your customers, ",
          "marks": []
        },
        {
          "_type": "span",
          "text": "not a connection",
          "marks": []
        },
        {
          "_type": "span",
          "text": ". It also creates employees who, without the freedom to make decisions on their own, often feel like their employers believe they lack the capacity to do so, which sets the the standard for an apathetic, indifferent, and passive workplace culture.",
          "marks": []
        }
      ],
      "markDefs": [
        {
          "_key": "link-0",
          "_type": "link",
          "href": "http://www.forever21.com/CA/CustomerService/CustomerService.aspx?br=f21&content=returns"
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "On the flip side, if you can find ways to give more responsibility to those you lead, allowing them to make decisions and communicate autonomously (not automaton-ly) you’ll command greater respect. Not only that, you’ll create teams that are both adaptable and innovative, with a culture that encourages and rewards people who assess and address situations and problems on their own. With the freedom to make their own decisions instead of relying on a manual, your teammates will be more independent and ",
          "marks": []
        },
        {
          "_type": "span",
          "text": "self-motivated",
          "marks": [
            "link-0"
          ]
        },
        {
          "_type": "span",
          "text": ", as well as more efficient and productive. Furthermore, you’ll create at atmosphere that allows your employees to not only treat your customers with respect, but encourages them to treat different people differently. By not following the same script for every person, your team can greatly personalize experiences, whether it be taking an extra step in delighting your greatest fans, or finding creative ways to show empathy for those who feel left out.",
          "marks": []
        }
      ],
      "markDefs": [
        {
          "_key": "link-0",
          "_type": "link",
          "href": "https://www.youtube.com/watch?v=nnc1hmZLwOY"
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Consider how Ritz-Carlton gives their employees an ",
          "marks": []
        },
        {
          "_type": "span",
          "text": "allowance",
          "marks": [
            "link-0"
          ]
        },
        {
          "_type": "span",
          "text": " to spend on each customer to resolve complains and complications ",
          "marks": []
        },
        {
          "_type": "span",
          "text": "without enlisting a manager",
          "marks": []
        },
        {
          "_type": "span",
          "text": ". Not only does this ",
          "marks": []
        },
        {
          "_type": "span",
          "text": "empower",
          "marks": [
            "link-1"
          ]
        },
        {
          "_type": "span",
          "text": " their employees to rectify customer service related issues on their own, but it creates the expectation that the Ritz values it’s customers far more than the transaction. Perhaps most importantly, it creates the expectation that “we do things and treat people like this around here” for the entire organization. This is a far more responsibility than most managers (and organizations) are willing to extend to their employees, which is why most organizations feel like a bureaucratic oligarchy and not like a mix of friendly easygoing people. I’m not saying there’s no pressure in delegating the entire customer service experience to your latest recruits, but when looking at it from the long view, it is many times more worth it.",
          "marks": []
        }
      ],
      "markDefs": [
        {
          "_key": "link-0",
          "_type": "link",
          "href": "https://www.youtube.com/watch?v=aTA-unaF0Zc"
        },
        {
          "_key": "link-1",
          "_type": "link",
          "href": "http://customersthatstick.com/employee-empowerment/"
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Alas, there are pros and cons to both manual and automatic processes. If you’re trying to teach your kid arithmetic, I’d go manual, encouraging him to work it out in his head, without the help of a calculator. After all, you’re teaching him the basic manipulation of numbers, it’s the problem solving skills your after. If instead, you simply need a good estimate, such as the yield of corn you’ll get in this years harvest, use a ",
          "marks": []
        },
        {
          "_type": "span",
          "text": "calculator",
          "marks": [
            "link-0"
          ]
        },
        {
          "_type": "span",
          "text": ". You don’t necessarily need to know the theory behind how the math works to get a accurate indication and put it to good use.",
          "marks": []
        }
      ],
      "markDefs": [
        {
          "_key": "link-0",
          "_type": "link",
          "href": "https://www.vcalc.com/wiki/WillieLantz/Corn+Yield+Estimation+Calc"
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "This really comes down to what you value in the long run. If you want to know how to pull a great shot (or make a excellent latte), go manual and learn espresso theory. If not, use a Keurig or go to Starbucks or use an automatic machine. If you want to tune up your bike or your car without the help of an expert, go the manual route and learn as much as you can yourself. If you’re not a fan of regular oil changes or tire rotations or just getting your hands dirty, lease one (it’s more ",
          "marks": []
        },
        {
          "_type": "span",
          "text": "economical",
          "marks": [
            "link-0"
          ]
        },
        {
          "_type": "span",
          "text": "). If a workplace that retains employees as much as it retains your customers matters to you, empower your employees by giving them the leverage to make decisions and hold themselves accountable for their actions. Either route, their’s a risk and a cost. What matters is which one your betting on.",
          "marks": []
        }
      ],
      "markDefs": [
        {
          "_key": "link-0",
          "_type": "link",
          "href": "https://www.outsideonline.com/2159701/why-you-should-never-buy-used-adventuremobile"
        }
      ]
    }
  ]
}