{
  "title": "On overcoming our attachment to material and psychological sunk costs",
  "slug": "on-overcoming-our-attachment-to-material-and-psychological-sunk-costs",
  "publishedAt": "2017-03-30T10:44:17.000Z",
  "excerpt": "According to  Investopedia  a “sunk cost is a cost that cannot be recovered or changed and is independent of any future costs a business may incur.” In regard to decision-making: “since decision-makin",
  "image": "",
  "readTime": "5 min",
  "content": [
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "According to ",
          "marks": []
        },
        {
          "_type": "span",
          "text": "Investopedia",
          "marks": [
            "link-0"
          ]
        },
        {
          "_type": "span",
          "text": " a “sunk cost is a cost that cannot be recovered or changed and is independent of any future costs a business may incur.” In regard to decision-making: “since decision-making only affects the future course of (a) business, sunk costs should be irrelevant in the decision-making process.”",
          "marks": []
        }
      ],
      "markDefs": [
        {
          "_key": "link-0",
          "_type": "link",
          "href": "http://www.investopedia.com/terms/s/sunkcost.asp"
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Of course, everyone (not just businesses) experiences sunk costs. When we buy something and it breaks unexpectedly. When we invest in something that doesn’t pan out. Or when we’ve worked so hard on a project (or blog post) that doesn’t resonate with our audience.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "These are things we’ve invested either time or money or effort unto, and it can be hard to sit back and experience the discomfort of having invested in them (in the past) without having experienced any upside (in the present). Indeed, it’s so uncomfortable that many people would rather ",
          "marks": []
        },
        {
          "_type": "span",
          "text": "continue",
          "marks": []
        },
        {
          "_type": "span",
          "text": " to invest in them, pouring their money or resources or time into the things they’ve already “invested” in, even if there are better ways to invest their money or effort elsewhere.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "So we pay $800 to fix a broken car we bought used for $3,500…even though in 8 months something might break again. Or we continue to invest in a company or a commodity even though our investor friends say it’s a bad move…but hey, you’ve already invested half you’re life savings. Or we continue to produce a bad movie because you’ve already invested hundreds of hours of time and money into the mediocre storyline and eye-candy visuals.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "And it’s not just with our finances either. We experience a form of psychological sunk cost whenever we encounter information that contradicts our beliefs. Often a significant part of our identity is attached to a specific mode of thinking (religion, politics, our views on education or climate change, etc.) and so we experience a form of psychological discomfort (",
          "marks": []
        },
        {
          "_type": "span",
          "text": "cognitive dissonance",
          "marks": [
            "link-0"
          ]
        },
        {
          "_type": "span",
          "text": ") whenever we encounter information that contracts our worldview (whether it’s scientifically valid or not). Moreover, because we’ve already chosen to embrace that belief, many of us see those beliefs being challenged as psychological sunk costs, and generally choose to reject any and all information that does not support those beliefs. The opposite is also true, when met with information that supports our beliefs, we generally embrace it rather than try to disprove it. This phenomenon is known in psychology as ",
          "marks": []
        },
        {
          "_type": "span",
          "text": "confirmation bias",
          "marks": [
            "link-1"
          ]
        },
        {
          "_type": "span",
          "text": ", and is one of the most catalogued and tested psychological tendencies. It also happens to be one of the main reasons why for many people, ",
          "marks": []
        },
        {
          "_type": "span",
          "text": "facts don’t change our minds",
          "marks": [
            "link-2"
          ]
        },
        {
          "_type": "span",
          "text": ".",
          "marks": []
        }
      ],
      "markDefs": [
        {
          "_key": "link-0",
          "_type": "link",
          "href": "https://en.wikipedia.org/wiki/Cognitive_dissonance"
        },
        {
          "_key": "link-1",
          "_type": "link",
          "href": "https://en.wikipedia.org/wiki/Confirmation_bias"
        },
        {
          "_key": "link-2",
          "_type": "link",
          "href": "http://www.newyorker.com/magazine/2017/02/27/why-facts-dont-change-our-minds"
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Of course, we don’t continue to invest in sunk costs when we’re not the ones incurring them. We wouldn’t, for example, advise our best friend to continue a relationship with someone that is clearly making them a nervous wreck. Or tell someone to invest the rest of their life savings in what they thought 6 months ago would be the next unicorn, when time has shown it’s clearly not. This is because we’re not emotionally attached to these things. We see the big picture, we’re not attached to an outcome, and we haven’t experienced all the emotions our advisee has or is experiencing. We haven’t dreamt about marrying this person or been through all the experiences we’ve shared with them. And we haven’t dreamed about how rich we’d be if your unicorn quadrupled our investment, and we don’t experience any discomfort because we haven’t lost any money. This is why the cognitive scientists Hugo Mercier and Dan Sperber, authors of ",
          "marks": []
        },
        {
          "_type": "span",
          "text": "The Enigma of Reason",
          "marks": [
            "link-0"
          ]
        },
        {
          "_type": "span",
          "text": ", and formost experts on this topic prefer the term “myside bias” as opposed to confirmation bias. They point out that “humans aren’t randomly credulous. Presented with someone else’s argument, we’re quite adept at spotting the weaknesses. Almost invariably, the positions we’re blind about are our own.”",
          "marks": []
        }
      ],
      "markDefs": [
        {
          "_key": "link-0",
          "_type": "link",
          "href": "https://www.amazon.com/Enigma-Reason-Hugo-Mercier/dp/0674368304"
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "That’s the rub isn’t it? We’re blind to our own positions because we’re attached. Any time we experience sunk costs and find ourselves continuing to invest in them, whether they be material assets or investments or relationships or beliefs, we’re emotionally attached to these things and these outcomes. Our friends aren’t. Neither are our kids or our coworkers. Unless of course you all belong to the same tribe, in which case you (whether your a political party or a congregation or a family or a business) might be experiencing a sort of group confirmation bias, as is often the case.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "I think herein lies the solution though: whenever you find yourself attached to any form of what might be considered a sunk cost, whether it’s psychological or material, go tell your friends about it. See what they think. And if all your friends think the same way you do, go ask a coworker, or a psychiatrist, or your Uber driver or a complete stranger (or five). Go find someone that outright disagrees with you. Then sit down, shut up and listen to their mode of reason. Get a fresh perspective, one that’s not attached to your viewpoint, or outcome dependent fetish.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Then sleep on it. Meditate on it. See the facts. Take everything into account (even what makes you uncomfortable). Sit with the discomfort of what it feels like to be wrong (even if you still think you're not), and try to see your world as it would be if you agreed that your former point of view was fallacious. What would that look like? What would that feel like? How would you cope? What would you change?",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Make a decision from there.",
          "marks": []
        }
      ]
    }
  ]
}