{
  "title": "On redefining our past and making peace with it",
  "slug": "on-redefining-our-past-and-making-peace-with-it",
  "publishedAt": "2016-02-18T23:53:25.000Z",
  "excerpt": "I was just looking at some old photos on Facebook and I realized that for the first time ever I sort of experienced nostalgia and nothing else.",
  "image": "",
  "readTime": "2 min",
  "content": [
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "I was just looking at some old photos on Facebook and I realized that for the first time ever I sort of experienced nostalgia and nothing else.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Before, I'd look back with some twinge of regret, reflecting on all the things I could have done but didn't, as well as the person I might have been, if I only knew then what I know now.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Thing is, the action (or in-action) I took then was very much a reflection of the narrative I had going on in my head. My interpretations of events and my circumstances dramatically altered how I approached my life, and led me to become the person I was, and person I would later become.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Of course, my thinking then was the result of the culture I was born into and adopted as my own.  After all, the very language we use to communicate ideas was created by other people. Why should we assume our beliefs about how the world works as well as our beliefs about ourselves and our capabilities be any different? We are just as much byproducts of our environments as our worlds are influenced by our actions. And so, I can't blame myself for who I was then and the actions I didn't take.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "But I can't blame the world either. It's not their fault I missed out. It wasn't their responsibility to teach me how to live my life or see the world as it is.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "What I'm getting at here is that, the past is who I was then. And who I was then is just as much a part me and the story I have to tell as who I am now. Your past is a large part of your story too, and it's your right to own it. To learn from it. To grow from it. And to use it to mold you into a better person now. You shouldn't spend the rest of your present fighting it. Or fighting yourself because you didn't know any better and made some seriously bad choices. You were you, and there's nothing you can do about it looking backwards.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "The past is the past. But it's also who you were. And it's a part of your story, you're narrative, your life.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "My advice: Accept it. Own it. Make it meaningful and embrace it. And revolutionize your present because of it.",
          "marks": []
        }
      ]
    }
  ]
}