{
  "title": "On sugar and preserving good taste",
  "slug": "on-sugar-and-preserving-good-taste",
  "publishedAt": "2017-02-10T12:26:11.000Z",
  "excerpt": "I've long had a tendency to eat milk chocolate morsels. I freeze the bag, then grab a handful (or several) from time to time. Until yesterday, I’ve always attributed this vice to my love of chocolate.",
  "image": "",
  "readTime": "4 min",
  "content": [
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "I've long had a tendency to eat milk chocolate morsels. I freeze the bag, then grab a handful (or several) from time to time. Until yesterday, I’ve always attributed this vice to my love of chocolate. And yet (as I discovered) if I take a bite of a frozen 85% cacao chocolate bar, it just tastes gross. Alas, I think my enjoyment has less to do with chocolate and more to do with sugar.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Sugar sucks. Our brains have been hardwired to crave the stuff, and yet, as research has shown, sugar (not fat) makes us fat. That being said, for the purpose of this post, I want to focus more on what it does to taste.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Most people (not all) can’t stomach the taste of 85% cacao dark chocolate any more than they can appreciate the subtleties of a cup of black single-origin coffee. Why is that?",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Personally, I think it has to do with sugar. Because since we were kids, it’s been normal to eat fruit and fruit juice and waffles and pancakes for breakfast. It’s okay to grab a frappaccino at Starbucks every thursday. And it’s traditional to consume candy (on halloween, valentines day and easter), cookies (on christmas) and cake (not only on your birthday, but everyone else’s too). And don’t get me started on soda.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Sugar permeates the American diet. And we’ve created a culture where it’s okay to consume it in excess. We would never tell a twenty-two year old to go out and not be considerate of their alcohol intake. But for some reason it's apparently \"okay\" (albeit not great) for a kid to eat a ",
          "marks": []
        },
        {
          "_type": "span",
          "text": "brownie",
          "marks": [
            "link-0"
          ]
        },
        {
          "_type": "span",
          "text": " alongside a ",
          "marks": []
        },
        {
          "_type": "span",
          "text": "milkshake",
          "marks": [
            "link-1"
          ]
        },
        {
          "_type": "span",
          "text": " disguised as a coffee beverage? When combined, that’s almost 4 times more than the American Heart Associations prescribed daily ",
          "marks": []
        },
        {
          "_type": "span",
          "text": "limit",
          "marks": [
            "link-2"
          ]
        },
        {
          "_type": "span",
          "text": "! ",
          "marks": []
        }
      ],
      "markDefs": [
        {
          "_key": "link-0",
          "_type": "link",
          "href": "https://www.starbucks.com/menu/food/bakery/double-chocolate-brownie"
        },
        {
          "_key": "link-1",
          "_type": "link",
          "href": "https://www.starbucks.com/menu/drinks/frappuccino-blended-beverages/caramel-frappuccino-blended-beverage"
        },
        {
          "_key": "link-2",
          "_type": "link",
          "href": "http://www.sugarscience.org/the-growing-concern-of-overconsumption/#.WJ3juxiZOuk"
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Dietary guidelines aside, just think about what that does to your tastebuds. Like anything else, taste adapts. That’s why many japanese people prefer foods rich in umami and enjoy seafood. It’s why koreans love fermented foods like kimichi. And why Americans love our burgers, fries and shakes. Culture defines taste, and we adapt alongside it. If you’ve been consuming more sugar than what is necessary all your life, you’re not going to “taste” slightly sweetened foods the same way people who eat a modest amount of sugar do. And so you might find yourself considering adding even more sugar to foods and beverages that already contain more sugar than need be, because it’s apparent (to you) that what you’re consuming is not as sweet as it should be.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "What of the humble chef? What about the the people who understand what great food is, who have good taste that’s been honed through many years of experience, who make food with intention, and who earn a livelihood based on their restaurants reviews? Should he add more sugar to his pasta bolognese because he knows more people will buy it if he does. Or should he go with his instincts, make it the way he thinks it should taste, attempt to bring out the flavor of the tomatoes as opposed to masking the flavor with added sugar? Is he doing his patrons a disservice by not making the sauce the way he knows most people will like it? Or are we doing him a disservice by unconsciously altering our tastebuds so that we crave more sugar than is necessary?",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "There’s no easy way to answer these questions. I think that’s up to you. But I will say that I feel like I’m personally missing out. I want to be a dark chocolate cognoscente just as much as my wine-feen friends want to be amateur sommeliers. And I want to know where my single-origin coffee comes from just by taking a swig. And I want to appreciate the intentions and subtleties of sweetness a great chef showcases in his dishes, whether it be pasta sauce or gâteaux. Taste is an extraordinary gift, and I’d prefer to experience it in it’s most natural and unassuming state.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Also! Somewhat related advice: If you don’t eat sweets, you won’t crave them.",
          "marks": []
        }
      ]
    }
  ]
}