{
  "title": "On self assurance the bibliophiles actualization fallacy",
  "slug": "on-self-assurance-the-bibliophiles-actualization-fallacy",
  "publishedAt": "2015-10-26T12:08:21.000Z",
  "excerpt": "It occurred to me the other day upon reflecting on my enormous book collection (it’s 200+ at the moment) that no amount of future reading will ever make me the man I want to be in this world.",
  "image": "",
  "readTime": "5 min",
  "content": [
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "It occurred to me the other day upon reflecting on my enormous book collection (it’s 200+ at the moment) that no amount of future reading will ever make me the man I want to be in this world.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "That’s not to say that reading won’t inform the decisions I make or shape my worldview or make me a more intelligent person. It’s just that no amount of reading will directly change my life.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "In fact, books generally don’t change people’s lives. People change their own lives. Books may be a catalyst for that change, but at a fundamental level, change takes place by taking action. Small consistent action, over time. And books, by themselves, can’t do that sort of thing.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "So that said, why do I continue to buy more books, specifically self-help/personal growth nonfiction books? Why is it that after 7 years of amassing a collection of 200+ books, 95% of which can be classified as self-help non-fiction, and having read only about 20% of those, do I continue to check the self-improvement section of my local used bookstore every two weeks?",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "For one, it’s because I enjoy reading the subject. It does, in my view, make me a more conscientious informed individual and I like to think a better person in the long run. I also like to joke that the people that most read self-help books don’t need to, and those who don’t really should, which is true. But the second reason is something I never quite considered until this moment in time: the reason I continue to buy more of these types of books is that I continue to hope that this book, whatever the next book I pick up, will make me a better person, and change me in such a way that it could be said it was “life-altering.”",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "You see, I collect an enormous amount of books as well as podcasts, audio-books, digital manifesto’s and now, magazines, all of which can be classified under the genre of self-help non-fiction. The sub-genre could be anything from psychology to fitness to mindfulness to developing creativity or open-mindedness, but at its root it’s mainly a program designed to help people learn something that will (hopefully) change their lives.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Books give me hope. Hope to change. Hope to grow. Hope to lean into fear and discomfort. And above all hope for a better future. Every time I purchase another book I’m investing in that future, a future where I am my own best self, and one where my life, which is a byproduct of my actions, reflects that.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "But like I said, books don’t change lives. Even if I had time to read all the books I own, and listen to all the audiobooks and podcasts, I wouldn’t be any better off than I am now. I wouldn’t be any more sure of my ability to make change happen in my life than I am in this moment. So why do I continue to buy more books?",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "I think it’s because books provide reassurance. Or better yet, hope of reassurance. What I think I’m getting every time I buy another book is the permission to take risks, to make mistakes, and to make my vision for my future self and lifestyle a reality. My hope is that every book I pick up will equip with the qualities I need to actualize my dreams and take what appears to me as risks.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Of course, if I really want to change, and I’m honest enough with myself, I’d recognize that what I’m really doing is using the search for more reassurance through bibliophilia as a way to hide. Because no amount of reading will provide me with the reassurance (or courage) I need to make real change happen in my life. The onus is on you. A book can’t do the hard work for you. But as long as you continue to believe that it will, you’ll continue to buy and read more books so you don’t have to do what feels like a risk.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Alas, no book has ever directly made a man capable of overcoming life’s obstacles. A book may have changed the way he thought, but never provided him with the courage and grit and passion to live the life he was mean’t to.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "My advice (in retrospect): Stop looking for reassurance. Stop looking outside of yourself for the qualities you think you need to make real change happen. Whether it’s talking to strangers or making a ruckus at work or doing something you’ve never done for the first time, don’t make the mistake of thinking a book is going to give you the reassurance you need to take these risks.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Certainly, subscribe to a different way of thinking about your life and your problems. But don’t go looking for a way to hide from what you fear. Instead, lean in and just do it.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "That’s the only way change works.",
          "marks": []
        }
      ]
    }
  ]
}