{
  "title": "On seeking out passion for your dead end job",
  "slug": "on-seeking-out-passion-for-your-dead-end-job",
  "publishedAt": "2017-01-05T11:14:03.000Z",
  "excerpt": "It’s very easy to get caught up in the day to day busywork of your job and lose interest in what you’re doing. Maybe you started out thinking “this is the job for me,” you shared the companies values,",
  "image": "",
  "readTime": "5 min",
  "content": [
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "It’s very easy to get caught up in the day to day busywork of your job and lose interest in what you’re doing. Maybe you started out thinking “this is the job for me,” you shared the companies values, you liked what you were doing, it payed well. Or maybe you’re doing something you’re not particularly passionate about, but it pays the bills. Whether or not you start out interested from the get go or you never really had any interest at all, point is you come to a point where you wake up one day and realize this isn’t the job for you.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Obviously, this is crossroads. Certainly you can find another job. You probably deserve it. And if you don’t find one now, you might never. You might end up doing this gig for a very long time, so it’s probably in your best interest to find a new one, a better one, one that you’re really truly undeniably passionate about. It’s got to be something that just speaks to you. Like when your high school mate who never stopped humming pop tunes finally decided he’d become a musician. Or when your fashionista bff decided to start a fashion blog a make a big scene on the intarwebs.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "You’re second choice, no doubt, is keep at it. But maybe instead of slogging away at work, you find ways to make it meaningful for you. Maybe you can create passion out of nothing. Maybe you can make your “dead-end boring waste of time and effort, just pays the bills job” a little more exciting, interesting, dare I say “fun”. And most important, important. Important to the people who rely on you (whether their cognizant of it or not). And important to you, because you’re making a difference (however small) to people who one day, might be grateful for it.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "I’m somewhat of a skeptic when people say a job or a career choice just “spoke to them.” It seems a little made up, how can you be genetically or culturally predisposed to love doing a certain job? I say this because if you go somewhere where people make a living doing something not particularly fun (like stocking groceries or making caffe lattes around the clock) or even exceptionally labor-intensive stuff (like coal-mining) you never cease to find the outliers. There are people who (believe it or not) enjoy what they do in these jobs. They see how what they do makes a difference, and they actively find ways to enjoy what their doing.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Maybe you have someone that’s built a reputation doing a particular task extraordinarily well (whether it be making latte art or keeping the freezer organized or connecting with their customers). Or maybe they’ve built a habit out of speaking up and acting as a catalyst for new ideas and insights in meetings. Maybe their a teacher that (despite their dissatisfaction for the broken education system and intolerance for disengaged students) creates passion out of helping young people write better or clearly articulate their thoughts. In all these scenarios (there are plenty more) ordinary people have found ways to see their seemingly boring jobs in a new light. To create passion and meaning by actively seeking out ways to be generous and kind and useful to their organization and to the people who deserve it.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Certainly, you can look at your job and chose to despise it (whether it be because of the boring slog work or your “incompetent” coworkers or your ungrateful managers). You always can find a new job (and I’m not arguing that you shouldn’t). But you can also choose (you always have a choice) an alternative route. You can choose to seek out ways to be more engaged, more insightful, more motivated and more positive about whatever it is you do. It’s an attitude and a practice.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "You can rehearse all the things you hate about your job, or choose to actively look for (make a ",
          "marks": []
        },
        {
          "_type": "span",
          "text": "list",
          "marks": [
            "link-0"
          ]
        },
        {
          "_type": "span",
          "text": ") all the things you're job provides you, as well as the opportunities you have to make a difference by being there. Or find something (anything) that makes you engaged and excited to go to work in the morning. Maybe it’s connecting with your coworkers or customers, maybe it’s learning new skills, maybe it’s doing a quality job not because you might get payed more to do it better (you won’t), but because you can, because you choose to care.",
          "marks": []
        }
      ],
      "markDefs": [
        {
          "_key": "link-0",
          "_type": "link",
          "href": "https://www.youtube.com/watch?v=0XC_Fkg0UIQ"
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Our jobs are platforms to be generous, to change people, and to care about what we do and what we create. You can hate it, you can resent it, you can slog through it. Or you can choose, to the best of your ability, to make your own contribution, your own mark, your own dent in your corner of the world.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "It’s your choice. Always has been.",
          "marks": []
        }
      ]
    }
  ]
}