{
  "title": "On the benefits of having a personal trainer",
  "slug": "on-the-benefits-of-having-a-personal-trainer",
  "publishedAt": "2017-02-17T13:59:47.000Z",
  "excerpt": "Today was my last day having a personal trainer at my gym. Hard to believe I’ve been meeting him since August, 2015. Time sure flew by, I learned a ton, and I lost 50 pounds to boot. Alas, here are so",
  "image": "",
  "readTime": "3 min",
  "content": [
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Today was my last day having a personal trainer at my gym. Hard to believe I’ve been meeting him since August, 2015. Time sure flew by, I learned a ton, and I lost 50 pounds to boot. Alas, here are some things I learned from the experience.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "listItem": "number",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Having an accountability partner is a great way to get you to stay committed to just about anything, especially going to the gym consistently. There were a lot of days when I woke up or got off work and didn’t want to go workout, and if I hadn’t already scheduled a session I may not have. I may have then been tempted to skip the next day and the next. And so what may have started as me simply taking one day off might have led me to take weeks off, thereby resetting my progress and amplifying discouragement. When you have someone who keeps you accountable to your goals, you go even when you don’t feel like it. Just knowing he was going to notice if I was there or not (especially on the days we didn’t meet), encouraged me to go even when I didn’t feel like it. And so I continued to continue to go, I made it a habit and I made progress over time.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "listItem": "number",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "I payed $160 a month to meet one day for 30 minutes each week. When you factor in the cost of my gym membership ($30), I was really paying about $6.00 a day to go to the gym. Indeed, the profit margin must be huge. I don’t know about your income, but to a entry-level retail salesman and part-time Starbucks barista, that was a substantial amount of my disposable income, and it was a pretty big bet on my ability to make a personal change to my post-engrained lifestyle. In retrospect, I realize that was far too much money to pay for a such a small amount of time and attention. Attention that at some times wasn’t 100% focused on me. That said, because I payed such a huge upfront cost like I did, I was much more committed to working out regularly, changing my habits, and proactively learning as much as I could while I was there. Maybe the same will apply to you.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "listItem": "number",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "One unexpected benefit of having a personal trainer is, if you like them (and you should), they make great friends. Having someone who you see on a regular basis, who isn’t a coworker, and who encourages you to learn and grow daily, is an invaluable resource. Because you’re both there to better yourselves, you often find yourself talking about all sorts of interesting things, from the latest science in fitness, psychology, health or nutrition, to other things like relationships, recipes, routines, helpful habits, and good books/media. Obviously, you don’t need a personal trainer necessarily, but having someone who meets the above criteria and who supports you to make positive changes in your life is a great connection to have.",
          "marks": []
        }
      ]
    }
  ]
}