{
  "title": "On the suitability of standing applause a rant",
  "slug": "on-the-suitability-of-standing-applause-a-rant",
  "publishedAt": "2017-07-20T11:31:48.000Z",
  "excerpt": "Went to a solo saxophone concerto performance my brother did a few weeks ago. It was  spectacular  and I think he did a fabulous job.",
  "image": "",
  "readTime": "7 min",
  "content": [
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Went to a solo saxophone concerto performance my brother did a few weeks ago. It was ",
          "marks": []
        },
        {
          "_type": "span",
          "text": "spectacular",
          "marks": [
            "link-0"
          ]
        },
        {
          "_type": "span",
          "text": " and I think he did a fabulous job.",
          "marks": []
        }
      ],
      "markDefs": [
        {
          "_key": "link-0",
          "_type": "link",
          "href": "http://cvnc.org/article.cfm?articleId=8548"
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Alas, right before my brother performed, they had this 40-something prodigy of a violinist on stage. She was, by all accounts, masterful at her craft and a joy to watch perform. So of course, as a natural matter of consequence, she received a standing ovation by everyone in the crowd.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "But then my 23 year old brother gets on stage a little while later, does an amazing performance (far better than 99% of the people in the audience could have) and only a few people stand up. Friends, family, colleagues, maybe a few people who liked it or felt a twinge of social pressure.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "I understand that to a degree this is the result of culture. Saxophones, for one thing, haven’t been around long enough to gain entry into full orchestral ensembles. It’s a contemporary instrument, and it brings with it all the modern connotations of jazz. For the traditionalist, it might at very least be seen as an detraction from the art, and at most, a significant challenge to the status quo.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "But I don’t think that was the case here. Because even among people who regularly attend classical music performances, most are not critics. But everyone is a social creature, not without our capacity to be deeply attuned to the expectations of others; ever cognizant of social norms and our fear of stepping out of line. “People like us do things like this,” is more than a phrase, it’s how just about everyone you will ever know navigates their social worlds.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "As a culture, we’re also fascinated by outliers. We’re all so very engaged in the extravagance of someone who without a reason of a doubt is amazing at what they do. Someone who, at least within their respective social world, ",
          "marks": []
        },
        {
          "_type": "span",
          "text": "is",
          "marks": []
        },
        {
          "_type": "span",
          "text": " a celebrity. Who does what they do with such elegance, such masterful attention to their craft, it can almost be described as effortless. When we see someone do something like that, something that seems so complex to us with such grace, such precision, such excellence, we can’t help but be enthralled. It’s only natural to want to praise them, to remark on the remarkable. And so in the world of live performance, that means that you stand up and give thunderous applause.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "But that also means that if someone else gets on stage in the same venue who doesn’t captivate you in much the same way (because that’s something else we’re wired for: comparison of alternatives), you don’t go crazy and act like a pre-pubescent fan-girl at a Bieber concert. Sure it may have been a good performance, but showing that much excitement is far too great an investment of effort and energy and social-risk. It might take away from the esteem granted to the expert. And worse, it might provoke your friends or peers. Far better to be a jaded hipster, by default, than it is to be an enthusiastic cheerleader.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "So we, as a collective culture, would rather lionize the prodigy. Someone who, by definition, has been doing this all her life. Who has most likely had a standing ovation for every performance she’s ever completed since the age of six. Who’s so good, in fact, at both the performance of her instrument and of performing in front of a crowd, that it can scarcely be said she’s experiencing the same psychological exposure as the average performer. ",
          "marks": []
        },
        {
          "_type": "span",
          "text": "How do we know she’s even trying?",
          "marks": []
        },
        {
          "_type": "span",
          "text": " She could just as much be performing from the time she walks in to the time she leaves? She might be ",
          "marks": []
        },
        {
          "_type": "span",
          "text": "that",
          "marks": []
        },
        {
          "_type": "span",
          "text": " good.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "And of the amateur? Well, we’ll just sit here and clap our hands together as if our six year old nephew showed us a magic trick. He has the support and encouragement of his friends and family and maybe a few onlookers, surely we don’t need to stand up and go wild. It’s not worth the investment.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Is it?",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Isn’t the point of clapping to express support and praise and respect? It’s what you do, it’s expected. Here you are, after just watching this guy is do something that clearly makes him vulnerable, after having performed in front of strangers, doing something that probably took weeks of preparation, consecutively after a world-renowned artist, and you’re ",
          "marks": []
        },
        {
          "_type": "span",
          "text": "not",
          "marks": []
        },
        {
          "_type": "span",
          "text": " going to give him the kind of praise he deserves?",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Maybe I’m too much of an idealist. But when I see anyone do something impressive, something I would never attempt, especially if their just starting out or solo on-stage, I think they deserve the same sort of appreciation and praise as any professional.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "What good does it do her? What value do you give her if you just contribute to the same post-performance routine she’s experienced and quite possibly rehearsed after every one she’s ever given? What good does it do her self-esteem if you just smear on more praise?",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "I’m not saying she doesn’t deserve a standing ovation. I’m just saying I think the “beginner” deserves one just as much if not more. Just think of the opportunity: what value could you possibly create in the act of simply standing up and clapping and giving ",
          "marks": []
        },
        {
          "_type": "span",
          "text": "him",
          "marks": []
        },
        {
          "_type": "span",
          "text": " your full appreciation and attention for five minutes?",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Well, you can give him the fuel he needs to continue to perform. To continue to work hard and practice and persist and make good art. To pursue this work as a professional. And to believe in a future where he might actually make his living from doing this thing he loves so much.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Certainly he’s responsible for his future. But there’s no such thing as a true meritocracy, and that applies just as much to how he got to be up there on stage as it does to where he goes from here. He might be a self-sufficient artist, but doesn’t mean he doesn’t need support, doesn’t thirst for praise, and doesn’t rely on the belief that he’s good at this thing he does to sustain his efforts to continue doing it.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "If you’re a member of the audience, ",
          "marks": []
        },
        {
          "_type": "span",
          "text": "that",
          "marks": []
        },
        {
          "_type": "span",
          "text": " is your responsibility. His is to simply stand up there and put on a show.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Make it count.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "*I want to point out that this rant and proposition isn’t solely for my brother. He’s capable (I’m sure) of continuing to push past the dip and continue sharing his art regardless of how most people think of him. But think about those of us who aren’t so confident in ourselves or our abilities? Think about if this was your kid up their on stage? My impression is, if you’re not willing to do it for someone else’s kid, you can’t expect that someone to do for yours. And so the cycle repeats itself. But if you stand up for every soloist who ever performs in front of you (even if you don’t particularly like what you see or hear) well, you’ll create a social expectation for others to stand up as well. That way, when your kid does get up on stage, he’ll be much more likely to get the applause and support he deserves.",
          "marks": []
        }
      ]
    }
  ]
}