{
  "title": "On two factor theory moods and cultivating optimism despite the opposition",
  "slug": "on-two-factor-theory-moods-and-cultivating-optimism-despite-the-opposition",
  "publishedAt": "2017-08-26T12:46:44.000Z",
  "excerpt": "Frederick Herzberg  discovered  50 years ago that creating a business culture where people enjoy being there is not the same as eliminating things in a workplace that cause discontent. ",
  "image": "",
  "readTime": "5 min",
  "content": [
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Frederick Herzberg ",
          "marks": []
        },
        {
          "_type": "span",
          "text": "discovered",
          "marks": [
            "link-0"
          ]
        },
        {
          "_type": "span",
          "text": " 50 years ago that creating a business culture where people enjoy being there is not the same as eliminating things in a workplace that cause discontent. ",
          "marks": []
        }
      ],
      "markDefs": [
        {
          "_key": "link-0",
          "_type": "link",
          "href": "https://en.wikipedia.org/wiki/Two-factor_theory"
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "The same principle holds true for general optimism and pessimism. Seeing things from a positive frame of mind is not simply seeing things with the absence of what makes you pessimistic. Therefore, being optimistic doesn’t necessitate that the things that make you critical or discouraged are less present in your life. The difference is your focus. You choose to see your circumstances (and the outcomes of your choices) very differently when you choose to be positive verses negative.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "My guess is you’ve had good days and bad days. What’s interesting is that the factors that you complain about that make your bad days bad (traffic jams, disrespectful people, rejection, critics, bad weather, ruined plans, broken appliances, etc.) are completely different from the reasons you have good days. And on the days you do have good days, it’s not like those things that you complain about on your bad days don’t exist. They do, it’s just that you started the day in a good mood and you’re now intentionally choosing to focus on and see things from a positive frame of mind.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Case in point: ever notice how on birthdays and holidays you (at least for me) generally see things more positively? We’re more resilient, more hopeful, more enthusiastic, and less prone to frustration, depression and apathy. Why’s that? I don’t think there’s anything different about my circumstances on my birthday compared to my circumstances a week before. The difference, I think, is that I want to be happy, so I choose to be much more proactive about my attitude and seeing things from hopeful and constructive frame of mind.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "To re-iterate: Optimism is not the elimination of all things that upset you, it’s simply a perspective by which you use to filter your experiences within your world, good and bad. You can have everything you want in life (a house, a car, close friends, a mate, a good job, etc.) and still find yourself frustrated or judgmental with the world or with yourself. You can have your dream car, so to speak, and still throw a fit about the traffic jam. And you can be affluent and intelligent and well liked and still (by focusing on the things you don’t have) be cynical, selfish, or pessimistic.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "On the flip side, you can also be poor or necessitous and still find joy and hope and meaning even the most mundane of experiences. Not all ",
          "marks": []
        },
        {
          "_type": "span",
          "text": "people",
          "marks": [
            "link-0"
          ]
        },
        {
          "_type": "span",
          "text": " in developing countries are despondent or morose, despite their lack of fortune and many of the things we would consider basic standards of living.",
          "marks": []
        }
      ],
      "markDefs": [
        {
          "_key": "link-0",
          "_type": "link",
          "href": "https://maptia.com/charitywater/stories/meet-tencia-mozambique-s-finest-bread-maker"
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Furthermore, when we do experience personal crises, we don’t stay dormant and disconsolate permanently. As ",
          "marks": []
        },
        {
          "_type": "span",
          "text": "Daniel Gilbert",
          "marks": [
            "link-0"
          ]
        },
        {
          "_type": "span",
          "text": " has pointed out, this is because when we experience personal setbacks, no matter how difficult, we lack the psychological energy to keep in our room brooding 24/7. Emotions and moods aren’t stagnate, they naturally change over time. Thus, moods, by there very nature, are temporary—conscious—states of mind fueled by a prevailing (and often settled) way of thinking. Alas, whether you’re intentional about it or not, you get to choose what thoughts you inculcate, and therefore choose the mood your in. You get to decide the default state by which you regularly operate in, focus on and fuel.",
          "marks": []
        }
      ],
      "markDefs": [
        {
          "_key": "link-0",
          "_type": "link",
          "href": "https://www.ted.com/talks/dan_gilbert_asks_why_are_we_happy"
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "You can, in fact, find yourself experiencing failure (or an extreme lack of fortune) in your external circumstances and still find the motivation to push yourself to work towards a better future. And you can be surrounded by what seems like all the bloodsuckers and denigrators and deplorable soothsayers of the world and still choose to see things from the basis of hopefulness.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "When it comes down to it, optimism is simply a tool — an intellectual choice to see things from a positive frame of mind. It’s a disservice to yourself and the world you were born into to throw your life and your values and your dignity up in the air because you’re discouraged. Or because the world is broken. Or because you didn’t get that job. Or because of something someone said. There’s nothing enlightening about intentionally making your world smaller. The truth is you have to actively work hard to find (and sustain) your light of optimism.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "As Maria Popova beautifully put it to cap off her ",
          "marks": []
        },
        {
          "_type": "span",
          "text": "10 Learnings from 10 Years of Brain Pickings (Reading, Writing and Living)",
          "marks": [
            "link-0"
          ]
        },
        {
          "_type": "span",
          "text": " post:",
          "marks": []
        }
      ],
      "markDefs": [
        {
          "_key": "link-0",
          "_type": "link",
          "href": "https://www.brainpickings.org/2016/10/23/10-years-of-brain-pickings/"
        }
      ]
    },
    {
      "_type": "block",
      "style": "blockquote",
      "children": [
        {
          "_type": "span",
          "text": "Don’t just resist cynicism — fight it actively. Fight it in yourself, for this ungainly beast lays dormant in each of us, and counter it in those you love and engage with, by modeling its opposite. Cynicism often masquerades as nobler faculties and dispositions, but is categorically inferior. Unlike that great Rilkean life-expanding doubt, it is a contracting force. Unlike critical thinking, that pillar of reason and necessary counterpart to hope, it is inherently uncreative, unconstructive, and spiritually corrosive. Life, like the universe itself, tolerates no stasis — in the absence of growth, decay usurps the order. Like all forms of destruction, cynicism is infinitely easier and lazier than construction. There is nothing more difficult yet more gratifying in our society than living with sincerity and acting from a place of largehearted, constructive, rational faith in the human spirit, continually bending toward growth and betterment. This remains the most potent antidote to cynicism. Today, especially, it is an act of courage and resistance.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Optimism is a choice. A courageous one. A choice that might not work as expected. But it’s a far better option the alternative. Defeatists and misanthropists, after all, rarely create lives worth living.",
          "marks": []
        }
      ]
    }
  ]
}