{
  "title": "On the tiny step technique for habit formation",
  "slug": "on-the-tiny-step-technique-for-habit-formation",
  "publishedAt": "2017-05-04T10:13:04.000Z",
  "excerpt": "I don’t even remember the last time I wrote a blog post.",
  "image": "",
  "readTime": "4 min",
  "content": [
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "I don’t even remember the last time I wrote a blog post.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "How do these things happen? You start a routine and then one day you stop and the next day you start a new routine, that being not doing the thing you wanted to do in the first place.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Habits are hard to create, and to break. Everyday I wake up and make coffee. I heat my water over a gas flame, I weigh the beans, grind them by hand, and make a pour over. I’ve even just started experimenting roasting un-roasted beans in a popcorn popper right before I use them, to make what is without a doubt the best coffee you could ever make at home. Point is, considering all the steps, and the fact that just 3 years ago I simply used a Keurig to make my coffee for me, it would seem like that was a difficult habit to create. But it wasn’t. It was easy, and it happened organically. I simply started making pour overs everyday and gradually added the other steps from there.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Alas, there a dozen or so other “habits,” that I simply haven’t had the same success creating: meditating, reading, writing, exercising, learning a new skill. I know that if I spent a half hour doing these things everyday my life would improve exponentially. And yet, despite my attempts at creating a routine and making time for these things throughout my day, I just can’t seem to put them on autopilot.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Looking back, I realize now it’s probably because I’m playing the short game. I want to do all these things now and reap the highest returns by doing all of them all at once. I’m exhausted. With trying to manage all the things I do in a day and make time for the things that make me healthy and happy and for cooking and eating and sleeping, and making time for my family and girlfriend and job searching, and working, maybe it’s too much.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Maybe it’s time I tried Dr. Fogg’s ",
          "marks": []
        },
        {
          "_type": "span",
          "text": "method",
          "marks": [
            "link-0"
          ]
        },
        {
          "_type": "span",
          "text": ".",
          "marks": []
        }
      ],
      "markDefs": [
        {
          "_key": "link-0",
          "_type": "link",
          "href": "https://www.youtube.com/watch?v=AdKUJxjn-R8"
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Find the smallest, most incremental change you can make, and commit to taking it everyday (at the same time) for the next 3 months.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Maybe it’s waking up and meditating first thing for one full minute. Maybe it’s going outside at noon and sprinting until you need a break, or writing a sentence in your word processor. Maybe it’s giving up processed food and sugar for dinner. Maybe it’s committing to floss one tooth every night, or reading a paragraph right before bed.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Certainly, you can attempt to go for a longer duration, whether it be reading a chapter from your book or writing a blog post or flossing all your teeth. But success (at least for the first 3 months) should be defined by the minimal effective dose, (i.e. getting one tooth flossed at the same time everyday).",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "What’s important is that you create habits first, before you decide to focus your limited energy, attention and time on making progress. Before they are formed, habits themselves (simply doing a set behavior at a specific time every day) require a lot of willpower and energy on our part. If you can’t push through the inertia of your current routine and build a tiny habit into your already busy (and for the most part) automated schedule, you’ll never be able to do that behavior long term for a longer duration. That is, if you focus all your energy on making progress before you’ve made a behavior automatic, your brain will simply view these behaviors as isolated incidents, as opposed to repeated behaviors that it should adapt and conform to. And so when you do take a day off (as you will inevitably do, because honestly, who has the time?) you (and your brain) will simply go back to it’s old routine, because these behaviors you’ve been working so hard to master are not habits.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Baby steps work because if you can succeed in doing those small steps everyday, for a week or a month, not only will you have greater ability and more confidence, you’ll feel more motivated to continue to continue doing these things-thereby progressing by gradually taking bigger steps and leaps-and eventually radically changing your life in the process.",
          "marks": []
        }
      ]
    }
  ]
}