{
  "title": "On the psychological inertia of habit change and starting",
  "slug": "on-the-psychological-inertia-of-habit-change-and-starting",
  "publishedAt": "2016-02-10T22:00:00.000Z",
  "excerpt": "One thing that I've noticed about writing and working out semi-regularly is that I often don't feel like doing it at first.",
  "image": "",
  "readTime": "2 min",
  "content": [
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "One thing that I've noticed about writing and working out semi-regularly is that I often don't feel like doing it at first.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Maybe that's because it's not a full on habit yet. Or maybe I haven't convinced myself 100% it's worth it. Or maybe it's just some unknown psychological effect that I'm currently unaware of.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Regardless of how I feel at the onset, however, I almost always enjoy the process and am thankful for having started minutes after I begin.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "That said, the trick is getting yourself started. If I can sit down and write for at least a few minutes, I'm pretty confident that I'll get my \"creative juices\" going and get a post out. And if I go to the gym and do a quick warmup on the treadmill or row machine, I pretty sure I'll feel a lot more motivated to continue working out.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "One method of doing this is to make the act of starting as easy as possible. Booting up your computer and sitting down to write with you're phone off and at a specified time and place is one example. Another, in the case of working out regularly, is having your gym bag packed and in the car with you at all times, or going to bed with your gym clothes on, and committing yourself to at least a 5 min \"warmup workout\" every day at a specific time.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Regardless of how it looks, starting takes energy and effort. Everything gets easier once you start, but until you start, psychological inertia is going to be working against you.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "My advice: Make starting the goal until it's a habit. Then start for 30 days (or 60). On time. Every day. No excuses.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "And remember, people hate doing. But they love having done.",
          "marks": []
        }
      ]
    }
  ]
}