{
  "title": "On typeface and why it matters",
  "slug": "on-typeface-and-why-it-matters",
  "publishedAt": "2015-03-18T10:33:20.000Z",
  "excerpt": "It occurred to me today how the typeface of each store/company/brand’s logo is different, and also how each respected logo, and the corresponding design of its typography ultimately influences the sty",
  "image": "https://blog.brendanbockes.com/wp-content/uploads/2015/03/screen-shot-2015-03-17-at-9-05-44-pm-300x97.png",
  "readTime": "3 min",
  "content": [
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "It occurred to me today how the typeface of each store/company/brand’s logo is different, and also how each respected logo, and the corresponding design of its typography ultimately influences the style and feel of it’s respected brand overall.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Let me illustrate:",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "First, look at the above image and try to get a sense for what the design of the type is trying to say. How does it make you feel? What kind of products do you think this brand sells?",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "This is half the logo from Michael Kors. For those who don’t know, Michael Kors is a NYC based fashion company that specializes in selling high-end fashion accessories, including purses, handbags, wallets and jewelry, to women.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Now, I’m no typography expert, but I think the typeface for Michael Kors is trying to deliberately make a statement. It takes up space, it’s in all caps, it’s big and it hits you. I don’t have the vocabulary to express how, exactly, that is, so it’s quiet hard for me to put it into words, but if you look at enough, you get a sense that Michael Kors sells products that are, in fact, high-end, fashionable, and indeed trying to draw attention.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Now compare that with the typeface of Francesca’s:",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Franscesca’s is also a high-end boutique that sells jewelry and clothing to women. Now, I’ve never set foot in a Francesca’s in all my life, but I know that the look and feel of it’s logo’s typeface reflects a completely different vibe and product than that of Michael Kor’s. To me, it seems a lot more care-free, less about trying to make a statement and more to do with clothing that looks nice, is casual and is almost country-esc (if that’s even a word).",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "One last example:",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "This logo is from Clark’s, a British, international, shoe manufacturer and retailer. Clarks makes really nice casual shoes and boots for both men and women.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "In my opinion, this typeface is a lot more casual than the above two logos, especially Michael Kors. It’s not trying to draw attention, it’s simply there, as if some friendly person picked up a sharpie and wrote it out, just to say who they are and that they care. Now what would Clarks feel if its logo used the typeface Michael Kors uses? Not as casual, I think. Maybe more intimidating?",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "My point is that typeface (and design of any form) matters. To a logo, to a brand, even on a business card or resume. Even in a post like this. To some degree it reflects what a brand or a person or an idea represents, it’s angle, it’s own distinct way of being in the world, and to some extent, even its values.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "If something so small can influence so much, I think it’s something worth taking a look at.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "(HT to ",
          "marks": []
        },
        {
          "_type": "span",
          "text": "Seth",
          "marks": [
            "link-0"
          ]
        },
        {
          "_type": "span",
          "text": " for the original idea).",
          "marks": []
        }
      ],
      "markDefs": [
        {
          "_key": "link-0",
          "_type": "link",
          "href": "https://seths.blog/2013/05/remind-you-of-anything-the-simple-way-to-do-good-typography-if-youre-an-amateur/"
        }
      ]
    }
  ]
}