{
  "title": "On writing as a mindfulness practice",
  "slug": "on-writing-as-a-mindfulness-practice",
  "publishedAt": "2015-10-23T11:48:12.000Z",
  "excerpt": "It's been a while since I last sat down to write. I miss it.",
  "image": "",
  "readTime": "3 min",
  "content": [
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "It's been a while since I last sat down to write. I miss it.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "I need to do it more. I know that now. And not just because I know it’ll make me a better person, or help me stand out from my peers. I honestly think there’s something self-advantageous about writing. Something I’ve never thought concretely about until now, when given the chance to actually write it out, which ironically is the point I’m getting at.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "You see, instead of the complexity and anxiety you get from ruminating thoughts via thinking, you get clarity and peace of mind with writing. You’re not repeating your thoughts, you’re stating them, as clear and simple as you know how.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "I think that’s why Seth recommends exercises like ",
          "marks": []
        },
        {
          "_type": "span",
          "text": "this",
          "marks": [
            "link-0"
          ]
        },
        {
          "_type": "span",
          "text": ", and ",
          "marks": []
        },
        {
          "_type": "span",
          "text": "this",
          "marks": [
            "link-1"
          ]
        },
        {
          "_type": "span",
          "text": ". Because he know’s that it’s one thing to think something through in your head, and a completely different thing to write it out. Writing makes it real, which puts you on the hook, because you have to be honest and brave enough to state what you’re truly thinking, no matter how ridiculous it might be. And then once you know what you’re thinking, you can revise it until it accurately depicts the world as it is, rather than as you think it is.",
          "marks": []
        }
      ],
      "markDefs": [
        {
          "_key": "link-0",
          "_type": "link",
          "href": "http://sethgodin.typepad.com/seths_blog/2015/10/the-two-review-technique.html"
        },
        {
          "_key": "link-1",
          "_type": "link",
          "href": "http://sethgodin.typepad.com/seths_blog/2014/10/make-two-lists.html"
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "With that in mind, writing can be considered an exercise in open-mindedness. It’s looking at the invented story you tell yourself about your world and your life and your ability to change, and continually revising that thinking so that the end-result is closer to what the world (and your potential) actually look like.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "That said, writing gives you the ability to look at the thinking behind some of your most engrained beliefs about the world and yourself. And after your thoughts are out in the physical space, writing encourages you to consistently revise your thinking until both your writing and thinking reflect the most accurate picture of reality you can comprehend.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "I tend to think of meditation as the practice of bringing your mind back to the present, and, I think, likewise, writing can thought of as the mindfulness practice of bringing clarity to mind. That is to say, deliberately doing the hard work of getting your thinking clean.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "It’s a difficult practice, but a rewarding one.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "As Steve Jobs said, “You have to work hard to get your thinking clean to make it simple. But it’s worth it in the end because once you get there, you can move mountains.”",
          "marks": []
        }
      ]
    }
  ]
}