{
  "title": "One of a kind is not for everyone",
  "slug": "one-of-a-kind-is-not-for-everyone",
  "publishedAt": "2018-09-13T06:27:00.000Z",
  "excerpt": "It might be that you haven’t yet done the hard work of finding your true fans.",
  "image": "",
  "readTime": "2 min",
  "content": [
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "It might be that you haven’t yet done the hard work of finding your true fans.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "That you can’t get your crowdfund campaign off the ground because, honestly, not enough people know about your work or care enough to know.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Indeed, there’s a high possibility you’re doing your marketing backwards.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "But normalizing your work, dumbing it down, appealing to the critics, changing your brand image or your voice merely because not enough people like what you do, that’s a flawed way to making something people will actually want to be a part of.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Original work is hard to come by. Not only because it’s hard to escape the temptation to create something that sounds less like your muse and more like you. But also, because original work can only, by definition, appeal to a few people. Which means that finding the others, discovering your true fans, the one’s who will embrace your work or fund your project, that’s going to take a long time.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Most people give up far too soon. Or worse, they change directions, sprinting to amass follows and likes by aimlessly trying to appeal to everyone. Ultimately diluting their voice, disappointing their true-fans, making them ever-sound less like the next best thing and more like a cheap cover band.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "It’s far better to commit to the long-haul of engaging, delighting and discovering the few someone’s who matter—your true fans—than to make a race out of making an album for everyone.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "It’ll probably take longer than you’re hoping. But it’s far more rewarding, and it's the only way (really) that works.",
          "marks": []
        }
      ]
    }
  ]
}