{
  "title": "Packaging vibes",
  "slug": "packaging-vibes",
  "publishedAt": "2018-08-27T07:23:00.000Z",
  "excerpt": "One way many companies differentiate themselves from their competition is to change the physical design.",
  "image": "",
  "readTime": "2 min",
  "content": [
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "One way many companies differentiate themselves from their competition is to change the physical design.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Harley Davidson motorcycles look and sound unlike any other motorcycle on the road.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Apple products look cleaner than any PC. PC’s, however, are more customizable.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "And the hissing sound you hear when you open a Dasani water is one of a kind, at least among bottled water.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "This is effective marketing done right. When you bake the remarkability of a product into the product itself, it’s far easier to get people to talk about you.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Another method is to infuse emotion into the packaging. Not merely the packaging on the outside of the box, but in how every interaction a customer has with your brand looks and feels.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Everything about TOM’s shoes, aside from the shoes themselves, for example—the packaging, the website, the copy, the Instagram—speaks to the attitude of globally-conscious consumers who support philanthropy. You’re not buying flashy Nike sneaker look-a-likes, and you’re not mean’t to feel that way.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Hello",
          "marks": [
            "link-0"
          ]
        },
        {
          "_type": "span",
          "text": " makes oral care products that you can feel amazing about. Not only because they use only natural ingredients, but because their packaging is friendly and approachable. They make oral care fun by infusing play right into their experience design.",
          "marks": []
        }
      ],
      "markDefs": [
        {
          "_key": "link-0",
          "_type": "link",
          "href": "https://www.hello-products.com"
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "And consider how you feel when you sit down and sip a latte at Starbucks. It doesn’t feel like Panera Bread. Or one of those cheap airport terminal coffee stands. Or a high-end café-au-lait boutique. It feels like Starbucks, because every other Starbucks you’ve been to looks and feels similar. It’s consistent and therefore authentic.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Whether your making a thing, a widget, an experience, a course, or a place, it’s important to consider: does the physical product speak for itself? Does it communicate an emotion or experience? And, how does everything else—the wrapping, the branding, the UX writing, the photos, the events and get-togethers, the timbre of our voice, even body-language, reflect and reinforce those feelings?",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "How does this thing (the product) make me feel? And is the holistic experience (the packaging) consistent with those feelings?",
          "marks": []
        }
      ]
    }
  ]
}