{
  "title": "Paid to learn",
  "slug": "paid-to-learn",
  "publishedAt": "2020-08-05T06:00:00.000Z",
  "excerpt": "I recently was paid $200 by a well-known organization to complete a skills-assessment for a job I had applied to.",
  "image": "",
  "readTime": "2 min",
  "content": [
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "I recently was paid $200 by a well-known organization to complete a skills-assessment for a job I had applied to.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "What a fascinating proposition.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "There I was, getting paid to effectively answer an open-book test. And, at $55 an hour, there was absolutely no downside.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "It’s interesting that we don’t apply this same formula to modern education: ",
          "marks": []
        },
        {
          "_type": "span",
          "text": "Why don’t we pay students to learn?",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Grades, it seems, are very poor motivators. And while being paid ",
          "marks": []
        },
        {
          "_type": "span",
          "text": "to make the grade",
          "marks": []
        },
        {
          "_type": "span",
          "text": " will certainly obfuscate the intrinsic motivation students might get from learning, one could argue that the desire to make the grade, in itself, takes away from the joy of learning on one’s own.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Of course, we do this already (in reverse). College students pay to get an education (with the hope they’ll receive a return on that investment in the not too distant future). By most estimates, that’s $100 or more per class, per course.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Unfortunately, for many students, making the connection between the dollar they are spending now and the three dollars they'll get back for paying attention and making the grade, don't often click. The problem being that in this scenario, the reward for learning (outside of actually learning) isn't immediate...and so it doesn't ",
          "marks": []
        },
        {
          "_type": "span",
          "text": "feel",
          "marks": []
        },
        {
          "_type": "span",
          "text": " like they're getting paid to sit, watch, listen, learn and to study...even though, given a longer time frame, that's exactly what they're doing.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "The obvious solution is to flip the script and raise the stakes. Either force students to pay their tuition in daily increments...perhaps, $100 before every class. Or, even better, perhaps award them with an end-of-term monetary bonus based on their as-of-yet GPA.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Sure, this is all speculative. (I personally think we should ditch the grades and the tests and focus on intrinsic rewards instead) but it's an interesting thought experiment. Many people are willing to work twice as hard at work to make twice as much. All I'm advocating is that we at least consider giving students the same luxury of choice.",
          "marks": []
        }
      ]
    }
  ]
}