{
  "title": "Paying less versus paying extra working in a small grocery store you can learn a lot about food culture and peoples opin",
  "slug": "paying-less-versus-paying-extra-working-in-a-small-grocery-store-you-can-learn-a-lot-about-food-culture-and-peoples-opin",
  "publishedAt": "2018-07-16T21:20:51.000Z",
  "excerpt": "Working in a small grocery store, you can learn a lot about food culture and people’s opinions about it. Something I’ve been overhearing a lot lately is the idea of Whole Foods’ impact on grocery cult",
  "image": "",
  "readTime": "3 min",
  "content": [
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Working in a small grocery store, you can learn a lot about food culture and people’s opinions about it. Something I’ve been overhearing a lot lately is the idea of Whole Foods’ impact on grocery culture.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Generally, people hold one of two views:",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Many people are worried about how the largest monopoly in the world now owns the largest and most profitable grocery of all time. Lots of people distrust Amazon outright (I have no idea why). Some are anxious about what this might mean for where their food comes from, considering how Whole Foods doesn’t have as strict standards on organic and non-gmo foods as their local market. Perhaps most poignant is the idea that Whole Foods will monopolize the grocery space the way Amazon has dominated retail, driving more and more customers away from the local, smaller markets, forcing them to cut corners and lower prices, creating a downward spiral that inevitably leaves them bankrupt.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "The alternative view is that this Whole Foods/Amazon merger is a boon. Discounts for Prime members (that’s ",
          "marks": []
        },
        {
          "_type": "span",
          "text": "64%",
          "marks": [
            "link-0"
          ]
        },
        {
          "_type": "span",
          "text": " of American households). The potential for cashier-less stores. Takeout delivery by drone (!). And, best of all, cheaper prices. Because of course, if people exclusively shop at Whole Foods like they shop on Amazon, then Whole Foods has complete control over how much they charge. They can lower the price on most products by a whole dollar compared to the other guy, and they’ll still make a profit, still be able to compete, and still (probably) put their competition out of business.",
          "marks": []
        }
      ],
      "markDefs": [
        {
          "_key": "link-0",
          "_type": "link",
          "href": "https://www.forbes.com/sites/shephyken/2017/06/17/sixty-four-percent-of-u-s-households-have-amazon-prime/#4bc488914586"
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Of course, if you value cheaper prices over the culture and experience of shopping at your small, local grocer or farmer’s market, then you don’t get to complain about the fact that Whole Foods took ",
          "marks": []
        },
        {
          "_type": "span",
          "text": "all",
          "marks": []
        },
        {
          "_type": "span",
          "text": " the profit. That is, if you’re penny-pinching puts your favorite store out of business, you’re just as responsible as the conglomerate you gave your money to. You don’t get the right to blame them for doing what businesses do (competing and maxing out profits), when you and your community enabled it to happen.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "On the other hand, if you value the small grocer, the local farmer, the eclectic bookstore, the more expensive (but significantly cooler) cafe, the indie band, or the ",
          "marks": []
        },
        {
          "_type": "span",
          "text": "curated",
          "marks": [
            "link-0"
          ]
        },
        {
          "_type": "span",
          "text": " app, the onus is on you and people like you to pay a premium for the things you value. If a little more than ",
          "marks": []
        },
        {
          "_type": "span",
          "text": "1,000 true fans",
          "marks": [
            "link-1"
          ]
        },
        {
          "_type": "span",
          "text": " shop exclusively at the local grocery store, they can probably make enough profit to get by. Same goes for just any business or person. But that begins and ends with the decision to make that your primary source for where your money goes, whether it be you’re purchasing music or jeans or strawberries.",
          "marks": []
        }
      ],
      "markDefs": [
        {
          "_key": "link-0",
          "_type": "link",
          "href": "http://brendanbockes.typepad.com/blog/2017/09/curation-is-the-next-frontier-of-the-web-part-2.html"
        },
        {
          "_key": "link-1",
          "_type": "link",
          "href": "http://kk.org/thetechnium/1000-true-fans/"
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "As the food educator ",
          "marks": []
        },
        {
          "_type": "span",
          "text": "Levi Lawerence",
          "marks": [
            "link-0"
          ]
        },
        {
          "_type": "span",
          "text": ", says in ",
          "marks": []
        },
        {
          "_type": "span",
          "text": "The Millennial Dream",
          "marks": [
            "link-1"
          ]
        },
        {
          "_type": "span",
          "text": ":",
          "marks": []
        }
      ],
      "markDefs": [
        {
          "_key": "link-0",
          "_type": "link",
          "href": "https://www.youtube.com/watch?v=GU7oiZud7co&frags=pl%2Cwn"
        },
        {
          "_key": "link-1",
          "_type": "link",
          "href": "https://www.amazon.com/Millennial-Dream-Alex-Vietinghoff/dp/B01M2YMUBR"
        }
      ]
    },
    {
      "_type": "block",
      "style": "blockquote",
      "children": [
        {
          "_type": "span",
          "text": "“Giving control of your financial decision over where your money goes and how much the farmer gets paid to a large international corporation, I don’t think that’s good for anyone’s economy—I don’t think there’s any small community around the world that benefits from giving those decisions away.”",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Giving decisions away…that’s what happens when we choose cheap or convenient over something else. What we, as a culture, have to begin to acknowledge, is what that something else is, and the long-term effects of not investing in it when given the chance.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "We get (and get to keep) what we pay for. If it’s something you value, it’s worth paying extra.",
          "marks": []
        }
      ]
    }
  ]
}