{
  "title": "People you should know",
  "slug": "people-you-should-know",
  "publishedAt": "2018-11-05T06:47:00.000Z",
  "excerpt": "Most people equate LinkedIn as merely a social network for business. Which is true and might even be considered a good thing. Except for the fact that LinkedIn’s service — all those premium features, ",
  "image": "",
  "readTime": "2 min",
  "content": [
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Most people equate LinkedIn as merely a social network for business. Which is true and might even be considered a good thing. Except for the fact that LinkedIn’s service — all those premium features, and the promise that comes with it — is broken.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "It sounds good in theory: extending your network by leveraging the power of the six degrees should be a one ticket trip to career opportunity, whether it’s finding a mentor, a new boss, your next gig, or more clients. But it doesn’t work in practice.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "That’s because people are rarely eager to talk to people they don’t know, especially when that person doesn’t have the social proof of knowing someone already in their network.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "It’s like trying to have a conversation with someone on the subway. Any number of the strangers sitting or standing around you could very well provide you with access, yet very few people network it that space. The reason is simple: it’s not social convention, it’s awkward, and so most people avoid it.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "So instead of finding your next gig on your way to work, you’re forced to spend extra time and effort (and perhaps income) trying to connect with people in a digital medium that doesn't make it any easier to bridge that discomfort.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Consider how LinkedIn’s landing page on it’s “My Network” tab recommends “people you may know,” instead of those you don’t. What if instead, LinkedIn began recommending 3rd or 4th degree connections (within the same geographical location) and finding ways to make that interaction less awkward from start to finish? This would create opportunities for people who would otherwise go unnoticed to connect, interact and grow, together.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Creating opportunity by leveraging the power of your extended network is, of course, what LinkedIn is all about. What seperates this idealistic service from it’s current offering—to be nothing more than a digital rolodex—might come down to a simple UX fix and bit of well intentioned copy.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "LinkedIn is overlooked as a Facebook for business, when in fact, it ought to function more like Tinder. I don’t mean to presume what LindedIn’s goals are or should be, but to me, it seems like discovering “who you (already) know” isn’t nearly as important as mingling with those you don’t.",
          "marks": []
        }
      ]
    }
  ]
}