{
  "title": "Perceived complexity 2",
  "slug": "perceived-complexity-2",
  "publishedAt": "2020-05-21T05:26:26.000Z",
  "excerpt": "Something I've noticed about people is that one's willingness to persist through a slog is generally inversely proportional to how complex it appears to be.",
  "image": "",
  "readTime": "1 min",
  "content": [
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Something I've noticed about people is that one's willingness to persist through a slog is generally inversely proportional to how complex it appears to be.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Classic example: if you assume that starting a business is no big deal, it's going to appear a lot easier to pull off than if you know how complicated in can be. Which means that, blessed with the gift of ignorance, you'll be more inclined to start (and persist) even when it gets tough.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Similarly, if you're on a learning track that breaks down what your learning into sizable chunks, or that omits non-essential elements (making it appear more congestible by design), it might make it easier for you to stick with the program.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Using this to your benefit, you might forego an MBA (back to our example), and instead opt for simply starting a business yourself and learning as you go. It's more risky that way (sort of). But the benefit of starting before you know what you're diving into might be all it takes for you to continue to persist even when you don't get the results you initially had hoped for.",
          "marks": []
        }
      ]
    }
  ]
}