{
  "title": "Quantifying education",
  "slug": "quantifying-education",
  "publishedAt": "2021-07-11T06:00:00.000Z",
  "excerpt": "It’s really hard to compare educational institutions, for the simple reason that most of them—in that they teach you the same things in roughly the same format—are all alike.",
  "image": "",
  "readTime": "2 min",
  "content": [
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "It’s really hard to compare educational institutions, for the simple reason that most of them—in that they teach you the same things in roughly the same format—are all alike.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "What’s different about one school from the next isn’t so much about what you’ll learn and the connections you’ll make (which are, in themselves, impossible to quantify) but how much it will cost you to enroll there.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Consider that most Ivy-league universities will cost you in the ballpark of $60K for a two-year program. At the same time, if you look the cost of some better-known bootcamps, the cost is about the same when you factor in the fact that they take a quarter of the time.)",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "The question is: how do you compare schools or programs? Is it even possible?",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Clearly, more is better. Paying for 18 months of learning is better than 6. (Or is it?)",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "But what about all the schools that don’t charge as much? Schools that charge 30%-60% less than their counterparts?",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "If I go to a school that costs half as much as another—but takes the same amount of time—is the latter better merely because it costs more?",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "The only way to possibly quantify it is looking at outcomes—which, by themselves, are nearly impossible to quantify.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "If everyone in a graduating class from one program is making over a certain amount (say $70K) five years after graduation, compared to a school where only half or less of its graduates (in the same year) have hit that number, that’s one thing. But to say that your graduates ‘are in high-demand,’ or that a few graduates saw a 40% increase in their annual salary doesn’t cut it.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Suffice to say that it’s really hard to compare schools because it’s equally hard to compare outcomes. If the vast majority of graduates are better off than graduates from another program, you could say you have a clear winner. But when you factor in the price of some schools compared to others, finding out who got the better education (or went to the better school) isn’t so evident.",
          "marks": []
        }
      ]
    }
  ]
}