{
  "title": "Questionable statements",
  "slug": "questionable-statements",
  "publishedAt": "2020-09-18T06:05:00.000Z",
  "excerpt": "Writers have a tendency to have strong opinions. And that’s no coincidence, because writers, of course, need fodder. Writers need stuff to write about, and if you write often and you’re honest, it’s h",
  "image": "",
  "readTime": "3 min",
  "content": [
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Writers have a tendency to have strong opinions. And that’s no coincidence, because writers, of course, need fodder. Writers need stuff to write about, and if you write often and you’re honest, it’s hard to continue to write without saying something that someone disagrees with.*",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Similarly, writers are notorious egomaniacs. (Or, at least, they appear to be.) ",
          "marks": []
        },
        {
          "_type": "span",
          "text": "\n",
          "marks": []
        },
        {
          "_type": "span",
          "text": "\n",
          "marks": []
        },
        {
          "_type": "span",
          "text": "That’s because from the outside looking in, it appears that writers aren’t interested in feedback as much as they are interested in talking about themselves or their (idealistic) ideas about how to fix what’s broken. And—since writers are always moving from one idea to the next—it appears that they rarely make time to listen to those who disagree with them. Which gives the impression that they’re naive and stubborn and overconfident and pretentious.",
          "marks": []
        },
        {
          "_type": "span",
          "text": "\n",
          "marks": []
        },
        {
          "_type": "span",
          "text": "\n",
          "marks": []
        },
        {
          "_type": "span",
          "text": "As a long-time writer, I know that I’ve written things that have ruffled feathers. And I apologize for when and if I stepped out of line. ",
          "marks": []
        },
        {
          "_type": "span",
          "text": "\n",
          "marks": []
        },
        {
          "_type": "span",
          "text": "\n",
          "marks": []
        },
        {
          "_type": "span",
          "text": "But—at the same time—I think it’s worth highlighting that, again, writers ",
          "marks": []
        },
        {
          "_type": "span",
          "text": "need",
          "marks": []
        },
        {
          "_type": "span",
          "text": " fodder. And it doesn’t make much sense to ",
          "marks": []
        },
        {
          "_type": "span",
          "text": "judge",
          "marks": []
        },
        {
          "_type": "span",
          "text": " a writer—a person—by any single thing that they wrote.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Most professions (or hobbies) don’t have any issue with discourse. If you disagree with how someone approached a design problem or how they organized their code, for example, you rarely question their character. But it seems that, with writing, there's a double standard.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "On one hand, we want to read from writers who have an opinion—who bring fresh ideas and insights to the table—but at the same time, people (readers, publishers, hiring managers) don’t often want to put up with writers who write things they think are wrong.**",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "So far, I’ve written well over 800 (nonfiction, op-ed) posts on this blog. So the odds that you’ll find something I’ve written that you disagree with is high (and it just keeps getting higher.) ",
          "marks": []
        },
        {
          "_type": "span",
          "text": "\n",
          "marks": []
        },
        {
          "_type": "span",
          "text": "\n",
          "marks": []
        },
        {
          "_type": "span",
          "text": "And, it turns out, I’m not so naive to think that everything I’ve written is right. (Just as I don’t believe that everything I’ve heard from any one source is always true.)",
          "marks": []
        },
        {
          "_type": "span",
          "text": "\n",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "The truth is, we’re just doing our best with what we have. With what we know now. It’s a fault to assume that you're definitively right all the time, just as it is a mistake to hold any one person accountable to what they said or wrote at any one point in their history. Like I’ve said before, all we can ask each other is that we do our best, and acknowledge and apologize when we ",
          "marks": []
        },
        {
          "_type": "span",
          "text": "inevitably",
          "marks": []
        },
        {
          "_type": "span",
          "text": " get it wrong.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "...",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "*Another reason writers have strong opinions is that writers are often voracious readers. Meaning they not only have more say, but have more to write about.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "**This is why I'd advise writers who have anything interesting to say to avoid saying it in public spaces (or even to advertise that you have such a space where you share your thoughts)…because frankly, people judge. It’s not nice and it’s not right, but they’ll hold you accountable for your ideas, when your right, yes, but especially when (they think) your wrong. So, if you write non-fiction with flair, stay semi-anonymous for a while, or at least until you’re self-employed.",
          "marks": []
        }
      ]
    }
  ]
}