{
  "title": "Quibbles with thrift",
  "slug": "quibbles-with-thrift",
  "publishedAt": "2021-09-14T05:17:00.000Z",
  "excerpt": "One way to lose at Monopoly is to buy as many territories as you land on, and then 'save money' buy not supporting them with houses or hotels.",
  "image": "",
  "readTime": "1 min",
  "content": [
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "One way to lose at Monopoly is to buy as many territories as you land on, and then 'save money' buy not supporting them with houses or hotels.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "You'll get to keep your funds until you land on your opponent's, and then have to mortgage your territories to simply stay in the game.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Fortunately, life isn't exactly like a game of Monopoly, but some aspects of our financial dealings very much are.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Consider the matter of stinginess. If all you do is save money by cutting corners by being cheap, you'll never create enough value to generate the money to afford to provide a better service.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "And, as with most money matters, the lesson compounds further. By not making enough money to make a better service, you'll never have enough money to maintain the same basic level of service once things start to break, or once your competition overtakes you.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Suffice to say that penny-pinching, in all your exchanges and dealings, is a recipe for perpetually being strapped for cash--ensuring you'll never amount to more than pennies on the dollar.",
          "marks": []
        }
      ]
    }
  ]
}