{
  "title": "Readers fomo",
  "slug": "readers-fomo",
  "publishedAt": "2020-05-07T05:55:16.000Z",
  "excerpt": "Pent up at home, I've been doing a lot more reading. And I find myself consistently amazed(!) by how such a wealth of knowledge is so readily available, all the time, and how that’s come to be.",
  "image": "",
  "readTime": "2 min",
  "content": [
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Pent up at home, I've been doing a lot more reading. And I find myself consistently amazed(!) by how such a wealth of knowledge is so readily available, all the time, and how that’s come to be.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Instant access to ideas of all kinds, for an almost negligible fee…and the sheer amount of science and reflection and ingenuity and technology that went into making this cumulative asset possible. A bargain for sure.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "That being said, I find it even more astonishing(!) that we’re even slightly tempted to pass it up in favor of the latest needless notification, social media disturbance, or trash on the tube. That we—you, me, us—fall victim to such garbage (almost perpetually, almost everyday).",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "How did we get to be so brainwashed?",
          "marks": []
        },
        {
          "_type": "span",
          "text": " How did we get so coaxed into thinking that anything less that our quest for knowledge, or rather, ",
          "marks": []
        },
        {
          "_type": "span",
          "text": "quenching our childlike curiosity",
          "marks": []
        },
        {
          "_type": "span",
          "text": ", was somehow more worthy of our time?",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "I don't have a straightforward answer, but I'll give you two solutions that have worked for me:",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "One is to change our habits, to give up the trigger, or rather, to the replace the behavior with something else.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "But I think it might actually be simpler than that. Because maybe it doesn't require much behavioral change at all. Just acknowledging what we have and what we continue to miss out on, by not reading, all along.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Rekindling our joy of learning and exploring might simply mean that we make more time and space for doing those things, while reconnecting with the possibility that we'll never know what we don't unless we make a practice out of discovering it today.",
          "marks": []
        }
      ]
    }
  ]
}