{
  "title": "Restaurants in the michelin guide dont take coupons",
  "slug": "restaurants-in-the-michelin-guide-dont-take-coupons",
  "publishedAt": "2018-06-25T10:15:42.000Z",
  "excerpt": "There are plenty of restaurants using shortcuts to buy a 5 second glimpse or a microsecond click or a cheap customer.",
  "image": "",
  "readTime": "2 min",
  "content": [
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "There are plenty of restaurants using shortcuts to buy a 5 second glimpse or a microsecond click or a cheap customer.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "But if their customers don’t come away talking about the remarkability of the experience, well, their not going to come back again soon are they?",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Which means that in a race for attention, the only way to have a consistent customer base is continue to market coupons and pay for advertising and (probably) try to be a little cheaper.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Not a great strategy if you want to be the best in town.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "The converse is to be #1 in a category: “top neapolitan pizza in 100 miles\", “impeccable service…treats me like royalty”, “most innovative methods”, “local sustainable farm-to-table”, “feels like mom’s kitchen”, “so hot it’ll make your insides numb.” The list goes on.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "If you can find a way to be so good you can't go unnoticed, and to tell a story that’s true to the experience and that resonates, you’ll have no shortage of people talking about you, eager to tell their friends and (probably) come back soon.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "It takes a lot longer than coupons, but it’s worth it. Because instead of buying attention, you're earning it.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Day by day, person by person, building a community of fans, of supporters, of people who would miss you if you were gone.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "No shortcuts, no gimmicks. Just well earned attention, and trust.",
          "marks": []
        }
      ]
    }
  ]
}