{
  "title": "Scared of cooking",
  "slug": "scared-of-cooking",
  "publishedAt": "2019-09-12T05:55:06.000Z",
  "excerpt": "Many Americans people regularly default to going out to eat rather than cooking something at home. Or (worse) heating a pre-cooked meal.",
  "image": "",
  "readTime": "2 min",
  "content": [
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Many Americans people regularly default to going out to eat rather than cooking something at home. Or (worse) heating a pre-cooked meal.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "And it's not for the reasons you might expect; it's not actually because people don't know how to cook eggs or saute vegetables, or teach themselves to use pressure cooker.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "And it's not because going out actually saves time (because it doesn't).",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "The reason people don't cook is because their bored eating the standard fair that they do know how to cook. And between paying a premium for having someone else cook up novelty for them, and trying to cook something new, the former seems like a far less risky option.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Of course, this inevitably creates people who would rather wait in line for an hour and a half at Cracker Barrel than cook up a western omelet or (attempt) eggs benedict themselves. Which not only contributes to poor deitary choices (via salty and nutritionally devoid food), but often (because restaurants charge a premium) creates financial strain (in the form of debt) for consumers.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "The alternative is to cook and cook often. To default to cooking so much that it becomes a habit, so that you get better at cooking over time, and genuinely enjoy it.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Cooking doesn't have to feel scary, risky, overwhelming or time-consuming. But that begins with being willing to try new things in the kitchen, to be prepared and willing to fail, over and over again, and to make space for feeling stupid until you learn from experience how not to be.",
          "marks": []
        }
      ]
    }
  ]
}