{
  "title": "Service mindset",
  "slug": "service-mindset",
  "publishedAt": "2021-03-15T05:04:00.000Z",
  "excerpt": "One way to think about a career is thinking about what object or service you'd most like to contribute.",
  "image": "",
  "readTime": "2 min",
  "content": [
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "One way to think about a career is thinking about what object or service you'd most like to contribute.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Take a simple café. There are things in it that need to 'work' for it to be a delightful experience.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Yes, the taste of the beans. The roast and the source. But also the milk used to make your latte, the compostable/paper cup it's in, even the logo on the side. They all came from somewhere, or more aptly, someone.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "And that's just the latte. What about the lighting, the furniture, the signage? What about the folks who make the foundation or the flooring, who engineer all those burr grinders or pour overs or espresso machines? Or, those who design (with intent) the visual look and feel and flow of the space you're in.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "There's also software, for payroll, checkout, accounting. The OS they work on. The iPad POS. That café jazz playlist you hear overhead. It probably took a bunch of (smart) people to make those.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "And then there's strategy. The stuff of advertising and marketing and sales. Of spreading the word and getting products out the door. Someone does that. It could be you.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Depending on your outlook, contributing any one thing can be empowering or downright boring. (And so you should stick to doing what you most enjoy.)",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "But, at the same time, thinking about the holistic experience--and how your contribution made no small part of it--can be just the kick in the pants you need to make a career of any job, the best way you can, for the long haul.",
          "marks": []
        }
      ]
    }
  ]
}