{
  "title": "Ships in the night",
  "slug": "ships-in-the-night",
  "publishedAt": "2024-09-17T09:28:07.057Z",
  "excerpt": "If you look at modern transportation–be it a subway ride in Chicago or a flight out of JFK–what you’ll invariably find is a sea of strangers, sitting or standing next to each other, staring at screens",
  "image": "",
  "readTime": "2 min",
  "content": [
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "If you look at modern transportation–be it a subway ride in Chicago or a flight out of JFK–what you’ll invariably find is a sea of strangers, sitting or standing next to each other, staring at screens, without making a peep.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "We deliberately try ",
          "marks": []
        },
        {
          "_type": "span",
          "text": "not",
          "marks": []
        },
        {
          "_type": "span",
          "text": " to socialize. Because we’re afraid of what people might think.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "We’re ships in the night–passing each other with just enough recognition to avoid a collision. And we wonder why we’re so lonely.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Sure, we’re more ",
          "marks": []
        },
        {
          "_type": "span",
          "text": "connected",
          "marks": []
        },
        {
          "_type": "span",
          "text": " than ever. But we’re so cocooned in our own bubbles of distraction and noise that we rarely invite outsiders in. So we’re left with our distant friends from college, a few odd colleagues, and, if we’re lucky, a family of our own.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "For a lot of people, that’s enough. But if you find that even for a moment you’re adrift–feeling isolated in a sea of faces–remember that moments of shared space, however fleeting, are almost always an opportunity to connect.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "A smile, a simple “hello”, or even just a brief exchange can be enough to rediscover our humanity and diminish our sense of loneliness. Not just for ourselves, but for others as well–the people we generously reach out to.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Life doesn’t have to be so lonely, or scary, or drab. If we can muster the courage to express ourselves in small steps, we can rediscover the warmth of shared connections and perhaps replace that nagging sense of isolation with engaging interactions and the companionship of new friends.",
          "marks": []
        }
      ]
    }
  ]
}