{
  "title": "Sleazy sales is bad business",
  "slug": "sleazy-sales-is-bad-business",
  "publishedAt": "2019-10-24T06:12:21.000Z",
  "excerpt": "Sales is a fickle thing, because sure, it often does pay for itself.",
  "image": "",
  "readTime": "3 min",
  "content": [
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Sales is a fickle thing, because sure, it often does pay for itself.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "The problem is when it doesn’t. And the number one reason it doesn’t is because often, people who are in positions to sell things are often incentivized, cajoled and encouraged to encourage people to buy things ",
          "marks": []
        },
        {
          "_type": "span",
          "text": "now",
          "marks": []
        },
        {
          "_type": "span",
          "text": " (not later).",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "And so you have organizations big and small who put pressure on their sales staff to pressure people to buy things they don’t need or want. To up-sell their inventory. And to generally do whatever it takes to close the sale.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Naturally, this posture completely undermines the customer relationship. And it often sacrifices what could be a lifetime of customer value as a result.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Case and point: If I go to your restaurant expecting it to be a good experience because it has good rating on Foursquare, and I come out feeling that I was deprived of quality service because I didn’t order an inebriant, double-digit entree or decadent dessert, I’m not going to back to your restaurant, period, regardless of how good the food was or is.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "And if frequently pass your retail store while I’m out and about, and constantly find myself having to dodge your staff who incessantly ask if I’d like a sample, after which dubiously attempting to swoon me into the store to play hook and reel, followed by a scripted, multi-layered interrogation built on ",
          "marks": []
        },
        {
          "_type": "span",
          "text": "FABs",
          "marks": [
            "link-0"
          ]
        },
        {
          "_type": "span",
          "text": " and closed questions, well, you can be sure I won’t be stopping by anytime soon (regardless of how good your products really are).",
          "marks": []
        }
      ],
      "markDefs": [
        {
          "_key": "link-0",
          "_type": "link",
          "href": "https://www.nutshell.com/blog/sales-slang-terms/"
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "When people break-up with companies, it’s often not because their products and services are bad. It’s because somewhere along the way, someone or something ended the relationship.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Sales can be a boon for organizations and their customers alike. But that begins and ends with maintaining a relationship of trust. Keeping your promises. Showing you care. Not incessantly asking me to buy from you, talk to you or subscribe to your email. And certainly not upending the relationship because things aren’t going your way.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "These are things we can teach people. Things we can incentivize and encourage and abide by. But that starts with setting those expectations early, actively discouraging their opposites, and creating systems that enable sales-people to show up as their best selves, without having to sacrifice their good nature in favor of making ends meet (for themselves, or the company).",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "While the mechanics of this go far and beyond the scope of this post, I do want to mention that, certainly, you can’t blame the waiter or the salesman, entirely. It’s not their fault they pay bills based on commission. And it’s often not the fault of their managers either, who are simply following orders and have yet to think of a better way to imburse their hard working employees.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Often, it’s someone further up the totem pole who makes those decisions for them—someone immune to nature of unstable money-making and the repercussions of sleazy salesmanship. To that end, I say, if you’re lucky and smart enough to come across a post like this one, think hard about the long-term implications of your inaction. And maybe consider the benefits of switching to a more robust system of management, marketing, cooperation and compensation.",
          "marks": []
        }
      ]
    }
  ]
}