{
  "title": "Social activism vs exponential stupidity",
  "slug": "social-activism-vs-exponential-stupidity",
  "publishedAt": "2020-07-25T05:50:25.000Z",
  "excerpt": "I recently saw a  video  of how the Italians were responding to the coronavirus, cooped up at home, yes, but also scattered about on their balconies singing and conversing.",
  "image": "",
  "readTime": "3 min",
  "content": [
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "I recently saw a ",
          "marks": []
        },
        {
          "_type": "span",
          "text": "video",
          "marks": [
            "link-0"
          ]
        },
        {
          "_type": "span",
          "text": " of how the Italians were responding to the coronavirus, cooped up at home, yes, but also scattered about on their balconies singing and conversing.",
          "marks": []
        }
      ],
      "markDefs": [
        {
          "_key": "link-0",
          "_type": "link",
          "href": "https://www.youtube.com/watch?v=DDRiINXik00"
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "It turns out this wasn’t an isolated event either—",
          "marks": []
        },
        {
          "_type": "span",
          "text": "many people across the country",
          "marks": [
            "link-0"
          ]
        },
        {
          "_type": "span",
          "text": " responded to the lockdown by congregating on their balconies and windows.",
          "marks": []
        }
      ],
      "markDefs": [
        {
          "_key": "link-0",
          "_type": "link",
          "href": "https://www.standard.co.uk/news/world/italians-singing-balconies-coronavirus-lockdown-watch-a4387331.html"
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "It brings to mind, of all things, an experience I had while interning at Disney. I noticed that trips too and from parks (Epcot) with European ‘cast members’ (college students recruited from abroad), the buses where alive with conversation and, at night, joyous song. Everyone was so amiable, and jovial.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "This was a sharp contrast to the buses predominantly made up of Americans. Everyone was quiet…reluctant to even strike up a conversation or disturb one another. We were so very preoccupied by the then-novel, now-ubiquitous mode of distraction: the smart phone.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "I fear this same phenomenon exists even more broadly in modern America. Where Europeans are all too ready to make the most of their time interacting with their neighbors, Americans are so distracted by artificial means of socializing (and so very isolated from each other), that we’re willing to prematurely expedite physical interaction and forsake our own health in the process. All in a mad effort to escape the boredom and loneliness we feel from simply having to stay at home in solitude.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Consider that now, while we've made significant attempts to flatten the curve, more people are going out and congregating in public than ever. The pandemic is far from over, and to make matters worse, our numbers are exponentially higher now than they were mere weeks ago.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Yes, you have a higher chance of contracting the virus today than just about day in the past 90 days. But that's likely not going to stop you or the people you know from going out and about. (It's summer after all and you deserve it.)",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "And so while Europeans sit dumbfounded by how our numbers are going higher (and how ",
          "marks": []
        },
        {
          "_type": "span",
          "text": "incredibly stupid",
          "marks": [
            "link-0"
          ]
        },
        {
          "_type": "span",
          "text": " Americans appear to be), we are going out in droves (making this problem exponentially worse) because we don't know how to simultaneously stay at home and stay connected.",
          "marks": []
        }
      ],
      "markDefs": [
        {
          "_key": "link-0",
          "_type": "link",
          "href": "https://www.theatlantic.com/ideas/archive/2020/07/america-land-pathetic/613747/"
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Loneliness",
          "marks": [
            "link-0"
          ]
        },
        {
          "_type": "span",
          "text": " is a real problem, particularly in this country, and no one, I think, is immune to it. But as far as I tell, everyone could do better to fill this void using modern, digital tools and, perhaps, talking to their neighbors, as opposed to going out, gathering, and prematurely acting like things have returned to normal.",
          "marks": []
        }
      ],
      "markDefs": [
        {
          "_key": "link-0",
          "_type": "link",
          "href": "https://brenebrown.com/podcast/dr-vivek-murthy-and-brene-on-loneliness-and-connection/"
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Things are not normal. This is not over. And jumping the gun will inevitably only make things worse. Better to work with it and around it, than risk dismantling all our hard-earned progress.",
          "marks": []
        }
      ]
    }
  ]
}