{
  "title": "Space versus lock in",
  "slug": "space-versus-lock-in",
  "publishedAt": "2018-06-05T10:34:20.000Z",
  "excerpt": "When people are seeking a career-change in a generally un-scientific field, you often hear them talk about trying to “get into a space.”",
  "image": "",
  "readTime": "2 min",
  "content": [
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "When people are seeking a career-change in a generally un-scientific field, you often hear them talk about trying to “get into a space.”",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "The idea is that you might find an entry-level job as a content writer or designer of some sort, and then somehow carve out a space for yourself over time. Once people see you have the skills and you care about the work, they’ll give you more responsibility, and over time you can begin to establish a reputation. This is how most freelancers enter the work-force and vice-versa.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Entering a space is horizontal. There’s not such a steep learning curve to get in. Anyone can master a few skills and try it out.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "The flip side is a career based around lock-in. If you want to be a doctor or a lawyer or an engineer, it’s a long-term commitment. You decide this is what you want to do for the next 10+ years and you commit every step of the way, from undergrad to Ph.D. It’s a vertical hierarchy, in that the only way to have experience is to complete a decade long slog through compulsory education.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Hence, lock-in. Because the only way to come to know if this is the career you want for yourself is to spend thousands of dollars and thousands of hours committed to that outcome. It’s a long-term investment, and therefore a much more difficult career field to both enter (to see if you like it) and exit (once you're sufficiently on track).",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Two thoughts on this:",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "listItem": "number",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "As VR and 360 degree video mature, I’m sure we’ll soon see a demand for simulations that enable users to experience the real-world 24/7 lives of many of the people who hold these jobs. This will obviously help many people make decisions about what fields they want to pursue, especially those interested in careers with significant lock-in.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "listItem": "number",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "When thinking about choosing a major (or changing jobs), it’s worth considering where your ideal job is along these axes. Is it a fairly low-level investment and easy to change course? Or is there a steep-learning curve with a significant long-term investment? How long will it take to get real-world exposure? And perhaps most important, how and when will you know you made the right decision?",
          "marks": []
        }
      ]
    }
  ]
}