{
  "title": "Stories spiels",
  "slug": "stories-spiels",
  "publishedAt": "2020-07-20T05:40:15.000Z",
  "excerpt": "My alma mater recently informed me that I needed to update my ‘alumni information,’ because they are currently updating their directory, and apparently ‘time is running out.’",
  "image": "https://blog.brendanbockes.com/wp-content/uploads/Screen-Shot-2020-07-16-at-9.32.16-AM.png",
  "readTime": "2 min",
  "content": [
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "My alma mater recently informed me that I needed to update my ‘alumni information,’ because they are currently updating their directory, and apparently ‘time is running out.’",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Feeling sociable, I gave them a call to verify my information, only to be subtly led down a sales-eque rabbit-hole not unlike a late-night informercial.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "“When was the last time you visited the university?…What was your most fond memory of your time there? …We’re offering alumni a print-publication of the entire directory, plus several premium collectables…would you be interested in buying the publication plus an exclusive, members-only tote-bag, plus a t-shirt/sweatshirt combo and a hat for $339 plus S&H?”",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "(It honestly felt like I was talking to Mike Rowe back when he worked for QVC.)",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "I think that most millennials would agree that giving any more of our money to our alma mater’s (while we’re ",
          "marks": []
        },
        {
          "_type": "span",
          "text": "still",
          "marks": []
        },
        {
          "_type": "span",
          "text": " in thousands of dollars in debt), is presumptuous at best, and selfish at worst.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "But more than anything, I think it’s embarrassing the alumni association couldn’t flat out ask for a contribution (and instead choose to abruptly dupe me into closing a sale). The farcical hoopla of making casual rapport to swiftly making an offer, to then asking (after I declined the first) , ‘could you at least make a one-time purchase of the publication to support the university?’ might work for some people, but I suspect won't work for most. Particularly the kids who have learned through two decades of advertising to pick up on it.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "The lesson here is not that my former university is greedy for asking for more money (although that’s true). The lesson is simply that they’re doing a poor job selling their pitch.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "I wouldn’t mind contributing some money for a coherent reason or a worthy cause—but expecting to swindle me with a bad souvenir and an old-fashioned spiel is cause for disappointment.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "If you’re going to sell me something, please, just ",
          "marks": []
        },
        {
          "_type": "span",
          "text": "tell me a story",
          "marks": []
        },
        {
          "_type": "span",
          "text": ". No gimmicks. No tricks.",
          "marks": []
        }
      ]
    }
  ]
}