{
  "title": "Techniques make all the difference when taking photographs the average photographer aims her camera at the image shes go",
  "slug": "techniques-make-all-the-difference-when-taking-photographs-the-average-photographer-aims-her-camera-at-the-image-shes-go",
  "publishedAt": "2018-04-02T21:58:44.000Z",
  "excerpt": "When taking photographs, the average photographer aims her camera at the image she’s going for and takes a shot.",
  "image": "",
  "readTime": "2 min",
  "content": [
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "When taking photographs, the average photographer aims her camera at the image she’s going for and takes a shot.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "The professional, of course, might utilize any number of appropriate techniques: depth of field, the rule of thirds, motion blur, exposure compensation, high-dynamic range, composition, focus, forced perspective, or the sunny 16 rule, to name a few.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "A novice saxophonist might correct his tone by adjusting his mouthpiece to ensure he’s in tune. Or make sure he’s playing all the right notes.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "But on any given night Charlie Parker might have adjusted his embouchure, his posture, the pressure and flow of his air stream, his volume, the position of his trachea, as well as utilized varying degrees of vibrato. Taking it a step further, there are also extended techniques such as growling, glissando, multi-phonics, overtones, airstream manipulation, altissimo, slap and flutter tonguing, and circular breathing which can also be employed to further extend the complexity and subtly of a ",
          "marks": []
        },
        {
          "_type": "span",
          "text": "performance",
          "marks": [
            "link-0"
          ]
        },
        {
          "_type": "span",
          "text": ". And that’s all without even adding electronic effects.",
          "marks": []
        }
      ],
      "markDefs": [
        {
          "_key": "link-0",
          "_type": "link",
          "href": "https://www.youtube.com/watch?v=kPvqFFtVol0"
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "And, while a beginner rafter might know that the goal is to stay in the raft, keep calm and be safe, a pro knows ",
          "marks": []
        },
        {
          "_type": "span",
          "text": "how",
          "marks": []
        },
        {
          "_type": "span",
          "text": " to do those things successfully. He’s spent countless hours practicing the techniques and skills that ensure a safe, smooth and fun rafting experience.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Three takeaways:",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "listItem": "number",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "For almost anything you do, someone has probably discovered a better way to do it. Those solutions are called techniques and they can dramatically improve your effectiveness when used properly.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "listItem": "number",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "The primary difference between a pro and an amateur is often knowing all the techniques for a given skill set, and experience utilizing those concepts effectively.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "listItem": "number",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "You can dramatically produce better than average results by picking up one or two techniques. For example, a photographer who’s familiar with the rule of thirds can utilize the grid setting on his phone to take dramatically better shots.",
          "marks": []
        }
      ]
    }
  ]
}