{
  "title": "The 5 pm habit",
  "slug": "the-5-pm-habit",
  "publishedAt": "2015-02-24T16:36:49.000Z",
  "excerpt": "I’m not a particularly productive person around 5:00 pm or so, never have been. I don’t know what it is exactly, whether it’s the yellowish haze of the sun setting or just where I happen to be (usuall",
  "image": "",
  "readTime": "3 min",
  "content": [
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "I’m not a particularly productive person around 5:00 pm or so, never have been. I don’t know what it is exactly, whether it’s the yellowish haze of the sun setting or just where I happen to be (usually just getting back home from work) but I’ve always felt very lazy around that particular time period.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "How very un-surprising would it be then if I told you that, if I’m home at 5:00 pm on a weekday, I’m almost always wasting my time doing something incredibly unproductive. Some examples come to mind: watching popular videos on devour.com or youtube; scrolling through facebook, playing video games on my ipad or viewing tumblr or instagram or wanelo feeds. What a waste.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Normally I think nothing of it. I just carelessly expend an hour and a half of my life doing stupid stuff and then go eat dinner at around 6:30. It wasn’t until today when I got home at 5:30 did I consider the possibility that I could very well commit to doing something else entirely. Instead of spending the hour learning absolutely nothing, I could do something dramatically productive with my hour by either learning a new skill, getting better at an old one, or creating something worth sharing.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "And that’s when I thought: What a great time to sit down and write something. What a great time in my day to come in my room, boot up my Mac, turn on some coffee shop background noise (thank you ",
          "marks": []
        },
        {
          "_type": "span",
          "text": "Noisli",
          "marks": [
            "link-0"
          ]
        },
        {
          "_type": "span",
          "text": "), and commit to writing something semi-constructive, informative and entertaining. Something that I can share with people and maybe change someone’s perspective. Or at least help me develop my point of view into something worthwhile.",
          "marks": []
        }
      ],
      "markDefs": [
        {
          "_key": "link-0",
          "_type": "link",
          "href": "https://www.noisli.com"
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "How many hours do we waste wasting time? And how many hours would it take you to make something important, something meaningful, both for your social circle and yourself? Better yet, how would feel about yourself (or how would your peers feel about you) if you took an hour out of your day, each day, to make something or learn something and share it with the world? To stop your daily “I’m off work and I’m home and I’m tired and I just want to relax and waste time” routine and take one hour, just one hour, to make something new.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "My guess is you’ll be infinitely more proud of yourself for doing it. And you might just learn something too.",
          "marks": []
        }
      ]
    }
  ]
}