{
  "title": "The poetry of self invention",
  "slug": "the-poetry-of-self-invention",
  "publishedAt": "2019-10-08T05:33:26.000Z",
  "excerpt": "In The  Art of Possibility , Ben and Roz Zander describe an exercise whereby newcoming students are tasked with explaining in detail, how and why they are deserving of a final A at the close of the pr",
  "image": "",
  "readTime": "2 min",
  "content": [
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "In The ",
          "marks": []
        },
        {
          "_type": "span",
          "text": "Art of Possibility",
          "marks": [
            "link-0"
          ]
        },
        {
          "_type": "span",
          "text": ", Ben and Roz Zander describe an exercise whereby newcoming students are tasked with explaining in detail, how and why they are deserving of a final A at the close of the preceding semester. It sounds counterintuitive, why would you ask them to explain how they ",
          "marks": []
        },
        {
          "_type": "span",
          "text": "anticipate",
          "marks": []
        },
        {
          "_type": "span",
          "text": "they’ll perform (at the start) rather than asking them why they performed the way they did at the end? But when you think about how our expectations govern our actions…it makes perfect sense. If you set a goal (something to aim for) and list the steps required of you to get there, you’ll be much more likely to hold yourself accountable to achieving that standard. Moreover, if you make the exercise social, enlisting the accountability of your teachers and peers, you’ll be dramatically more eager to follow through. ",
          "marks": []
        },
        {
          "_type": "span",
          "text": "Debbie Millman",
          "marks": [
            "link-1"
          ]
        },
        {
          "_type": "span",
          "text": " recommends a similar exercise for her students. By writing—in as much detail as possible—a future day 5 or 10 years out, it primes you (consciously, and perhaps unconsciously) to make that vision a reality.",
          "marks": []
        }
      ],
      "markDefs": [
        {
          "_key": "link-0",
          "_type": "link",
          "href": "https://www.amazon.com/Art-Possibility-Transforming-Professional-Personal/dp/B004HY9254/ref=tmm_aud_swatch_0?_encoding=UTF8&qid=&sr="
        },
        {
          "_key": "link-1",
          "_type": "link",
          "href": "https://youtu.be/8S_Ims5oX-s?t=5631"
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "I’m not saying that just by imagining it, you’re going to get where you want to go—",
          "marks": []
        },
        {
          "_type": "span",
          "text": "hardly",
          "marks": []
        },
        {
          "_type": "span",
          "text": ". But I would argue that planning for it, leaning into the possibility that you’ll get what you want, and ‘",
          "marks": []
        },
        {
          "_type": "span",
          "text": "acting as if",
          "marks": []
        },
        {
          "_type": "span",
          "text": "’ you can do this, is probably a far more effective strategy than doing the opposite, or nothing at all.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "More often than not, we experience what we expect and what we rehearse. Best to expect the best.",
          "marks": []
        }
      ]
    }
  ]
}