{
  "title": "The communal benefits of good health",
  "slug": "the-communal-benefits-of-good-health",
  "publishedAt": "2020-03-21T06:39:14.000Z",
  "excerpt": "I’ve long thought that having good health (or for that matter, being physically fit) where things that benefitted only the person bearing them. My thinking being that being able to wear tight fitting ",
  "image": "",
  "readTime": "2 min",
  "content": [
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "I’ve long thought that having good health (or for that matter, being physically fit) where things that benefitted only the person bearing them. My thinking being that being able to wear tight fitting clothes or sprint a mile probably helps you find and select a mate, make the varsity team, and to some degree, determine what you can (and can’t) physically do in your free time.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "And then’s the very real productivity and health benefits of exercise and eating right—low cholesteral, improved focus, better sleep, a signifcant decrease in your chances of getting virtually every disease known, etc.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Upon further reflection, however, I realize I’ve been only half-right. Because it turns out that being healthy both decreases your odds of getting communicable diseases, ",
          "marks": []
        },
        {
          "_type": "span",
          "text": "and",
          "marks": []
        },
        {
          "_type": "span",
          "text": " lessens the potential load on ",
          "marks": []
        },
        {
          "_type": "span",
          "text": "public health",
          "marks": [
            "link-0"
          ]
        },
        {
          "_type": "span",
          "text": ". Moreover, it’s cheaper, because less shots and meds and man-hours servicing ",
          "marks": []
        },
        {
          "_type": "span",
          "text": "you",
          "marks": []
        },
        {
          "_type": "span",
          "text": " mean that your money and the government’s money can be spent on better things. (Like improving the health for the less fortunate, or even sustaining the local economy.)",
          "marks": []
        }
      ],
      "markDefs": [
        {
          "_key": "link-0",
          "_type": "link",
          "href": "https://seths.blog/2020/03/the-efficiencies-of-public-health/"
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Moreover, your example helps the people nearest you, enabling and empowering them to follow in your footsteps. So that instead of a lineage of chronically-ill and powerless drug abusers (not to mention the sticky idea that it all ‘runs in the family’), you can pave the way for a better future, both for them and for you.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "As with any personal health decision—what to eat or drink, whether to work out, where to spend your time, etc.—choosing to be (or not to be) in good health has an opportunity cost. More and more, it’s becoming evident that the cost of negligence and laziness affects your community and those you’re close to, just as much as it impacts you.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Wishing you good fortune and good health, and the best of decisions concerning it.",
          "marks": []
        }
      ]
    }
  ]
}