{
  "title": "The last ten minutes",
  "slug": "the-last-ten-minutes",
  "publishedAt": "2019-06-28T05:52:00.000Z",
  "excerpt": "If you’re anything like me, you overestimate how much you can accomplish in a short period of time and underestimate given a long period of time.",
  "image": "",
  "readTime": "2 min",
  "content": [
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "If you’re anything like me, you overestimate how much you can accomplish in a short period of time and underestimate given a long period of time.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Which means that you wake up two hours before work, you’re more likely to attempt to do the 20 or so sub-tasks that you need to do to get out the door in last 20 minutes, and spend the other 110 minutes doing a third of that number.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Classic example: Just today, I spent the first two hours drinking coffee (while reading), going to the gym, and eating breakfast.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "I then spent the last 20 or so minutes eating 3 eggs, taking a shower, getting dressed, brushing my hair, packing my bag, packing my lunch, topping off my water bottle, filling my tumblr with coffee, putting on my shoes, putting on my tie, and then packing everything into my car.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "So, of course, I was behind schedule, because I tried to do too many things on the tail end. Too many things in the last ten minutes.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "It’s a simple fix: over-prepare, sprint from the start, and do your best to create as much slack as possible.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Spare the last ten minutes, not for polishing everything off, but for sitting with the feeling of having it done before it’s due…whether that looks like getting in your car gracefully, or submitting your project on time, or showing up early.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Being proactive about making the last ten minutes as smooth as possible is the secret to meeting deadlines big and small.",
          "marks": []
        }
      ]
    }
  ]
}