{
  "title": "The problem with socks",
  "slug": "the-problem-with-socks",
  "publishedAt": "2018-03-25T21:26:05.000Z",
  "excerpt": "There are two ways I know to sort your clothes away after you’ve done your laundry.",
  "image": "",
  "readTime": "2 min",
  "content": [
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "There are two ways I know to sort your clothes away after you’ve done your laundry.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "One way is to serendipitously take each parcel out, recognize what it is, who’s it is, and where it goes. To take it one at a time, and organize as such.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "This is the way I’ve been doing laundry for years. Which, of course, happens to be the most inefficient way to possibly sort your laundry. The reason is because of socks.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "If you pick up a single sock, you’ll have to find the matching sock. And the odds that the next thing you pick up is that matching sock is one out how many items you have left in your hamper. So what you’ll inevitably do is put the sock down and sort through your hamper, trying to find the other matching sock (which wastes time). Or, you’ll have to keep that sock in your memory while you go about sorting through each sequential item, all the while taking an additional second per item to recognize if it’s the matching sock. Not only is this time consuming, it requires more concentration than is simply necessary for so straightforward a task.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "The faster method is to divide like with like. Socks with socks. Briefs with briefs. Shirts with shirts. Pants with pants. If you’re doing laundry for multiple persons, you can filter first by who’s it is, followed by type.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "If you organize like the way I do, you’ll find that most of time items that are the same in a category are put away in the same place. Socks in the sock drawer, sweater’s with sweater’s. Mike’s shirts don’t go with Sarah’s leggings.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "This method is far more efficient. It’s a lot easier to go through your basket dividing by category than it is to pick up a sock and then a jumper and then a dress shirt and then a different sock and decide where each one goes.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "By eliminating backtracking and reducing cognitive load, you save time and energy for more important tasks.",
          "marks": []
        }
      ]
    }
  ]
}