{
  "title": "The 3 cornerstones of self confidence",
  "slug": "the-3-cornerstones-of-self-confidence",
  "publishedAt": "2014-06-08T15:50:05.000Z",
  "excerpt": "Self-Trust : Being whole-heartedly honest with yourself about your values, standards, dreams, goals and priorities, and about what you genuinely want for yourself. And thus keeping to those commitment",
  "image": "",
  "readTime": "1 min",
  "content": [
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Self-Trust",
          "marks": []
        },
        {
          "_type": "span",
          "text": ": Being whole-heartedly honest with yourself about your values, standards, dreams, goals and priorities, and about what you genuinely want for yourself. And thus keeping to those commitments regardless of how hard life gets or how you feel in any given moment.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Self-Respect",
          "marks": []
        },
        {
          "_type": "span",
          "text": ": Respecting yourself enough to walk away from anyone or anything that no long serves you, grows you, or makes you happy. And thus making your experience of the world — your time, health, attention, needs, desires, goals and priorities (and the overall happiness you get from them) — values of the highest degree.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Self-Honor",
          "marks": []
        },
        {
          "_type": "span",
          "text": ": Doing what you think is best for you and your overall health, happiness or well-being, regardless of all external events, regardless of how other people think, regardless of how uncomfortable it may feel. This means pursuing what you value, and proactively doing whatever it takes to actualize your dreams, regardless of the consequences.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Self-trust. Self-respect. Self-honor.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "That’s the essence of self-confidence.",
          "marks": []
        }
      ]
    }
  ]
}