{
  "title": "Theres a lot to learn about our world",
  "slug": "theres-a-lot-to-learn-about-our-world",
  "publishedAt": "2017-01-19T11:06:32.000Z",
  "excerpt": "One quick walk through your local bookstore or a scroll through a website like  this , and you begin to understand that there’s no way you’ll ever be able to learn everything there is to learn in your",
  "image": "",
  "readTime": "2 min",
  "content": [
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "One quick walk through your local bookstore or a scroll through a website like ",
          "marks": []
        },
        {
          "_type": "span",
          "text": "this",
          "marks": [
            "link-0"
          ]
        },
        {
          "_type": "span",
          "text": ", and you begin to understand that there’s no way you’ll ever be able to learn everything there is to learn in your lifetime.",
          "marks": []
        }
      ],
      "markDefs": [
        {
          "_key": "link-0",
          "_type": "link",
          "href": "http://www.thegreatcourses.com/courses?ICMP=126575"
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "I used to think that if I started early, back in college, I’d be a polymath in no time. I’d know everything about everything (like Sherlock Holmes) and I’d have no problem finding a job in 4 years. All I’d have to do was collect all the good books and read night and day.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Alas, life, or should I say college, gave way. Socializing. Assignments. Studying. Having a job. Staying in shape. Having a life. Having a girlfriend. Having fun.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "I now realize I only have so much time to read. I have a limited amount of time to learn new skills and expose myself to new ideas. I can’t even read all the books I now own in my lifetime, let alone podcasts, audiobooks, or ebooks.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Is that an excuse to stop reading? Or listening? Certainly not. It’s just a realization that I can’t read everything, I can’t know everything, even if I want to.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "The solution is simple: pick the most interesting thing at the time you plan on reading it, and expose yourself to it. Really engage with it. Write about what you’ve learned. Make mental notes. Convert it to memory. Then put it on your shelf, and use the physical book as a sort of post-it note, ever keeping you mindful of the ideas inside. It might prove helpful in the future.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "No I can’t learn everything. That’s okay though, it’s not the goal. The goal is to keep learning, everyday.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "To always be growing. To always be curious. To always be a beginner.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Living to learn is learning to live.",
          "marks": []
        }
      ]
    }
  ]
}