{
  "title": "Thoughts on current events",
  "slug": "thoughts-on-current-events",
  "publishedAt": "2020-06-02T05:33:05.000Z",
  "excerpt": "This past week has been pretty bewildering. Because, of course, I  am  a person of privilege, I’ve never known racial injustice, and quite frankly, I can stand by idly while others fight for things I ",
  "image": "",
  "readTime": "4 min",
  "content": [
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "This past week has been pretty bewildering. Because, of course, I ",
          "marks": []
        },
        {
          "_type": "span",
          "text": "am",
          "marks": []
        },
        {
          "_type": "span",
          "text": " a person of privilege, I’ve never known racial injustice, and quite frankly, I can stand by idly while others fight for things I take for granted. It also means that if I just wait long enough, if I just sit here at home and don’t make a peep, and wait for things to subside while I watch Netflix, I can reasonably expect things to ‘return to normal’ without any of this affecting me. It also raises questions like: ",
          "marks": []
        },
        {
          "_type": "span",
          "text": "Should",
          "marks": []
        },
        {
          "_type": "span",
          "text": " I raise my hand? ",
          "marks": []
        },
        {
          "_type": "span",
          "text": "Do",
          "marks": []
        },
        {
          "_type": "span",
          "text": " I have a right to? Is it even appropriate to share an opinion (let alone have one) given the luxury of silence? After some careful introspection, I’ve decided that to not say anything would be a disgrace to posterity, not to mention anyone who might benefit from it. And so, in light of current events, a few thoughts:",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "1.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Last Sunday, America put two men in space after a nearly 9 year hiatus (with a booster that managed to return virtually unscathed back to Earth). An achievement decades in the making, made possible by thousands of people working towards a common goal. Meanwhile, in just about every major city across the U.S., protests broke out over a problem we've had since we first went to space. A problem we’ve been capable of solving for just as long.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "2.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "It's mind-boggling that, while we're capable of such technological feats, we’re still incapable of addressing the same problems from half a decade ago. It’s even more astonishing that—amidst a pandemic that's far from over (true story!)—people are going to war with the very people who make up the safety net that affords them their health, rights, and civil liberties. (All while burdening our hospitals and our economy in the process). Here’s an interesting thought experiment: just think where we'd be right now if all the nurses and doctors and law enforcement officers switched sides. If ",
          "marks": []
        },
        {
          "_type": "span",
          "text": "they",
          "marks": []
        },
        {
          "_type": "span",
          "text": " were the ones who took to the streets, or took the day off, because they’ve simply ",
          "marks": []
        },
        {
          "_type": "span",
          "text": "had enough",
          "marks": []
        },
        {
          "_type": "span",
          "text": " of being treated unfairly. As if no one cares that this is how they earn a living or feed their families, and that the sheer belligerence of people (in failing to acknowledge the consequences of their behavior) is making their jobs and their lives insufferable. (I doubt we’d last two weeks.)",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "3.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Enough is enough.",
          "marks": []
        },
        {
          "_type": "span",
          "text": " The time is now…to speak up, to raise your hand, to fight the system. To acknowledge injustice and make it right. But we’ve got a real problem. And that’s the medium, the repercussions, and the lack of leadership. Protesting by itself does nothing*. Protesting plus destruction of property, plus hostility against people (who clearly aren’t your enemy), plus close contact, ",
          "marks": []
        },
        {
          "_type": "span",
          "text": "that",
          "marks": []
        },
        {
          "_type": "span",
          "text": " does nothing but pit people against each other, spread hate, and yeah, burden our already encumbered hospitals, economy, and people. What I’m saying is that we’d do well to acknowledge ",
          "marks": []
        },
        {
          "_type": "span",
          "text": "synecdoche",
          "marks": [
            "link-0"
          ]
        },
        {
          "_type": "span",
          "text": " and it’s opposite; to discern our friends from our foes, and our actions—even seemingly justified ones—against the crucible of our own integrity. Because the police are not the sum of their parts, and neither is the mob. They’re people. Just like you and me. One mans’ wrong doesn’t justify a thousand afflictions, any more than a thousand good deeds pardons one heinous crime. To paraphrase MLK, it’s “wrong to use immoral means to attain moral ends” and “just as wrong…to use moral means to preserve immoral ends.” “The means we use must be as pure as the ends we seek,\" otherwise, we’re as noble and deserving as our enemies.",
          "marks": []
        }
      ],
      "markDefs": [
        {
          "_key": "link-0",
          "_type": "link",
          "href": "https://www.blog.brendanbockes.com/synecdoche-and-my-lovehate-relationship-with-apple/"
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "4.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "It’s probably worth noting that anger, rage, and indignance by themselves aren’t very helpful emotions. (History doesn’t award people for breaking things.) The ability to channel those emotions, however—leveraging them to produce positive action, perseverance, and genuine change—",
          "marks": []
        },
        {
          "_type": "span",
          "text": "that’s",
          "marks": []
        },
        {
          "_type": "span",
          "text": " a great thing to have, and it’s exactly what we need. ...",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "*What I mean is that protesting in and of itself does nothing (not that protesting is ineffective). Certainly, protesting can stir public opinion and turn the levers of a society, but protests without those things are merely displacements of people and things. Mass demonstrations--and the freedom to partake in them--are in many ways a physical reflection of our democracy. (One might argue that America wouldn't be what it is today without the freedom to publicly make one's opinions heard in mass). So, to clarify, I'm not objecting to protesting by itself, but I think given the context of us recovering from a very real pandemic, we would do well to make our opinions heard through other (non-violent, less risky) mediums of expression, while being thoughtful and intentional about the change we're collectively trying to make.",
          "marks": []
        }
      ]
    }
  ]
}