{
  "title": "Thoughts from my trip to stein mart and home goods",
  "slug": "thoughts-from-my-trip-to-stein-mart-and-home-goods",
  "publishedAt": "2017-09-27T10:57:25.000Z",
  "excerpt": "Went to Stein Mart and Home Goods the other day with my Mom. They’re not really up my alley, hence my need to distract myself by drifting around asking “why?” I’ve decided you can actually learn a lot",
  "image": "https://blog.brendanbockes.com/wp-content/uploads/2017/09/6a01a73dc1cc30970d01b7c9247f11970b-320wi-225x300.jpg",
  "readTime": "3 min",
  "content": [
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Went to Stein Mart and Home Goods the other day with my Mom. They’re not really up my alley, hence my need to distract myself by drifting around asking “why?” I’ve decided you can actually learn a lot using this technique. Here’s a few of my (unassorted) thoughts:",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "How come no one sells a brand of male undergarments that have fat out-of-shape dudes on their packaging? In addition to poking fun at the competition, the unorthodox marketing would take care of itself.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "There’s a huge market for fancy colorful socks and ties these days. Emerging artists should try their hand at abstract art and team up with a manufacturer. They could then sell abstract art socks and ties that many people would buy (I would) and others would comment on, creating essentially free word-of-mouth publicity. Compare this with how the Mast Brothers have created a unique (and well-known) brand image by applying art to their chocolate bars.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Why does Santa always have to be doing Santa-y things? The person(s) who designed this could easily have had Santa doing all manner of professions or hobbies. He could be jamming out on a saxophone or examining an x-ray, or putting out of fire, or gazing through a telescope. Sure it’s unconventional, but that’s the point.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "How do you how to assess the quality of a $200 armchair in a discount department store?",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "I think we can all agree fidget spinners are yet another modern toy we don’t need, let alone (as adults) want to be seen in public using. That said, if you already have this in your inventory (or if someone up the pipeline shipped it to you) how do you best market it? I think a good strategy might be to take advantage of the fact that (we know) it’s a useless and distracting toy. Point it out. Place adjacent signage that tells customers, “yeah, we know you want one…and by the way it is on sale, but you could do this instead.”",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "You could even sell books on meditation and useful stress-reduction techniques and place them nearby. If they already intended on purchasing a spinner, they probably will anyway, but by giving free advice and poking fun at the frenzy of buying the latest fad, they’ll be much more likely say good things about you to their friends. They might even come back next week for that book.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Continuing on the idea of giving advice to your customers, wouldn’t it be great if the staff at SteinMart recommended their favorite shirt (or the shirt they’d most like worn by their significant other), similar to all those “what your girlfriend wants you to wear” articles in mens magazines. Just some simple curation, a friendly gesture in the process of decision making for people who would otherwise have no clue.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Similarly, the staff at Home Goods could actually try the assortment of olive oils they sell, and add post-it note size signage under each bottle that includes what they think each one tastes like and each member’s favorite. (Many bookstores have already caught on to this concept.)",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "What’s important is that they share their opinion, not necessarily if they are correct in their estimates. It's a great (free) technique retailers can use to make a connection and create the spark of a word-of-mouth conversation down the road, increasing sales and improving customer retention.",
          "marks": []
        }
      ]
    }
  ]
}