{
  "title": "Tiers of belief",
  "slug": "tiers-of-belief",
  "publishedAt": "2019-03-28T06:48:00.000Z",
  "excerpt": "In  Thinking in Bets , Annie Duke talks about how for our early ancestors, assuming an opinion was inherently true before validating it served as an evolutionary advantage.",
  "image": "",
  "readTime": "3 min",
  "content": [
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "In ",
          "marks": []
        },
        {
          "_type": "span",
          "text": "Thinking in Bets",
          "marks": [
            "link-0"
          ]
        },
        {
          "_type": "span",
          "text": ", Annie Duke talks about how for our early ancestors, assuming an opinion was inherently true before validating it served as an evolutionary advantage.",
          "marks": []
        }
      ],
      "markDefs": [
        {
          "_key": "link-0",
          "_type": "link",
          "href": "https://www.amazon.com/Thinking-Bets-Making-Smarter-Decisions/dp/0735216355"
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "So it’s no surprise that that the culture we we’re born into often dictates how we come to see the world, what religon we embrace (or abandon), or what filters we rely on to cut through the noise.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Whether we’re conscious of it or not, there is indeed a comfort, a pull of sorts, in merely accepting the notions that we read about, hear about, or see on tv. Add to that the tendency to seek out information from sources that ",
          "marks": []
        },
        {
          "_type": "span",
          "text": "confirm",
          "marks": [
            "link-0"
          ]
        },
        {
          "_type": "span",
          "text": " our beliefs and it’s easy to see how our biases, predispositions and worldviews take hold.",
          "marks": []
        }
      ],
      "markDefs": [
        {
          "_key": "link-0",
          "_type": "link",
          "href": "https://en.wikipedia.org/wiki/Confirmation_bias"
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "One solution around this handicap (among many) is to acknowledge that anything you read about or hear about is a very different level of belief than things you have direct experience with. Most of us, for example, have never been to space, so the way we know the Earth revolves around the Sun has very little to do with our direct observation of the natural world, and more to do with what the culture we choose to embrace.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Replace that culture with something else (internet chat rooms made by and for conspirary theorists, for example) and you can begin to (slightly) understand those who ",
          "marks": []
        },
        {
          "_type": "span",
          "text": "vehemently",
          "marks": [
            "link-0"
          ]
        },
        {
          "_type": "span",
          "text": " believe we’ve been lied to.",
          "marks": []
        }
      ],
      "markDefs": [
        {
          "_key": "link-0",
          "_type": "link",
          "href": "https://youtu.be/nuAoQsrYJqI"
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Of course, science — the belief in science — is a “first tier” belief for many people, as well. Most people aren’t scientists, and wouldn’t even know how to conduct a true experiment if they tried. And if don’t understand how to do that, let alone read a scientific journal, then it’s easy to assume that science is just a word you attach to things that occur in reality (whether or not you can validate those things or not).",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "What makes the belief in science go from a “first tier” belief (based on your impression of science) to a “second” is confirmatory evidence. Proof establishing a fact of life, based on the systematic study of the natural world through observation and experiment. In other words, science is what makes “science” more than just a word, but an idea that permeates everything it touches.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Beliefs, then, come in three tiers. You believe what you believe because…",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "listItem": "number",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "People told you.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "listItem": "number",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "You proved a hypothesis correct yourself.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "listItem": "number",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "You got (a random sample of) other people to do the same thing you did and they got similar results.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Most people’s beliefs remain on the first and second levels. And the way you go from first tier to third tier is science. Science based on personal exposure and then, objective verification.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "If you’re not willing to test your conculsions (let alone embrace the notion that you can test them with an objective method) then you’re merely resigning yourself to accepting the world as you see it. Naive to the world that exists. It’s prescribing to the blue pill, over and over again.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "The alternative is to take inventory your first (and second) tier beliefs, to acknowledge them, and to find a way to substantiate their claims. It’s not easy, but it’s a path to seeing the world as it is, not merely how you see it.",
          "marks": []
        }
      ]
    }
  ]
}