{
  "title": "Today i went to the gym for the first time in months",
  "slug": "today-i-went-to-the-gym-for-the-first-time-in-months",
  "publishedAt": "2015-03-17T19:38:05.000Z",
  "excerpt": "I originally purchased a gym membership back in February with the intention (albeit the discipline) to go workout everyday after work.",
  "image": "",
  "readTime": "3 min",
  "content": [
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "I originally purchased a gym membership back in February with the intention (albeit the discipline) to go workout everyday after work.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "That said, every day since said purchase, I’ve previously failed to bribe/cajole/force/will myself to set foot in said gym, despite it being literally a few yards away from my work location.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "So…what changed?",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "What did I do differently today that encouraged me to run on a treadmill for half an hour?",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "A few things, I think. First, I slept pretty darn good last night, clocked my 8 hours in, and woke up well rested. Second, I had a nutritious breakfast (eggs and coffee) and lunch (brown rice, black beans, chicken and veggies) earlier today. That certainly helped provide some energy. And this morning, since I arrived at work early, I meditated for 20 minutes in my car. That, I think, cleared up my mood, and probably primed me to focus on my priorities instead of, well, everything else.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "We often think that we lack discipline or willpower to get up and do the things we need to/want to do in our efforts to create realities that align with our goals. But what if that’s not true? What if the real problem is that we’re simply not getting enough energy and/or are far too stressed out/in our head to go about working towards our goals? I think how we act, that is, what we decide to do, is influenced just as much by our psychology and physiology (how we think and feel) than our own conscious ability to choose or not choose.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "That might sound obvious to a lot of people, but I think it’s an idea with profound implications. Once you realize that you can literally change how you feel (and what you do) by changing what you eat and how you sleep, and maybe throwing in a 20 minute mindfulness practice every morning, things have the potential of being a lot easier for you.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "When you get your head straight, when you fuel up on clean energy, when your well rested, everything is easier. Whether it’s work, or parenting, or making art, you’ll have more energy and a greater tolerance to fear and leaning in to vulnerability. Furthermore, you’ll be less likely to bargain with yourself, trying to cajole your emotional lizard brain into doing what you truly want it to.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "So, if you feel stuck in a well of inertia, or if you simply don’t think you have the willpower or discipline to pursue your goals, or give up certain vices, consider what you’re eating, how you’re sleeping and where you mind is at, and their ability to control how you feel and what you do.",
          "marks": []
        }
      ]
    }
  ]
}