{
  "title": "Too sweet not spicy",
  "slug": "too-sweet-not-spicy",
  "publishedAt": "2019-06-23T07:41:00.000Z",
  "excerpt": "Sometime ago I  wrote  about how the American diet is ruining our sense of taste, and the pressure that often puts on people who cook for a living.",
  "image": "",
  "readTime": "3 min",
  "content": [
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Sometime ago I ",
          "marks": []
        },
        {
          "_type": "span",
          "text": "wrote",
          "marks": [
            "link-0"
          ]
        },
        {
          "_type": "span",
          "text": " about how the American diet is ruining our sense of taste, and the pressure that often puts on people who cook for a living.",
          "marks": []
        }
      ],
      "markDefs": [
        {
          "_key": "link-0",
          "_type": "link",
          "href": "on-sugar-and-preserving-good-taste"
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Recently, I realized it goes far beyond that. Because our food culture doesn't just encourage chefs to make their pasta sauce a little sweeter. It also puts pressure on whole cuisines to conform to a standard of cooking.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Consider, for example, that the carry out you last ordered is likely a far cry from what you'll find in China. Or the fact that everything from buttered chicken to mango lassi at your local indian joint is vastly oversweetened.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Or consider the case of the Phad Pi King I was served just last week...something that should have been very spicy (and not sweet), that was, and is consistently being served, as a very sweet, mildly spicy entree.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "The fear is that if these ethnic chefs don't cater to the American taste, they won't have enough customers who will actually eat at their restaurants. But in doing so, they're doing something even more dubious: reinforcing a culture (and an alternative cuisine) that encourages other similar restaurants to adopt the same standards.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "That's why nearly every Chinese restaurant serves General Tso's even though it's not authentic. And why if you go to the origin of an ethnic dish, you'll find that it's generally a completely different (less sweet, more complex) dish than what you'll find in the States.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "The question is, what happens when the sweeter, less nuanced version goes mainstream? When it's difficult to find genuinely authentic fare, even in the place where it originated. When mass adoption and tourism put pressure on an local cuisine, to shape up or shut up, to stay competitive?",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Obviously, the onus here is on the restauranteur, which can feel risky, and I get that. But the risk of losing a whole cuisine (or at least the most authentic version of one) is far more scary, one that I doubt many chefs or foodies would support.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "So yes, you will disappoint, disgruntle and lose customers, one's who either think it's too bland-not enough sugar or salt-or so full of spice or earth or unami that it's incredulous.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "But at the same time, you'll also delight the customer who actually appreciates your un-doctored approach.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Serving the few who matter-",
          "marks": []
        },
        {
          "_type": "span",
          "text": "who care",
          "marks": []
        },
        {
          "_type": "span",
          "text": "-might get you haters. But dumbing it down, averaging it out, rounding the corners...just to please the crowds, is far worse.",
          "marks": []
        }
      ]
    }
  ]
}