{
  "title": "Two ways to get an education",
  "slug": "two-ways-to-get-an-education",
  "publishedAt": "2018-01-30T10:29:57.000Z",
  "excerpt": "I realized today that going to a 4 year college isn’t so much a bad deal if you know what you’re signing up for.",
  "image": "",
  "readTime": "3 min",
  "content": [
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "I realized today that going to a 4 year college isn’t so much a bad deal if you know what you’re signing up for.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "If you go to college and hate taking exams and fluff assignments and homework and writing papers, obviously, it’s not a good fit. Traditional education is built on the diploma, the certificate of completion. The only way teachers and administrators have yet to validate your competency (for job hunters) is to give you tests and assignments that they can use to grade, and thus measure, your mastery of a skill or knowledge base.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Thus, if you find yourself taking the contrarian view, resenting the tests and the grades they enforce, as well as the predictability of an assigned curriculum, it doesn’t mean the school or society are at fault. It just means you might be an idealist. And that (for now) you simply chose the wrong way to get an education, and a job.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "It’s entirely possible to spend 8 hours a day learning anything you want on a laptop in the library. Or connecting with experts in an established field and building a network. Or initiating projects that reflect both your mastery of a skill and your ability to lead, connect, and improvise.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Difficult, immensely. Uncertain, guaranteed. But impossible? I don’t think so.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Anyone can take this route. Whether they want to avoid college loans or simply want to find a better job. It can be incredibly gratifying to chart your own path. Just so long as you’re unfailing in your ability to persist in leaving a trail of projects that demonstrate what you know and what you can accomplish.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Their’s an opportunity cost to getting a degree just as much as there is in not getting one. Alas, assessing which path is most appropriate for you is the easy part. The second, and more difficult, is the regular discipline of committing yourself to the program you're on.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "That means not dropping out of school if you find yourself over half-way through your degree program and hating the onslaught of exams, papers, and assignments. Or, not giving up when the job hunt gets discouraging and you're trying to prove your competency by creative means other than your GPA or where you went to school.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Both paths are just as much difficult as they are rewarding. What’s important is recognizing (and committing to) the right path from the start.",
          "marks": []
        }
      ]
    }
  ]
}