{
  "title": "Two types of unreasonable",
  "slug": "two-types-of-unreasonable",
  "publishedAt": "2018-02-09T10:22:43.000Z",
  "excerpt": "There’s the unreasonable of the uncooperative and unaccommodating bully. Who (often) gets what he wants by using brute force and an obstinate attitude as leverage to intimidate those that are more fle",
  "image": "",
  "readTime": "1 min",
  "content": [
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "There’s the unreasonable of the uncooperative and unaccommodating bully. Who (often) gets what he wants by using brute force and an obstinate attitude as leverage to intimidate those that are more flexible. And who in so doing, sacrifices trust in exchange for contempt.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "And then there’s the unreasonable of the headstrong bootstrapper.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "The entrepreneur who doesn’t accept compromise, who’s stubborn and insistent enough to find a better way (when everyone says it can’t be done).",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Or the artist or innovator or organizer who’s ahead of the times, who invents a thing or has a vision for a future that people don’t even know they want yet.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "And, of course, there's the resolute and earnest go-getter. The person who's unwavering about his goals and desires. Who trades willpower in for discipline. And who decides just once (to go paleo, to write a book, to work out, to play the cello, to learn a skill), and then commits — ",
          "marks": []
        },
        {
          "_type": "span",
          "text": "everyday",
          "marks": []
        },
        {
          "_type": "span",
          "text": " — to a practice, to process, or to a lifestyle.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "For the aspiring change-maker, “no excuses” is a great motto to live by.",
          "marks": []
        }
      ]
    }
  ]
}