{
  "title": "Two ways to motivate people",
  "slug": "two-ways-to-motivate-people",
  "publishedAt": "2017-01-27T09:45:34.000Z",
  "excerpt": "One way is to tell people they’re not moving fast enough or hard enough or that their output isn’t meeting spec. This creates the unsettling feeling that you (presumably the boss) only care about effi",
  "image": "",
  "readTime": "3 min",
  "content": [
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "One way is to tell people they’re not moving fast enough or hard enough or that their output isn’t meeting spec. This creates the unsettling feeling that you (presumably the boss) only care about efficiency as a metric for success, as opposed to connection, making a difference, or bringing innovative ideas to light. It also shows people that you don’t recognize the hard work they’ve already put in. This can make your employees resent you (and ironically slack off) when they feel like they’re honestly meeting your expectations, but you’re motivational style neglects they’re effort.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "The other way, I think, is to create a culture where you don’t need to curtly remind them that you need a task done by 5 pm simply say “great job.” Tell your employees and coworkers and kids and students, “that looks amazing, keep up the good work.” Say something nice, that motivates and catalyzes their enthusiasm. Certainly if they’re falling short, you can suggest solutions. Maybe there’s a better technique or strategy. Maybe they could prioritize more. But don’t say “could you pick up the pace, you have a lot more work to do.” That’ll just create disillusionment.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Maybe you need to verify what they’re working on or what they’ve accomplished. Fine. But trust them first, then verify. You don’t need to go around micromanaging every single thing they do throughout the day, you simply need to buy into the idea that these are smart people capable of doing quality work that meets deadlines. If you tell them what to do and how to do it the first time or second, they’ll generally know what to do the next time. They don’t need you telling them what to do every single time. That too, will only result in backlash.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Something I learned early on in my career is that “expectations drive attitude which drives results.” People generally try to meet the expectations you set out for them, and it’s that expectation that creates the attitude and the culture that gets people working hard and meeting spec and delivering results. Expectations drive attitude which drive results; motivation simply encourages people to keep up the pace with energy and enthusiasm. Motivating your people is not having a conversation about what your expectations are or restating a deadline or reminding them how you need them working harder, better or ",
          "marks": []
        },
        {
          "_type": "span",
          "text": "faster",
          "marks": [
            "link-0"
          ]
        },
        {
          "_type": "span",
          "text": ". You should have those expectations set before they start.",
          "marks": []
        }
      ],
      "markDefs": [
        {
          "_key": "link-0",
          "_type": "link",
          "href": "https://www.youtube.com/watch?v=gAjR4_CbPpQ"
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Alas, if you want your people to do a great job (and feel motivated), you have to set the bar high and clearly identify what you want them to do and in what amount of time they should allot themselves to accomplish it. You have to clearly articulate your goals (big and small) or people will just decide for themselves what is quality work and what pace is appropriate. If you identify how to do something well and on time, with enthusiasm, you’re employees will know the difference between when they’re slacking off as opposed to when you have unrealistic expectations. And they’ll respond to your encouragement by continuing to do the things they know are required to meet your deadlines, as opposed to resenting you and ironically slacking off because they believe you simply don’t care about them or the work they’ve contributed.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "So, set clear expectations, show your people how to complete a task on time, effectively and with enthusiasm, and motivate via encouragement, not reprimand. That’s the only way I know to create a culture where people consistently produce results confidently and efficiently. Not constantly regurgitating the concept of “work harder.”",
          "marks": []
        }
      ]
    }
  ]
}