{
  "title": "Unicorns are a myth",
  "slug": "unicorns-are-a-myth",
  "publishedAt": "2021-05-08T05:07:00.000Z",
  "excerpt": "There's an impetus for every organization to overdeliver. Because to compete in a crowded marketplace--to be the best--you have to commit to doing more than most.",
  "image": "",
  "readTime": "2 min",
  "content": [
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "There's an impetus for every organization to overdeliver. Because to compete in a crowded marketplace--to be the best--you have to commit to doing more than most.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Where this us gets into trouble is when what we ask of others is more than what’s realistically possible. And when—in a vain attempt to meet those demands—we (as employees) make promises we can't keep. Because what we’ve said we'll do comes up against our limits.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Because, every person has them. What they're good at. What they aren't. What they can do well and what they can't.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "That when we ask for too much (of the people we employ, or the groups of people we do business with) they will be tempted to promise more than they can realistically contribute. And when we inevitably hire them and ask them to do the job, they may have to cut corners to do what we expect. Not because they're scoundrels. But because by asking for more than we really need, we're creating a culture were the only way to have a job (at some companies) is to make promises employees can't know ",
          "marks": []
        },
        {
          "_type": "span",
          "text": "with certainty",
          "marks": []
        },
        {
          "_type": "span",
          "text": " they can keep.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "A better strategy, I think, is to acknowledge this than to ignore it. To--as an employer--get crystal clear about the skills you need for the job you'd like to fill. Or, as a business owner, to know what promises your partners are truly making—what they can really do well—rather than assuming it's all part of the deal.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "It’s goldilocks all over again. Asking too much or promising too little is foolish. What works is sticking to what’s reasonable.",
          "marks": []
        }
      ]
    }
  ]
}