{
  "title": "We rely on so much",
  "slug": "we-rely-on-so-much",
  "publishedAt": "2017-01-18T15:01:35.000Z",
  "excerpt": "Food at the local grocery store. Electricity in our homes. People making things for other people.",
  "image": "",
  "readTime": "2 min",
  "content": [
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Food at the local grocery store. Electricity in our homes. People making things for other people.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Beds. Blankets. Books. Smartphones. Heaters. AC’s. Ovens. Microwaves. Lights. Bathrooms. Indoor plumbing. Homes. Computers. Cars. Highways. Medicine. Soap. Toothpaste. Music. Art. The internet. Just to name a few.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "If a subset of our population, farmers for example, decided to quit showing up to work for a month in June, we’d all get sick and die. Vitamin deficiency’s kill people. Farmers make the world go round.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Or what if the engineers at the power plant took off a few days? No power. No smartphone. No internet. No heater. No oven. No microwave. No way to call for help. Engineers make the world work.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Or doctors. Or nurses. Or pharmacists. Or firefighters. All it takes is one off day and thousands of people get sick or die.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Or the people who make soap? Infection galore. Or the folks who ship and stock your food at the grocery store. What food?",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "How about artists of all kinds? Painters and photographers and musicians and teachers and internet celebrities and bloggers and writers and any other sort who make an impact, doing work that changes people. I don’t think one day will make much difference, but how about a lifetime? If we just go along day by day without really experiencing the world or daring to connect or create or spread ideas or challenge the status quo, I don’t think life can sustain itself either. Yes. We need artists too.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "The truth is we rely on so much just to get by.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "What a mistake it is then to think we can do it all ourselves. Or that the world owes us anything. Or that we’re somehow better (because of our connections or our privilege or our affluence or our competence) than other people.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Society is an ecosystem. We need each other. Now more than ever.",
          "marks": []
        }
      ]
    }
  ]
}