{
  "title": "Whats worth paying for in a game",
  "slug": "whats-worth-paying-for-in-a-game",
  "publishedAt": "2019-10-04T06:40:50.000Z",
  "excerpt": "Be it ten more minutes in Time Crisis or another round in Tekken, game manufacturers have (for decades) charged people for more game time.",
  "image": "",
  "readTime": "3 min",
  "content": [
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Be it ten more minutes in Time Crisis or another round in Tekken, game manufacturers have (for decades) charged people for more game time.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "And back when I played ",
          "marks": []
        },
        {
          "_type": "span",
          "text": "video games",
          "marks": [
            "link-0"
          ]
        },
        {
          "_type": "span",
          "text": ", it wasn’t uncommon to pay for the occasional map pack.",
          "marks": []
        }
      ],
      "markDefs": [
        {
          "_key": "link-0",
          "_type": "link",
          "href": "https://blog.brendanbockes.com/on-video-games-and-listening-to-your-tribe/"
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "But now, more than ever, gamers are paying for many things that don’t directly add to their experience of the game. This includes cosmetic skins, perks, power-ups, and even ways to ‘undo’ many of the challenges inherent in the game.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Moreover, many new games are now made with DLC money-making systems built right into the consumer product. Either developers hold back part of the game’s development, or make it almost impossible to compete with other players without paying for additional accessories.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "And that’s just in the video game space. Games stretch far beyond the traditional world of flat-screen entertainment. Getting into a famous college is a game. So is climbing the corporate ladder, or making a profitable business.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "This prompts the question: in games of all kinds…what’s worth paying for, and what isn’t? Is it worth paying extra for a shortcut? And, if so, how much? Is there a limit? And, at what point, if ever, does it cease to be ethical?",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Paying for a reasonably priced cosmetic skin (or a professional font for your resume) is one thing, but what about paying for high-priced performance gear, or access to premium assets that go far and above what is appropriate? What if the cost of winning exceeds the equitability of meritocracy?",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "In other words, if you have an unfair advantage, is it even worth it?",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Just as with PED use in baseball, I would argue ‘no.’ But I know that many people (hardcore gamers, shareholders, politicians, business professionals and even parents) will indubitably argue ‘yes.’ That if some people are allowed to play the game that way (or if there isn’t yet a rule to regulate it), it makes it ‘fair play’ for everyone else to as well.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Of course, this mentality completely ignores the the spirit of the game. Because it turns out, playing to win by any means corrupts the game entirely. Give it enough time, and people will do ‘whatever’ it takes to win…which (of course) completely abducts the value of winning. After all, you can’t ‘win’ a game that has no rules.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Point is, paying for an augmentation is not the same as paying for a shortcut. Shortcuts might seem small and inconsequential, and they often are…until they aren’t. Given a long enough time frame, shortcuts can make ‘cheating’ seem normal, and when enough people adopt those tactics, you might realize it’s no longer worth playing that game to begin with.",
          "marks": []
        }
      ]
    }
  ]
}