{
  "title": "What kind of criticism are you looking for",
  "slug": "what-kind-of-criticism-are-you-looking-for",
  "publishedAt": "2019-04-05T06:27:00.000Z",
  "excerpt": "Constructive criticism can be an invaluable resource for craftsmen looking to improve their work. Of course, for the artist seeking to do something in a way that no one yet has, discerning between hel",
  "image": "",
  "readTime": "4 min",
  "content": [
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Constructive criticism can be an invaluable resource for craftsmen looking to improve their work. Of course, for the artist seeking to do something in a way that no one yet has, discerning between helpful and unhelpful criticism can be challenging.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "It’s one thing to seek feedback from someone who’s going to get the joke and who understands what you’re trying to do, entirely another to look for it in places where people are going to dumb down your work or trivialize the best parts.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "One useful metaphor that helps to think about this is the discernment between editing and proofreading.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Editing is what you do throughout the writing process. These are the revisions you make between the first and final draft, picking apart your document for style, structure, content, clarity, and concision.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Proofreading is what you do after your final draft is finished. The focus is on surface errors like mistakes in grammar and punctuation, without the modification entailed in editing.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "You should find an especially talented revisor who will edit your work but keep the style, structure and content consistent with what you’re trying to do. Same goes for any artist, be it a filmaker, musician, poetist, comedian, etc.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Thus, it’s absolutely essential that they’re less of a stickler for “proper” structurual rules as they are aware of your own unique style, what it tastes like, and what you can do to realize its full potential.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "A proofreader, in contrast, is what commonly comes to mind when you think about an editor. A fussy someone who cares more about crossing your t’s and dotting your i’s than how the thing makes you feel. Proofreaders can be a great help in getting your transcript ready for print, or finalizing your recording for the airwaves, but it’s best to consult with them only until after you’re finished editing.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Many great books wouldn’t be nearly as good as they are if they relied on a standard grammarian for both editing and proofing. And many genre-defining musicians would never have realised their musical genius if they made music with the sole intent of pleasing a recording artist (or radio producer). Great artists, after all, break the rules, that’s how new things come to exist.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "The point is, don’t confuse a brilliant editor from a regular proofer from a novice critic. The vast majority of critics are going to harshly criticize your work, and what you’ll find is that they’re most criticizing you (not your work), because that what critics do. Most other critics are going to help point out (a lot of) surface level details like if you sound a little flat or when to use an oxford comma. These are proofreaders, and it’s best to work with them at the tail end of the production process.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "The best critics, the one’s worth seeking out, are editors. They are the one’s who are going to work with you to try to help you ",
          "marks": []
        },
        {
          "_type": "span",
          "text": "improve",
          "marks": []
        },
        {
          "_type": "span",
          "text": " upon what you’re already trying to accomplish. They’ll be a lot more friendly because a) they genuiely care, and b) they’re not trying to prove anything and c) they’re completely fine with you breaking a few unwritten rules (they’ll mostly think it’s cool).",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Seeking out the advice of proofreaders (or harsher critics) for editing can often create a lot of headache and disillusionment, causing many people to homogenize their work, or worse, give up altogether.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Don’t do that.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Instead, be careful who’s opinion matters. If a critic isn’t helping you clarify or add to what you genuinely like about your work, ",
          "marks": []
        },
        {
          "_type": "span",
          "text": "fire them",
          "marks": []
        },
        {
          "_type": "span",
          "text": ". Look for someone you sees what you see, you gets it, who likes your ideas and wants to make them better.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Editor’s are far harder to spot (they probably won’t be in the comments section, or among your greatest fans or friends). Of course, learning how to discern between an great editor, a proofreader, and any old bloke is the first step. Well worth the investment.",
          "marks": []
        }
      ]
    }
  ]
}