{
  "title": "Whats the piano for",
  "slug": "whats-the-piano-for",
  "publishedAt": "2016-05-24T12:43:52.000Z",
  "excerpt": "The new high school in my county bought a $125,000 Steinway & Sons  piano  recently, and alas, there's been a huge amount of controversy about it on social media.",
  "image": "",
  "readTime": "5 min",
  "content": [
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "The new high school in my county bought a $125,000 Steinway & Sons ",
          "marks": []
        },
        {
          "_type": "span",
          "text": "piano",
          "marks": [
            "link-0"
          ]
        },
        {
          "_type": "span",
          "text": " recently, and alas, there's been a huge amount of controversy about it on social media.",
          "marks": []
        }
      ],
      "markDefs": [
        {
          "_key": "link-0",
          "_type": "link",
          "href": "http://www.insidenova.com/headlines/exclusive-prince-william-buys-steinway-piano-for-new-high-school/article_c385d324-0d42-11e6-9b6a-232b5c71e0af.html"
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Here's my thinking:",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "It's great the county is finally spending money supporting the arts. There’s obviously some symbiotic meaning attached to the piano, in that it shows that the school board values not only a formal education for our students, but an arts education as well. I get that.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "However, as Seth has ",
          "marks": []
        },
        {
          "_type": "span",
          "text": "pointed out",
          "marks": [
            "link-0"
          ]
        },
        {
          "_type": "span",
          "text": " before, the problem we usually make when making big decisions with money is that money is just a number. It’s not a tangible thing, and so we have nothing to compare it to. So what we generally do is contrast the expensive purchase (with the often great-deal price tag), something that is supposedly our self-affirmed dream (a single experience that we couldn’t imagine having any other way) with the depressing reality of what life will be like without that thing. Because we’re just giving up a number, we go for it. But what we often fail to consider are all the alternative routes we could take using that same investment if we didn’t make that huge purchase. If you can introduce the idea that this intangible number you’re supposedly giving up for that once-in-a-lifetime thing can instead be used in other ways that are just as valuable, you can make better decisions. This is because, as Seth says, “suddenly, you're not comparing ‘this is my dream,’ with a number that means very little. You're comparing one version of your dream with another version.”",
          "marks": []
        }
      ],
      "markDefs": [
        {
          "_key": "link-0",
          "_type": "link",
          "href": "http://sethgodin.typepad.com/seths_blog/2012/03/making-big-decisions-about-money.html"
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Now, consider for a moment the opportunity cost of $125,000 with the goal of teaching kids music and developing a lifelong passion for it:",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "listItem": "bullet",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "You could have purchased 1,000 of these, given one to every kid in all 3 music programs (band, orchestra and choir), still have extras, and have money left to purchase other things like a Pianu masterclass (more on that below).",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "listItem": "bullet",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "If you had done your research (that is to say, if you had searched the interconnected web providing you with a nearly infinite resource of potential alternatives) you would have discovered amazing services like Pianu, which provide a full on master class on piano and music theory using really cool software. Pianu teaches you how to play piano in a Guitar-Hero like fashion using an optional midi-connected keyboard (like the one in the link above) or a standard computer keyboard. It then gives you the opportunity to learn to play pop-hit songs and well known songs, in addition to basic music theory. That said, for $35 per student, you could have outsourced the entire piano learning/basic music theory curriculum to a pre-made digital website with an outstanding and simple user interface, that teaches kids these concepts in a fun and engaging way.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "listItem": "bullet",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Another thing to consider: you could have paid a famous musician to come in for a week once a year and teach your students about music and what it means to be a musician (just think of what publicity you’d get if you hired Adele to come visit for a week). You could also have paid 20 lesser known independent musicians and/or music teachers (preferably some that actually attended PWC schools) to come in and teach music over the course of a year, and then follow up with a bad-ass concert showcasing a variety of different musical genres and styles. Why limit it to just the sounds of a 300 hundred year old instrument?",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Also! Who's going to be playing this piano? Can all the students in the school come in a play the thing? Of course not! It'll be restricted to just band kids! That's like only 60 kids at most! And at this rate, they'll probably have to be authorized to play the damn thing, and there'll be queue, because all the illegible ones will want to play it. And seniority and skill applies too. So were talking more like maybe 15 kids at best per year, and that’s only on concerts and special performances. Is $125,000 worth providing the greatest piano ever to those 20 kids? Ideally, yes. But school budgets are a less than ideal situation.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "One last point, and probably the most important: what is this piano for? Is it to showcase that this is a new school that places an emphasis on quality education using the best teachers and tools? That is to say, is it more about symbiotic meaning? Or was it really purchased with the intention of teaching 100 or 200 kids a year how to play music, as well as what great music sounds like?",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "The great thing about music is you don’t need to buy it for every single student that enters the band room. You pay $10.00 a month for a streaming service, turn up the volume on some nice speakers (",
          "marks": []
        },
        {
          "_type": "span",
          "text": "these",
          "marks": [
            "link-0"
          ]
        },
        {
          "_type": "span",
          "text": " would do) and press play.",
          "marks": []
        }
      ],
      "markDefs": [
        {
          "_key": "link-0",
          "_type": "link",
          "href": "http://www.amazon.com/gp/product/B008NCD2S4/ref=as_li_tl?ie=UTF8&camp=1789&creative=9325&creativeASIN=B008NCD2S4&linkCode=as2&tag=ehne-20&linkId=SSTMEMGBYGH2PCJF"
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Everyone can hear it, everyone can experience it.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "In an age where music is ubiquitous, with services like Spotify that allow you to play basically the entire world’s catalogue of music at a low monthly price that’s less than the cost of a fast-food meal, it’s not expensive to play music for the mass of musicians entering your classroom every day. And teaching music? Well, I’m pretty sure that’s what we pay the band teacher for. The reality is no one needs a hundred and twenty-five thousand dollar, let alone a twenty-five thousand dollar instrument to learn how to play and appreciate great music.",
          "marks": []
        }
      ]
    }
  ]
}