{
  "title": "Whats weird and why a guide to better decision making",
  "slug": "whats-weird-and-why-a-guide-to-better-decision-making",
  "publishedAt": "2016-05-25T10:52:19.000Z",
  "excerpt": "I started working out regularly about a year ago, mainly because I was so tired of seeing a very large and unhealthy version of myself in the mirror.",
  "image": "",
  "readTime": "4 min",
  "content": [
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "I started working out regularly about a year ago, mainly because I was so tired of seeing a very large and unhealthy version of myself in the mirror.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "One thing that’s sort of played out over the course of twelve months, however, is that I’ve been following a somewhat erratic gym schedule. I generally work 2 to 8 at my current job, so sometimes I try to get a workout in before work, generally around noon. But most days, and especially on my days off, I wait until late at night to go in, sometimes starting at 6, sometimes at 8 and sometimes even at 10:00 pm.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Something that’s sort of been in the back of my mind and only struck me recently, however, is that working out this late at night originally felt really weird for me. Looking back to just a year ago, I never used to go out of my way to get a workout in, especially since I could just skip it and go the next day. That sort of behavior was something I just wouldn’t do. Not because I was against it in any way, but more because it was weird and sort of out of my comfort zone. And I think coming from a family and a group of friends where that sort of behavior isn’t the norm, where they wouldn’t even consider it an available option, it’s understandable that this would make me feel (literally) uncomfortable. After all, driving to the gym at 9 pm to get a workout in after work isn’t something we do, “we” defined as everyone I know and hang out with and talk to. It wasn’t until I started working out out regularly, and going to the gym later into the day that I realized that there are many people that view their daily workout as a top priority, and are willing to come in even as late as 9 or 10 pm to uphold that commitment.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "How strange is it that our culture of friends and family shape our world in ways we're unaware of?",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "I think the lesson here is that it’s not just \"",
          "marks": []
        },
        {
          "_type": "span",
          "text": "this is what we do around here",
          "marks": [
            "link-0"
          ]
        },
        {
          "_type": "span",
          "text": ",\" that defines your group or your team or your culture. “Who we are” is defined just as much by what we don't do, by deliberate choice, or by passive inaction, as the things we do proactively. In other words, the things you don’t do because they simply haven’t crossed your mind as available options define you and the people you spend your time with just as much as the things you choose to do.",
          "marks": []
        }
      ],
      "markDefs": [
        {
          "_key": "link-0",
          "_type": "link",
          "href": "http://sethgodin.typepad.com/seths_blog/2013/07/people-like-us-do-stuff-like-this.html"
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "What would be weird (and literally feel weird) doing because it's clashes with the status quo of your culture and background and paradigms. What could you be doing with your career or your dating life or your workout regime that were previously non-existent alternatives?",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "For someone, somewhere, who's family's a bunch of health nuts (and yes, I’m aware that could be you), working out late at night just to get that workout in is probably the norm. It’s probably expected. Assuming you’re not a health nut, your weird is their normal, and their normal is your weird.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "The question to keep in mind is this: when decisions come up, from what to eat on the menu, to what you should be doing at 8:00 pm on a weekday (or weekend), to what car you drive or how you should find a romantic partner, ask yourself, is the decision I’m making an acceptable one simply because it’s what “people like me” do and therefore not weird, or I’m making this decision because it’s a genuinely smart move. Don’t be afraid to go outside the limits of your perceived culturally defined comfort zone. Don’t be afraid to see what exists, what’s out there. From “weird” ",
          "marks": []
        },
        {
          "_type": "span",
          "text": "diets",
          "marks": [
            "link-0"
          ]
        },
        {
          "_type": "span",
          "text": " (there’s that word again) to late night workouts, to ",
          "marks": []
        },
        {
          "_type": "span",
          "text": "EV’s",
          "marks": [
            "link-1"
          ]
        },
        {
          "_type": "span",
          "text": " and ",
          "marks": []
        },
        {
          "_type": "span",
          "text": "daygame",
          "marks": [
            "link-2"
          ]
        },
        {
          "_type": "span",
          "text": ", the reality is there are a multitude of ways you can navigate your life.",
          "marks": []
        }
      ],
      "markDefs": [
        {
          "_key": "link-0",
          "_type": "link",
          "href": "https://en.wikipedia.org/wiki/List_of_diets"
        },
        {
          "_key": "link-1",
          "_type": "link",
          "href": "http://insideevs.com"
        },
        {
          "_key": "link-2",
          "_type": "link",
          "href": "http://www.daygame.com"
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "What matters is whether or not you are willing to honestly question the actions you take (or don’t take), to question the results of your preconceived notions, and to lean into what feels like foreign territory with the goal of discovering for yourself what works best for you and your lifestyle.",
          "marks": []
        }
      ]
    }
  ]
}