{
  "title": "What goes around",
  "slug": "what-goes-around",
  "publishedAt": "2020-09-04T07:00:00.000Z",
  "excerpt": "I once got lost on my way to a job interview in DC...missing my appointment by 2 minutes. They wouldn't let me in, gave me the go-around, and encouraged me to reschedule.",
  "image": "",
  "readTime": "2 min",
  "content": [
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "I once got lost on my way to a job interview in DC...missing my appointment by 2 minutes. They wouldn't let me in, gave me the go-around, and encouraged me to reschedule.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "I recently had a similar experience: due to a simple mix up, I missed an important call by a few minutes, only to be refused a call-back even when it was within the time frame of the original call. My mistake.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Despite that these power-moves are effective at deterring people from making such mistakes (or are they?)--I find it rather dubious that organizations (or rather, people) resort to them merely to communicate that they 'mean business.'",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "It doesn't help them to waste anyone's time rehearsing the dance of 'interview logistics' a second time around. And--in the event that they don't even give you a second chance, or the benefit of doubt--it actually doesn't allow them to make a more informed, or inclusive decision.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "All in all, it wastes everyone's time and costs them money to boot (both in time in the future, and time already incurred).",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Or consider this example: Many on-call customer service reps have to take hours worth of expensive conflict-mitigation training because their customers often lose it while on the phone. Why?",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "It's not often because the rep is incompetent. It's because the customer experience is faulty or the product is broken or the time it takes to fix it is longer than it needs to be.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "And so, instead of just fixing the problem, organizations have to pay more money to hire properly trained reps to help mitigate the problems they could have already solved. (Making their already frustrated customers lose even more patience and trust in the brand.)",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "It's a vicious cycle that hurts more than it helps because no one benefits. Customers get angry, front-line employees get yelled at, and the folks who manage all this lose money. Everyone pays.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Alas. Before you commit to a power-move, before you look for a band-aid, before make any kind of decision about your brand or your business, it helps to at least acknowledge ",
          "marks": []
        },
        {
          "_type": "span",
          "text": "why",
          "marks": []
        },
        {
          "_type": "span",
          "text": " you're making that choice.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Are you making it because it saves you time or saves you money or makes you or your staff better for it? Or are doing it because it simply makes you feel good in the moment?",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Worth a look.",
          "marks": []
        }
      ]
    }
  ]
}