{
  "title": "What i know about making decisions",
  "slug": "what-i-know-about-making-decisions",
  "publishedAt": "2017-11-20T12:25:15.000Z",
  "excerpt": "To decide (literally) means “to cut.” To sacrifice the security of indecisiveness with the uncertainty of slowly discovering if what you picked was the best choice (or worse).",
  "image": "",
  "readTime": "2 min",
  "content": [
    {
      "_type": "block",
      "listItem": "number",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "To decide (literally) means “to cut.” To sacrifice the security of indecisiveness with the uncertainty of slowly discovering if what you picked was the best choice (or worse).",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "listItem": "number",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Not being able to make a decision doesn’t mean you need more time to consider the opportunity cost of all available decisions. It means you’re afraid of the outcome of making any decision. Of being willing to live with the uncertainty and vulnerability that comes from committing to a compass that might not point true north.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "listItem": "number",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Waiting is stalling. More time doesn’t make it more likely you’ll make a better decision. More time is just an excuse to avoid the feeling of free-fall.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "listItem": "number",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "No map, no direction, no progress. Decisions are the gateway to advancement.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "listItem": "number",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Generally speaking, no matter what you pick, even if you come to find a better path, you won’t regret the decision when looking back over a large enough time frame. Disappointment communicates something. Bad decisions often create the perspective you need to make better ones.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "listItem": "number",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Maybe, logic (or intuition) isn’t the best guide. Maybe, randomness is. Pick from a hat. Do what your friends aren’t doing. Sometimes the best restaurant in town is the one no one is talking about (yet).",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "listItem": "number",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "How do you assess the long-term cost of making a bad decision? How do you know when you’ve made a good one? Is satisfaction (or peace of mind) a target, or is it something we continually fabricate based on where we are now?",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "listItem": "number",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "There’s no such thing as a “good” decision without a list of “bad” ones. You can’t be upset you’ve used Heinz all your life if you don’t know Sir Kensington’s exists. We can only compare looking back.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "listItem": "number",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "You’ll never go anywhere if all you do is wait to make a series of flawless choices. The truth is, you stumble upon the best path by making lots of (sometimes foolish) decisions and learning as you go. Columbus would never have arrived anywhere had he chosen to be a mere map-maker.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "listItem": "number",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Indecisiveness is a byproduct of the lizard brain. It can be seductive to think you’re making the best decision by archiving the important ones. But the reality is, you’re just stalling. Sure, you can make a stellar playlist by queueing up tunes. But you can’t make music unless you hit \"play.\"",
          "marks": []
        }
      ]
    }
  ]
}