{
  "title": "What would you tell a friend",
  "slug": "what-would-you-tell-a-friend",
  "publishedAt": "2021-02-01T07:00:00.000Z",
  "excerpt": "Most people don't seem to have any problem giving their friends what they feel is objective advice. And yet, it's often extremely difficult to speak to ourselves the same way.",
  "image": "",
  "readTime": "1 min",
  "content": [
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Most people don't seem to have any problem giving their friends what they feel is objective advice. And yet, it's often extremely difficult to speak to ourselves the same way.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "That's because we have a narrative. An internal monologue. A filter we use to govern our actions and our beliefs.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "It's hard to be nice (to yourself) when you ought to know better. Just as it's difficult to give yourself the benefit of the doubt when you know all the times you've tried and failed.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Fortunately, most of us would never tell our friends half the things we tell ourselves about ourselves. And fortunately, the advice we do give is much more nurturing.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Perhaps that's why one trick to feeling better about ourselves and our options is to simply give ourselves the same advice we'd give to our closest friends.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "To acknowledge what we'd say to them. To drop the thought-line of what we'd otherwise tell ourselves. And to tell ourselves a story that's filled with hope and possibility, not one that's bogged down by excuses or limitations that are neither realistic nor encouraging.",
          "marks": []
        }
      ]
    }
  ]
}