{
  "title": "What do you do in your free time",
  "slug": "what-do-you-do-in-your-free-time",
  "publishedAt": "2017-05-16T11:43:23.000Z",
  "excerpt": "Do you go to the mall, or your favorite consignment shop, or everywhere and anywhere there’s a sale going on, only to window-shop and occasionally purchase something and ask yourself all the while “if",
  "image": "",
  "readTime": "5 min",
  "content": [
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Do you go to the mall, or your favorite consignment shop, or everywhere and anywhere there’s a sale going on, only to window-shop and occasionally purchase something and ask yourself all the while “if I only had this…?”",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Do you go to your local coffee shop (or wine bar) and enjoy a good latte while you people-watch and think about life?",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Do you browse through social media sites and the internet in general?",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Do you cook something at home? Or meet a friend for lunch? Or hit up the best party, club or bar in town with your besties?",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Do you go to the gym and get a good workout in?",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Or do you create something? A blog post. A website. A business plan. A DIY gadget. A painting. A bouquet. Anything.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Do you clean your house and reorganize and reposition everything in it?",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Or do you go to the library and learn a new skill?",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Do you binge-watch the latest and greatest on Netflix?",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Or do you just sit, relax and breathe? Or nature-walk? Or ride your bike going nowhere in particular?",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Or do you snack on everything in the fridge?",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Do you take a nap? Or listen to music? Or do you read?",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "I used to think there was a huge dichotomy between spending time doing things that clearly make me a better person and doing things I find to be relaxing or enjoyable that on the surface don’t produce any tangible benefit. In doing these “idle” things, I thought I was therefore wasting my time and therefore my life. Now, although I agree there are plenty of things I can do to waste time, I’ve come to accept that it’s okay. It’s my time, and I can do with it what I please. I have a right to enjoy it, and to spend time doing things that add richness and pleasure to my life.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "What’s important I acknowledge, however, is that there’s no possible way to make time for doing all the things I need to do (to achieve my goals) ",
          "marks": []
        },
        {
          "_type": "span",
          "text": "and",
          "marks": []
        },
        {
          "_type": "span",
          "text": " do all the fun things I want to do, with my limited free time. If I choose to go to the mall (or more likely the thrift store in my case) and shop around for an hour, that’s one hour I could be spending somewhere else. Over time, time adds up (especially if you only get two days off). And so if I spend the majority of it unintentionally doing things that seem fun but produce no real value, I’m going to quickly find myself asking how so much time has elapsed and I have nothing to show for it.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Part of what it means to be a mature adult is being accepting of the fact that regardless of your station in life, your upbringing and/or circumstances, your time is a valuable gift, and what you choose to do with it, or not do with it, is for the most part on you. It’s your responsibility, and the opportunities that emerge (or don’t emerge) out of what you choose to do with your time is largely up to you.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Yes, there’s no such thing as a true meritocracy, one where people become wealthy and successful without the support of their parents, friends, teachers, gatekeepers and/or audience. Some people get picked. And many of those people were lucky enough to have either won the parent lottery or have had a string of lucky opportunities to even get to the point where they could be seriously considered for selection. This is why the majority of people on all those talent shows get rejected, and why you or I never got into Harvard. Yes, some people are certainly more lucky than others. But that being said, it’s what those lucky folks chose to consistently do with their time that enabled them to have (and continue to have) the level of success that they now enjoy. That is, what sets people we typically recognize as being successful apart from everyone else is what they have chosen to do with their time, time and again, and what they continue to do with it.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "You can be successful too, in your own arena. But that begins (and ends) with accepting that what you choose to do with your very limited time is your responsibility. Doing fun things that make you happy is okay, so much as you understand that how you spend every minute of your time is up to you. That the time you spend doing fun things is time you could otherwise spend doing productive things, and that your life, for the most part, is a byproduct of the things you have chosen to do with your time.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "As Marva Collins once said, “It is my right to care nothing about myself but I must be willing to accept the consequences for that failure; and I must never think that those who have chosen to work while I played, rested and slept will share their bounties with me.”",
          "marks": []
        }
      ]
    }
  ]
}