{
  "title": "What can you offer me",
  "slug": "what-can-you-offer-me",
  "publishedAt": "2020-06-15T06:30:00.000Z",
  "excerpt": "That, in one question, is the essence of any entrepreneural venture.",
  "image": "",
  "readTime": "2 min",
  "content": [
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "That, in one question, is the essence of any entrepreneural venture.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "It could be that you deliver insight, expertise, or a tangible physical thing. But when it comes down to it, making money is about providing value—making something worth more than what your customers are willing to give you in return.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "A scam, in sharp contrast, is a platform build on empty promises. Those promises might promise you value, but they rarely deliver on it.*",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "And so, as much as the profiteers of the day would have you denounce, making a living creating tangible, practical value is hard work with no guarantee. (Which is precisely why so few millionaires and billionaires will tell you how to do it).",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "And while there's no shortcut or get-rich-quick scheme to wealth, there's certainly no shortage of people who will try to convince you otherwise.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Hence, the go-to maxim: If you listen in to their pitch and hear nothing but empty promises, you can be sure that's ",
          "marks": []
        },
        {
          "_type": "span",
          "text": "exactly",
          "marks": []
        },
        {
          "_type": "span",
          "text": " what they are.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "*Pyramid schemes work much the same way. Because if some weirdo can convince you that they can make you money if you pay them for their secrets, only to have you 'make money' by using the same no-value tactics and brain-games on other people, they can create an empire in short time. My guess is a little more than 52 weekends of teleseminars, plus a hackeneyed ebook, plus charisma is all it takes.",
          "marks": []
        }
      ]
    }
  ]
}