{
  "title": "When willpower falters",
  "slug": "when-willpower-falters",
  "publishedAt": "2024-10-13T09:03:39.929Z",
  "excerpt": "Something I've picked up on over 34 years of living is that I rarely have the willpower to avoid the things I know I should when I'm stressed, bored, or lonely.",
  "image": "",
  "readTime": "1 min",
  "content": [
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Something I've picked up on over 34 years of living is that I rarely have the willpower to avoid the things I know I should when I'm stressed, bored, or lonely.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Fortunately, I don't feel those emotions all the time. But I experience them often enough that I could potentially undo a lot of progress if I continue to give in to those impulses.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "What I’ve realized is that willpower alone isn’t always enough—because we all have our moments, we all have bad days—and it's impractical to think we'll be perfect all the time.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Better, I think, to acknowledge that consistency matters more than streaks. And that self-compassion is a better approach than the kind of criticism that lets you off the hook.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Instead of spiraling, the combination of \"I'm not perfect\" and \"it's okay to stumble\" makes for a powerful mindset shift. And, with it, the freedom to move forward with renewed determination, knowing that what we do next is more important than what just happened.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Progress, after all, is a journey, and for more people than most, it's rarely a linear path.",
          "marks": []
        }
      ]
    }
  ]
}