{
  "title": "Why did you commit from the start",
  "slug": "why-did-you-commit-from-the-start",
  "publishedAt": "2018-04-04T10:34:01.000Z",
  "excerpt": "Commitment is a scary thing when it forces us to confront the discomfort of change.",
  "image": "",
  "readTime": "2 min",
  "content": [
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Commitment is a scary thing when it forces us to confront the discomfort of change.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Often at the start, we don’t feel the unease of resistance as much as the excitement of starting something new.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "But then, realizing that our dreams and aspirations might actually work out, that this thing we thought we couldn’t do might actually come to fruition, we begin to feel the qualm of not yet being ready to be the future person we imagined ourselves becoming.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "And so comes the pang of self-doubt. ",
          "marks": []
        },
        {
          "_type": "span",
          "text": "Can I really pull this off? Am I’m leaping too far? What if I’m not as good as everyone expects me to be…or not as good as I think I am?",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "One choice is to give up half way through. To convince ourselves we’re merely faking it. That all this work was merely an excursion, a way to pretend like we’re as good as we wish we were. To give up the pursuit of something better entirely, because we’ve convinced ourselves that we’re not nearly as capable as we hoped we were.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Another choice, might be, to consider: “why did you start in the first place?”",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "If you know why you decided to commit from the start, to try to try, to go all in, you’ll be in at a much better frame of mind to make an clear-headed decision about how to proceed.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "You might realize that you started because you felt that taking a risk on something better was worth it, despite the discomfort of trying new things, of experiencing failure, and extending the narrative of who you are and what you’re capable of.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "You might also discover that it’s all in your head, that no one who’s ever taken a leap has ever known with complete confidence they’re as capable as they wish they were. Or that the only way to prove to anyone—especially yourself—that you’re capable of more, is to consistently bet on yourself even when you feel like a ",
          "marks": []
        },
        {
          "_type": "span",
          "text": "fraud",
          "marks": [
            "link-0"
          ]
        },
        {
          "_type": "span",
          "text": ".",
          "marks": []
        }
      ],
      "markDefs": [
        {
          "_key": "link-0",
          "_type": "link",
          "href": "https://www.youtube.com/watch?v=eA8XiC3m7vw"
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "To embrace the fact that bluffing is the gateway to competence, and that faking it is how we all find our footing.",
          "marks": []
        }
      ]
    }
  ]
}