{
  "title": "Writers block is a lame excuse",
  "slug": "writers-block-is-a-lame-excuse",
  "publishedAt": "2016-02-22T23:00:11.000Z",
  "excerpt": "For a long time I chose not to write a blog like this one because I didn’t think I’d have much to say. It seems like for the most part, when I sit down to write I generally don’t know what it is I am ",
  "image": "",
  "readTime": "2 min",
  "content": [
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "For a long time I chose not to write a blog like this one because I didn’t think I’d have much to say. It seems like for the most part, when I sit down to write I generally don’t know what it is I am going to write about. According to the internet (and most of the thinking in most of the schools and colleges across the United States), what I’m apparently experiencing is a textbook case of “",
          "marks": []
        },
        {
          "_type": "span",
          "text": "writer’s block",
          "marks": [
            "link-0"
          ]
        },
        {
          "_type": "span",
          "text": ".” That is, “a temporary psychological inability to begin or continue work on a piece of writing caused in part by literally having no idea what to write about.”",
          "marks": []
        }
      ],
      "markDefs": [
        {
          "_key": "link-0",
          "_type": "link",
          "href": "https://www.google.com/search?client=safari&rls=en&q=writer's+block&ie=UTF-8&oe=UTF-8"
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Thing is, once you start habitually looking for things to write about—noticing the world around you—and committing to a writing practice, you’ll find that there’s actually quite a lot to write about.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "And, if you actually write down those thoughts when they come to mind, soon you’ll have whole notebooks filled with possible ideas to write about. Thus, a couple of ",
          "marks": []
        },
        {
          "_type": "span",
          "text": "moleskin",
          "marks": [
            "link-0"
          ]
        },
        {
          "_type": "span",
          "text": " notebooks or ",
          "marks": []
        },
        {
          "_type": "span",
          "text": "field notes",
          "marks": [
            "link-1"
          ]
        },
        {
          "_type": "span",
          "text": " stashed away everywhere from your car to your nightstand to your gym bag helps tremendously.",
          "marks": []
        }
      ],
      "markDefs": [
        {
          "_key": "link-0",
          "_type": "link",
          "href": "http://www.moleskine.com/us/"
        },
        {
          "_key": "link-1",
          "_type": "link",
          "href": "http://fieldnotesbrand.com/shop/"
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "I don’t believe in writer’s block any more than I believe that you can’t get in shape because working out and exercise is hard on your body. Writer’s block is an excuse for lack of preparation. If you look at the world long enough (or read long enough about whatever it is you plan on writing about) you’ll have no shortage of ideas to write down and expand on. The hard part is in the doing of that looking/seeing/noticing/reading/research and in constructively thinking it over so you actually write something about it worth reading.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "If you do that enough, consistently, as with everything, it will get easier. But that starts everyday with challenging the concept of “writer’s block,” and accepting that what it really and truly is is as an excuse people use to avoid the the inertia and the discomfort of starting that process to begin with.",
          "marks": []
        }
      ]
    }
  ]
}