{
  "title": "Yesterday i made my first cake",
  "slug": "yesterday-i-made-my-first-cake",
  "publishedAt": "2017-04-19T12:55:18.000Z",
  "excerpt": "All handmade, using all (mostly) organic ingredients. I made the icing from scratch too. And aside from my blotchy use of a piping bag, I think I did a pretty extraordinary job.",
  "image": "https://blog.brendanbockes.com/wp-content/uploads/2017/04/6a01a73dc1cc30970d01b7c8ef3d46970b-500wi.jpg",
  "readTime": "2 min",
  "content": [
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "All handmade, using all (mostly) organic ingredients. I made the icing from scratch too. And aside from my blotchy use of a piping bag, I think I did a pretty extraordinary job.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "That was my first time, and it wasn’t horrible. Next time I’ll (hopefully) adjust for what I learned last time and make an even better cake.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "What’s extraordinary is the extreme difference doing something just once makes on our ability to do it again better. You feel more comfortable, you know the steps, you know what to prepare for. Most importantly, you’re aware of your past mistakes, so you can do something different next time.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "We so often avoid doing things we haven’t done before because we fear the inevitable mistakes that come from doing something for the first time, and the pang of regret and failure we feel emotionally as a result. We fear these things so much, in fact, that we generally avoid doing these things altogether.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "And so everything from learning a new skill to cooking at home to traveling the world to trying new jobs are avoided for no real reason other than avoidance of a feeling.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "It’s a lousy way to live your life.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "The alternative is to accept that the hardest part of anything is getting over the inertia of the first try. To try this thing from the mindset of “this might work,” and choose to be accepting (maybe be even embracing) of the your initial and inevitable imperfections. Having done that, even if you screw up, you’ll at least come out the other end having done something new for the first time.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "And if you can do that, just once, you can most certainly do it again better.",
          "marks": []
        }
      ]
    }
  ]
}