{
  "title": "You dont get to remarkable by being cheap",
  "slug": "you-dont-get-to-remarkable-by-being-cheap",
  "publishedAt": "2018-02-21T11:47:03.000Z",
  "excerpt": "I stayed at a two-star hotel for the first time yesterday.",
  "image": "",
  "readTime": "4 min",
  "content": [
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "I stayed at a two-star hotel for the first time yesterday.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "I thought it was a bargain for the price. ",
          "marks": []
        },
        {
          "_type": "span",
          "text": "It wasn't.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "From the lack of clear signage, to the unusable elevator and pool, to the grimy bathroom, broken light fixtures, (clearly) overused pillows, mattresses and schmatte bed sheets, it soon became very clear there was a lack of consideration on the part of management. The front-desk person was cursing on the phone when I walked in. And the flowers were fake. I never even saw a housemaid.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "I seriously doubt this (privately-owned) establishment set out to be arguably the worst (and cheapest) hotel on the block. It probably started off with good intentions and a decent amount of cash.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Here’s what happened (I think): Somewhere along the way, management decided to cut corners.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Every single one of the aforementioned issues was a compromise management made (obviously not all at once) to save money. They discovered they could get by without clear signage, or maybe proper lighting. Decided it would be cheaper to keep the (indoor) pool shut down in the winter, or forgo fixing the elevator. Gave up on upgrading to flat-screen TVs or decent WiFi or new mattresses or bedding. And then they gave up on having a staff that cared about any of those things.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Now they don’t have enough revenue, let alone clients, to fix any of it. And because other options are so ubiquitous, where a different (better) alternative is a search or a click or a short drive down the street, competition is as fierce as ever. So the only (apparent) way to attract customers is to compete on price.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Buy being the cheapest hotel in a twenty-mile radius, they attract those who would forego a few amenities in a exchange for a cheaper stay. But after a single night in a decrepit room, most people leave seeking a viable alternative next-door.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "So they make enough money. But only enough to get by.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Enough to hire the one person janitorial staff who works so much for so little it becomes tempting to scrimp. Or pay the few front-desk associates who are as content with minimum wage as they are with their vapid service skills. And to give the owner a stipend that’s enough to pay down overhead and (maybe) afford him a vacation to get away from it all.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "That’s it.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "No money to fix what’s broken. To invest in infrastructure. Or to afford to to hire people that would otherwise want to work there for reasons other than that they need the money.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "The lesson here is straightforward, if you’re an entrepreneur, you don’t have the luxury of compromise. Certainly every business owner has to be economical, but to practice extreme frugality at the expense of investing in your service or fixing what’s broken is to corrupt your greatest assets in exchange for parsimony. Every chance you get you should be reinvesting your money back into your service, repairing facilities, upgrading systems, or making investments that optimize your results.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "If you’re in the hotel business, that might mean finding inexpensive ways to innovate (free coffee bar for guests?), renovate (flowers, photographs, furniture, new paint), discard the old (who needs televisions?), or updating utilities (a 24/7 three-person repair crew might help…you could hire some engineering seniors from the nearby college).",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "It also might mean investing in the people who work there. Paying a decent wage? Offering discounts? Benefits? Opportunities for growth? Having a culture that demands excellence and empowers it’s employees is perhaps the most effective long-term investment you can make in a business. If you create a culture where people want to come to work everyday, you’ll create a demand for other folks who might want to work there too. More leverage to attract more intelligent, empathetic and dependable hires, which significantly and consistently improves both your service and culture. An positive system that provides an endless stream of both new and returning customers and the financial capital necessary to continue to invest in what’s meaningful.",
          "marks": []
        }
      ]
    },
    {
      "_type": "block",
      "style": "normal",
      "children": [
        {
          "_type": "span",
          "text": "Turns out, the race to cheap is a long and demoralizing slog to mediocrity. Investing in being better than the next guy is a risk. You’ll certainly experience sunk costs. But it’s the (only) best shot you have in creating a product people (customers, clients and employees alike) would miss if it were gone.",
          "marks": []
        }
      ]
    }
  ]
}